[{"job_title": "Content writer", "company_name": "Climatebase", "company_mission": "Solving the #1 challenge faced by organizations working on climate: Hiring. Helping talented professionals discover climate job opportunities and transition into the space — and in doing so, helping climate-focused organizations hire the mission-driven talent they need to succeed.", "company_values": null, "company_products_or_services": "Climate hiring platform; Climatebase Weekly newsletter; Climatebase Fellowship cohort-based courses", "job_responsibilities": "Write content for Climatebase platform, including deep dives of companies, interviews with founders, climate technology reports/summaries, weekly climate news summaries, climate op-eds, and other types of content; Syndicate content across newsletters channels and twitter account; Contribute to the soon-to-launch blog; Come up with new content ideas", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": "Full-time, part-time, or very-part-time", "url": "https://climatebase.org/job/45466609/content-writer?source=jobs_directory"}, {"job_title": "Content Marketing Manager", "company_name": "Climatebase", "company_mission": "Helping climate companies hire mission-driven talent through our platform for climate jobs, content/education, and community.", "company_values": "null", "company_products_or_services": "Hiring platform for climate-focused employers.", "job_responsibilities": "Develop and execute a content marketing strategy; manage newsletters and social media; oversee content production; engage with writers and climate experts; collaborate with product and partnerships teams; analyze and report on performance.", "desired_software_skills": "Mailerlite, Hubspot Marketing, Ghost, social media management tools, SEO tools, Google Analytics.", "education": "null", "required_job_experience": "Experience in content marketing, social media management, and newsletter production.", "equal_employment_opportunity": "Equal opportunity employer that values diversity.", "salary": "Competitive salary and equity.", "benefits": "Health, dental, and vision insurance; flexible working hours; remote-friendly.", "location": "null", "type_of_employment": "Full-time.", "url": "https://climatebase.org/job/46537756/-content-marketing-manager?source=jobs_directory"}, {"job_title": "Customer Success Manager II", "company_name": "Camus Energy", "company_mission": "To lend our software engineering skills to address climate change by accelerating the adoption of renewable energy and the reduction of carbon emissions from the energy grid.", "company_values": null, "company_products_or_services": "Software solutions for the grid", "job_responsibilities": "Develop, manage, and track customer relationships; Act as a project manager for client accounts; Conduct regular check-ins with clients; Collaborate with a wide variety of stakeholders; Represent customer priorities to Product, Engineering, and Leadership teams; Actively participate in the development and improvement of customer success processes and procedures", "desired_software_skills": "Experience with software development processes and concepts", "education": null, "required_job_experience": "Minimum 3-5 years of experience managing customer relationships, projects, or programs in energy, climate, or related software", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regards to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other basis prohibited by law. We also consider qualified applicants with criminal histories consistent with applicable federal, state and local law.", "salary": null, "benefits": null, "location": "San Francisco Bay area", "type_of_employment": null, "url": "https://climatebase.org/job/46463529/customer-success-manager-ii?source=jobs_directory"}, {"job_title": "New York Utility & Regulatory Policy Senior Manager", "company_name": "Building Decarbonization Coalition", "company_mission": "Help propel the transition to clean energy in New York’s buildings", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Formulate and execute the Coalition's strategies in New York; lead work to develop metrics to measure progress; be a point person on regulatory education and communication; identify and implement legal, policy and regulatory solutions; manage contractors; provide testimony and supporting administrative advocacy; convene and facilitate meetings and working groups with relevant stakeholders; track pertinent regulatory dockets and support, coordinate, and possibly intervene alongside BDC partners", "desired_software_skills": null, "education": "Advanced degree, JD and license to practice law in New York is strongly desired", "required_job_experience": "Demonstrated 5+ years experience with administrative dockets and successfully influencing regulatory policy; proven understanding of New York’s public policymaking, legislative and regulatory environments and success in influencing policy agendas and outcomes at local and/or state levels; demonstrated experience and a solid understanding of building electrification, power sector, and/or climate legal, policy and regulatory solutions", "equal_employment_opportunity": "The Building Decarbonization Coalition values diversity in all its forms and is committed to an inclusive and transparent recruitment process. We recruit and hire without regard to race, color, national origin, ancestry, sex, gender, sexual orientation, sexual identity, age, religion, creed, disability (actual or perceived), medical condition including genetic characteristics, marital status, domestic partnership status, citizenship, military service, height, weight, HIV/AIDS status, or any other characteristic protected by state or federal law or local ordinance. People of diverse backgrounds are strongly encouraged to apply.", "salary": "$130,000-$150,000", "benefits": "Comprehensive benefits including health coverage, retirement benefits, paid sick leave, vacation and holidays and access to professional development resources", "location": "New York", "type_of_employment": "Full-time salaried position", "url": "https://climatebase.org/job/46573144/new-york-utility--regulatory-policy-senior-manager?source=jobs_directory"}, {"job_title": "Market Research Analyst", "company_name": "Tradewater", "company_mission": "Prevent catastrophic climate change", "company_values": "Mission-driven; Environmentally conscious", "company_products_or_services": "Collection, control, and destruction of potent, high-impact greenhouse gases; Sales of carbon offset credits", "job_responsibilities": "Research and analyze potential new markets and sales opportunities; Support product development efforts; Develop content and marketing materials; Manage ongoing reports; Maintain CRM", "desired_software_skills": "Proficient with Microsoft Office Suite and other research and project communication tools", "education": "Bachelor's degree in marketing research, strategy, statistics, environmental studies or policy, or related field", "required_job_experience": "1-3 years of related experience", "equal_employment_opportunity": "Equal employment opportunities provided to all employees and applicants for employment; Prohibits discrimination and harassment of any type", "salary": null, "benefits": null, "location": "Remote within the United States", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46573143/market-research-analyst?source=jobs_directory"}, {"job_title": "Partnerships Manager", "company_name": "Tradewater", "company_mission": "To prevent catastrophic climate change through the collection, control, and destruction of potent, high-impact greenhouse gases", "company_values": "Mission-driven; committed to cleaning up the environment", "company_products_or_services": "Collection, control, and destruction of potent, high-impact greenhouse gases", "job_responsibilities": "Assist partners; build relationships with customers and potential partners; generate and qualify leads; conduct outreach; support product development efforts", "desired_software_skills": null, "education": "Bachelor’s degree in business, marketing or related field", "required_job_experience": "5-7 years of sales and/or account management experience; established network with corporate sustainability leaders is a plus", "equal_employment_opportunity": "Provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type", "salary": null, "benefits": null, "location": "Remote within the United States", "type_of_employment": null, "url": "https://climatebase.org/job/46573142/partnerships-manager?source=jobs_directory"}, {"job_title": "Junior Data Scientist", "company_name": "Not specified", "company_mission": "To build scalable, real-time systems that tackle the complexities of grid management and empower the clean energy revolution", "company_values": "Passion, scalability, real-time systems, clean energy revolution", "company_products_or_services": "Modelling solar potential in a building and simulating the behaviour of energy networks", "job_responsibilities": "Building meaningful, valuable products; modelling solar potential in a building and simulating the behaviour of energy networks; designing flexible, resilient foundations; iterating, automating, and improving", "desired_software_skills": "Python and its data science libraries", "education": "Not specified", "required_job_experience": "Experience working with Python and its data science libraries; proven track record and understanding of the process in training models, measuring their accuracy, and iterating on improvements", "equal_employment_opportunity": "Not specified", "salary": "Generous equity alongside salary; salaries will be reviewed at future fundraising", "benefits": "Flexible, remote or office working environment; collaborative and supportive team culture; high degree of autonomy and responsibility; potentially life-changing equity", "location": "Not location specific", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46572903/junior-data-scientist?source=jobs_directory"}, {"job_title": "Executive Assistant", "company_name": "Artyc", "company_mission": "Decarbonize cold chain logistics with refrigerant-free, reusable, active cooling containers to reduce spoilage while increasing access to cold-storage products in rural, international, and underserved communities to address the global cold chain gap.", "company_values": "Environmental and social impact", "company_products_or_services": "Refrigerant-free, reusable, active cooling containers for cold chain logistics", "job_responsibilities": "Support founders, manage office, manage complex personal and professional calendars, schedule internal and external meetings, organize and manage travel arrangements, communicate with external and internal stakeholders, manage finances/expense reports for travel and events", "desired_software_skills": "Gmail, Google calendar, Google tools, Notion, Slack", "education": "null", "required_job_experience": "5+ years of EA experience", "equal_employment_opportunity": "Focused on building a diverse and inclusive team. Encourages applicants who do not meet 100% of the qualifications to apply.", "salary": "null", "benefits": "Competitive compensation and benefits packages as well as flexible working situations whenever possible.", "location": "Remote, US Pacific Standard Time zone", "type_of_employment": "Part-time, 25hrs/week", "url": "https://climatebase.org/job/46572675/executive-assistant?source=jobs_directory"}, {"job_title": "Driver Ambassador- Miami", "company_name": "Circuit", "company_mission": "To reduce congestion and its harmful effects on the environment and our quality of life by getting people out of their cars for short trips, encouraging visitors to park once, and by making connections to existing mass transit hubs.", "company_values": "Energetic team members from diverse backgrounds; tackling big challenges in small steps; flexible work environment with a warm and welcoming company culture.", "company_products_or_services": "Electric shuttles that make mobility easier, smarter, more affordable, and fun.", "job_responsibilities": "Providing safe, efficient, and appropriate transportation to the general public while maintaining and embodying company values and proper treatment of all passengers.", "desired_software_skills": "Ability to use technology such as an iPhone, GPS, and other applications.", "education": "null", "required_job_experience": "3 years of safe driving experience and a valid driver’s license required. A chauffeur’s license or experience driving commercially is a PLUS! A passion for customer service and working with the public.", "equal_employment_opportunity": "Diversity, equity, and inclusion are inherently tied to our mission of accessible and sustainable transportation, while putting people first.", "salary": "Hourly base rate of $15.00 plus tips!", "benefits": "Medical/Dental/Vision benefits are offered after 5 months of full-time hours.", "location": "Miami", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46572425/driver-ambassador--miami?source=jobs_directory"}, {"job_title": "Manager of Customer Success, Data Solutions", "company_name": "LevelTen Energy", "company_mission": "To accelerate the energy transition by facilitating frictionless transactions", "company_values": null, "company_products_or_services": "Renewable transaction infrastructure, cloud-based software, centralized supply, automated analytics, and transaction expertise", "job_responsibilities": "Onboarding & Implementation, Relationship Management, Customer Engagement and Adoption, Customer Support & Training, Renewals and Customer Retention", "desired_software_skills": "Not specified", "education": "Not specified", "required_job_experience": "Around 5+ years of experience in customer service or customer success role preferably in a SaaS company. 1+ years prior experience working with data and analytical products within the energy sector", "equal_employment_opportunity": "Equal Opportunity Employer committed to a diverse and inclusive workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, marital status, age, sexual orientation, gender identity or expression, or any other legally protected status.", "salary": null, "benefits": "Full Medical, Vision and Dental coverage, Wellness Credit, Flexible vacation policy, 11 paid company holidays, Hybrid in-office/work from home schedule", "location": "Not specified", "type_of_employment": "Not specified", "url": "https://climatebase.org/job/46572082/manager-of-customer-success-data-solutions?source=jobs_directory"}, {"job_title": "Internship: Environmental and Social Impact Analyst", "company_name": "BlocPower", "company_mission": "Creating smarter, greener, healthier buildings by reducing barriers to green building upgrades in historically left out communities", "company_values": "Trusted advisors, excellence, care and respect for customers and team members", "company_products_or_services": "Engineering, financing, and project implementation services for green building retrofits", "job_responsibilities": "Identify potential environmental and social impacts, conduct assessments, develop measurement and verification plans, prepare impact assessment reports, collaborate with other departments, oversee project performance post-construction, and support customer success team", "desired_software_skills": null, "education": "Enrolled in Bachelor's or Master's degree in Environmental Science, Environmental Engineering, Mechanical Engineering program, or related field", "required_job_experience": null, "equal_employment_opportunity": "Provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics", "salary": "Competitive compensation", "benefits": "Comprehensive benefits package", "location": null, "type_of_employment": "Internship", "url": "https://climatebase.org/job/46570469/internshipenvironmental-and-social-impact-analyst?source=jobs_directory"}, {"job_title": "Senior Graphic Designer", "company_name": "Pela", "company_mission": "To protect and restore the environment", "company_values": "Community, Creativity, Courage, Awareness and Consciousness", "company_products_or_services": "Creating waste-free products for a sustainable future", "job_responsibilities": "Print design projects, crafting captivating retail marketing materials, conceptualizing visuals, championing brand guidelines, coordinating with internal and external teams", "desired_software_skills": "Adobe Creative Suite (InDesign, Photoshop, and Illustrator)", "education": "null", "required_job_experience": "7+ years of experience as a graphic designer with strong print experience", "equal_employment_opportunity": "Diversity, equity, and inclusion are highly valued", "salary": "null", "benefits": "null", "location": "null", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46570311/senior-graphic-designer?source=jobs_directory"}, {"job_title": "Director of Retail & Distribution Sales", "company_name": "Pela", "company_mission": "To protect and restore the environment", "company_values": "Community, Creativity, Courage, Awareness and Consciousness", "company_products_or_services": "Electric vehicles", "job_responsibilities": "Lead, develop and support the Retail Sales team; Build a robust path to constant assisted-retail exposure; Manage the Retail & Distribution P&L; Foster new partnerships in Retail; Assess and adjust business practices", "desired_software_skills": "Experience with Netsuite or other ERP systems, CRM systems such as Pipedrive, Hubspot, or Salesforce", "education": null, "required_job_experience": "5+ years experience leading a Retail & Distribution Sales team across various Retailers in a matrix environment- including, Direct Selling and Representatives; Exceptional current experience working directly with National Retail customers", "equal_employment_opportunity": "Commitment to cultivating and preserving a company culture of diversity, equity, and inclusion", "salary": "$125-160CAD depending on experience", "benefits": null, "location": "North America", "type_of_employment": null, "url": "https://climatebase.org/job/46570309/director-of-retail--distribution-sales?source=jobs_directory"}, {"job_title": "Director of Marketing", "company_name": "Lomi", "company_mission": "Creating a waste-free future", "company_values": "Community, Creativity, Courage, Awareness and Consciousness", "company_products_or_services": "Eco-friendly products, compostable phone cases, Lomi smart-waste appliance", "job_responsibilities": "Trade Marketing Manager for retail channel growth, onboarding and account management, generating insights, managing national demo and events program, developing marketing calendar, offers, and media plans, leading the development and execution of all channel marketing campaigns, managing the channel marketing budget, producing all sales assets, ensuring the Lomi is well-positioned for success in the marketplace, developing and executing media plans, designing specific marketing strategies/activities by retailer, preparing and leading presentations, collaborating with cross-functional teams", "desired_software_skills": null, "education": null, "required_job_experience": "4+ years experience as a Trade Marketing Manager with deep working knowledge of how major Retailers make decisions, drive sales, and grow brands; you have partnered with Retail Buyers who lead the Consumer Electronics, Small Appliances, or sustainable goods category (US/Canada)", "equal_employment_opportunity": "Commitment to cultivating and preserving a company culture of diversity, equity, and inclusion. We welcome the unique contributions that you can bring in terms of your education, culture, ethnicity, race, sex, gender identity and expression, age, religion, and sexual orientation.", "salary": "$125-150K CAD", "benefits": null, "location": "Canada", "type_of_employment": null, "url": "https://climatebase.org/job/46570308/director-of-marketing?source=jobs_directory"}, {"job_title": "Director HR Business Partner", "company_name": null, "company_mission": null, "company_values": null, "company_products_or_services": null, "job_responsibilities": "Align business objectives with employees and management; formulate partnerships across the HR function; analyze trends and metrics to develop solutions, programs, and policies; manage and resolve complex employee relations issues; maintain knowledge of legal requirements; improve work relationships, build morale, and increase productivity and retention; provide HR policy guidance and interpretation; develop contract terms; identify training needs and participate in evaluation and monitoring of training programs; manage employee retention programs; manage HR OKR and KPIs; perform other related duties as assigned", "desired_software_skills": "Proficient with Google Work Space", "education": "Bachelor's degree required", "required_job_experience": "Minimum of 5 years of experience resolving complex employee relations issues; working knowledge of multiple human resource disciplines", "equal_employment_opportunity": null, "salary": "Salary will be in the range of $170,000-$192,000; pay to be determined by the applicant’s education, experience, knowledge, skills, and abilities, as well as internal equity and alignment with market data", "benefits": "Industry competitive pay; Restricted Stock Units; health insurance package options that include HDHP and PPO, vision, and dental for you and your dependents; paid parental leave; paid life insurance, short-term and long-term disability; Teladoc; 401(k); unlimited time off; cell phone reimbursement; tuition reimbursement; subscription to the Calm app; NYDIG - Bitcoin Savings Plan", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46573078/director-hr-business-partner?source=jobs_directory"}, {"job_title": "Marketing Traffic Manager", "company_name": "Aeroseal, LLC", "company_mission": "Reducing the world's carbon emissions by 1 gigaton annually using leak sealing technologies", "company_values": null, "company_products_or_services": "Aeroseal Duct Sealing technology for the HVAC market", "job_responsibilities": "Organizing project workflow; collaborating with marketing team; determining project budget; building project schedules; providing work resources; analyzing campaign performance; determining deadlines; employing freelancers; communicating with team members", "desired_software_skills": "Proficiency in Microsoft Office programs (especially Excel) and project management software", "education": "Bachelor's degree in a relevant field (Business, Marketing, etc.) is a plus", "required_job_experience": "Minimum of four years of experience in Marketing Traffic Management or an associated position", "equal_employment_opportunity": "Provides equal employment opportunities and prohibits discrimination and harassment of any type", "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46572866/marketing-traffic-manager?source=jobs_directory"}, {"job_title": "Senior Mechanical Engineer", "company_name": "Form Energy", "company_mission": "Developing and commercializing pioneering energy storage technologies to enable the electric grid to run on 100% renewable energy, every day of the year.", "company_values": "Humanity, excellence, and creativity", "company_products_or_services": "Energy storage technologies", "job_responsibilities": "Design, develop, build, and deploy high temperature manufacturing equipment; provide design for manufacturing feedback; collaborate with process and controls engineers; train technicians and other users; work with a diverse set of teams inside and outside the company to achieve overall manufacturing success; be a champion for safety in the development of new equipment and processes.", "desired_software_skills": "Computer-aided design (CAD) preferably Solidworks; PLC hardware selection, programming, troubleshooting, and configuration for automated systems.", "education": "BS in Mechanical Engineering or related field", "required_job_experience": "5+ years of experience in manufacturing equipment design, build, and commissioning; experience in designing high temperature furnaces and processing systems; experience in designing precision motion control systems carrying high loads, and operating at high temperatures; fabrication experience and comfort with being able to be hands on is a must; experience designing equipment used in hazardous locations containing combustible dusts or gasses; familiarity with NFPA codes and furnace safety control systems.", "equal_employment_opportunity": "Form Energy is proud to be an equal opportunity employer.", "salary": "null", "benefits": "Equitable compensation, stock options, medical, dental, and vision insurance for full time employees, flexible Paid Time Off program, 12 weeks of paid parental bonding leave for every employee regardless of gender identity or expression.", "location": "Eighty Four, PA, USA. Relocation assistance is available.", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46572532/senior-mechanical-engineer?source=jobs_directory"}, {"job_title": "Senior Manager, Project Controls", "company_name": "Form Energy", "company_mission": "Developing and commercializing pioneering energy storage technologies to enable the electric grid to run on 100% renewable energy, every day of the year.", "company_values": "Humanity, excellence, and creativity", "company_products_or_services": "Energy storage technologies", "job_responsibilities": "Build and lead the project controls team; develop budgets, cost reports, estimating, planning, integrated schedule, progress reporting, influence procurement and execution strategy, audit the project and change management; maintain source of truth construction budget and cost tracking; provide data and executive level recommendations to support manufacturing development and planning; set goals, core principles, a culture of innovation, procedures and high expectations to enable highest team performance; build effective relationships to ensure alignment with other leaders and company goals.", "desired_software_skills": null, "education": "Bachelor’s degree in Construction Management or Engineering Degree or equivalent relevant experience.", "required_job_experience": "10+ years of experience in construction planning and project controls, delivering on large commercial, industrial and manufacturing projects; 5+ years leading a project controls team (schedule, estimating and cost).", "equal_employment_opportunity": "Form Energy is proud to be an equal opportunity employer.", "salary": null, "benefits": "Equitable compensation, stock options, medical, dental, and vision insurance for full time employees (100% of employee premiums and 80% of dependent premiums covered), flexible Paid Time Off program, and 12 weeks of paid parental bonding leave for every employee regardless of gender identity or expression.", "location": "Eighty Four, PA", "type_of_employment": null, "url": "https://climatebase.org/job/46572524/senior-manager-project-controls?source=jobs_directory"}, {"job_title": "Technical Specialist, ISCC", "company_name": "SCS Global Services", "company_mission": "To advance sustainable development goals through independent assessment, the application of sound science, and innovative solutions.", "company_values": null, "company_products_or_services": "Sustainability standards and third-party certification", "job_responsibilities": "Perform onsite audits with clients; manage administrative tasks related to communications with clients; audit project coordination; review of audit reports and corrective action plans; and other audit-related documents; documentation and some of its review of all the above-mentioned activities on an ongoing basis in the SCS database and support in document and procedure development; manage daily email and telephone/Skype/Microsoft Teams communications with auditors, SCS program personnel and contractors, scheme owners, clients, and accreditation organizations.", "desired_software_skills": "Proficiency in Microsoft Office including Microsoft Word, Excel, and Power Point; proficiency in Salesforce, Outlook, and database management systems preferred.", "education": "Bachelor's degree in a technical field (e.g. chemistry, biology, environmental science, or related), or a minimum two years of experience working in a related sector.", "required_job_experience": "Scope-specific work or study experience, and/or applied experience in manufacturing, agricultural or food production systems; 1+ years’ experience in project management or administration; experience with third party auditing, certification systems, or other applicable industry standards and/or knowledge.", "equal_employment_opportunity": "SCS Global Services provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws.", "salary": "$50k to $70k Annually", "benefits": "Computer and ergonomic necessities provided for remote work.", "location": null, "type_of_employment": "Full-time, remote work allowed.", "url": "https://climatebase.org/job/46572002/technical-specialist-iscc?source=jobs_directory"}, {"job_title": "Board Relations Coordinator", "company_name": "NRDC", "company_mission": "To protect the planet's wildlife and wild places and to ensure the rights of all people to clean air, clean water, and healthy communities.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Manage high-level administrative needs of the Board Relations team as they relate to supporting the work of NRDC’s Board of Trustees, Board Committees, Task Forces, and communications; Support will include complex calendar management and scheduling, drafting correspondence, data management, file maintenance, invoice and expense reporting, and special projects; Work with the Board Relations Manager to liaise with, and provide administrative support for, the Board Chair and their office; Help manage relationships with, and communications to, individual board members and stakeholders; Effectively liaise with venues and vendors and manage the contracting process for board events; Assist the team in drafting, editing, formatting and proofreading memos, presentations, correspondence, and other materials; Coordinate and assist in the management of special projects related to furthering the work of the Board; Organize and coordinate internal team meetings and retreats, including scheduling and technology needs; Coordinate mailings of materials, gifts, and swag; Provide ad-hoc, hands-on support for a variety of projects and roles; Be an accessible, collaborative, roll-up-the-sleeves problem solver; Other duties as assigned.", "desired_software_skills": "PowerPoint, Excel, Word, Outlook, Salesforce, SharePoint, BoardEffect, Asana, Concur", "education": "Bachelor's degree or equivalent experience preferred.", "required_job_experience": "Minimum of 3 – 6 years of administrative and scheduling experience required.", "equal_employment_opportunity": "NRDC is committed to advancing diversity, equity, and inclusion, both in our work and in our workplace. We believe that celebrating and actively welcoming diverse voices and perspectives is essential to solving the planet's most pressing environmental problems, and we encourage applications from candidates whose identities have been historically under-represented in the environmental movement. We are an equal opportunity employer and do not discriminate in hiring or employment on the basis of race, color, religion, gender, gender identity or expression, marital status, sexual orientation, national origin, citizenship, age, disability, veteran status, or any other characteristic protected by federal, state, or local law. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.", "salary": "$73,000 to $80,000", "benefits": "We offer competitive salaries, excellent benefits, and a supportive working environment.", "location": "New York", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46571621/board-relations-coordinator?source=jobs_directory"}, {"job_title": "Stakeholder Engagement Manager", "company_name": "Climeworks", "company_mission": "Enable Climeworks’ Roadmap by engaging all relevant stakeholders for Climeworks DAC+S projects in the US", "company_values": "Positive, purpose driven, and unique culture where the wellbeing of our Climeworkers is key", "company_products_or_services": null, "job_responsibilities": "Analyze opportunities for enhanced and inclusive communication with partners, communities, and policymakers to advance Climeworks scale up roadmap; lead the development and implementation of multiple strategic communication initiatives to support the successful execution of Climeworks projects; lead the development of our permitting strategy, coordinate project specific regulatory roadmaps, and lead the integration of non-technical risks into project development plans; work with various internal and external partners to create an integrated approach to major projects communication and public affairs initiatives; enable and create a social license to operate Climeworks DAC+S projects and develop a community engagement strategy for the selected sites", "desired_software_skills": null, "education": "Bachelor's degree in engineering, liberal arts, or political science", "required_job_experience": "At least 10 years of experience in strategic project communications as well as in stakeholder and community engagement for large scale industrial projects, ideally in the field of CCS (Process design & field); experience in navigating non-routine regulatory processes, including public hearings, and managing significant and complex non-technical risks", "equal_employment_opportunity": "Encourage everyone to apply! All qualified applicants are considered for positions, so bring along your knowledge, personal experiences, and fresh perspectives, and together we can solve one of humankind’s greatest challenges", "salary": "$125,000-$165,000", "benefits": "Paid time off including vacation and sick leave; flexibility in terms of working time; RSUs; competitive 401k plan; comprehensive health insurance including dental coverage for you and your dependents", "location": "California, New York, Washington DC, Texas, Missouri, North Carolina or willing to relocate", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569998/stakeholder-engagement-manager?source=jobs_directory"}, {"job_title": "Founding Product Engineer", "company_name": "Get Weatherized", "company_mission": "To help insulation and weatherization companies operate more efficiently, thereby reducing the amount of carbon released into the atmosphere for the sake of heating and cooling.", "company_values": null, "company_products_or_services": "SaaS tool for insulation & weatherization companies", "job_responsibilities": "Senior coder with strong intrinsic motivation to fight climate change; using best practices to build and maintain the product; creating a culture together with the team.", "desired_software_skills": "Ruby on Rails; Hotwire", "education": null, "required_job_experience": "Senior engineer with extensive knowledge of what can go wrong, and why.", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "US remote", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569906/founding-product-engineer?source=jobs_directory"}, {"job_title": "Hardware Engineer (Power Electronics)", "company_name": "Impulse", "company_mission": "To build delightful, high-performance products for everyday needs that enable rewarding, long-term, scalable solutions for whole-home electrification.", "company_values": null, "company_products_or_services": "Hardware products for whole-home electrification", "job_responsibilities": "Developing next generation hardware products; Building long-term architectures; Working closely with the whole team during product definition and development; Building first-in-class prototypes; Bringing up production-intent devices; Shepherding volume manufacturing for a new product category", "desired_software_skills": null, "education": "Engineering degree or related experience in volume electrical hardware", "required_job_experience": "Experienced in shipping electrical hardware from first prototypes to volume production, particularly in consumer, energy, or automotive domains; Comfortable using schematic capture and layout tools to design high performance PCBs; Experienced working with colleagues and external partners to develop constraints and specifications collaboratively - software, mechanical, thermal, manufacturing and others; History of successful engagements with external design and manufacturing partners", "equal_employment_opportunity": "Impulse is an equal opportunity employer. We celebrate diversity and prohibit discrimination and harassment. We are committed to creating an inclusive environment for all employees where everyone feels safe and welcome.", "salary": "$150,000/yr - $225,000/yr (Exact compensation may vary based on skills and experience)", "benefits": "Meaningful equity in a fast-moving company with top investors; Generous benefits including health, vision, dental, and fitness", "location": "San Francisco", "type_of_employment": null, "url": "https://climatebase.org/job/46479917/hardware-engineer-power-electronics?source=jobs_directory"}, {"job_title": "Quality Assurance Technician", "company_name": "CarbonCure Technologies", "company_mission": "To make concrete a climate solution, reducing embodied carbon emissions in the built environment and transforming concrete plants into a worldwide network of carbon removal factories.", "company_values": "Innovation, sustainability, trust, high performance, collaboration, and straight talk.", "company_products_or_services": "Integrated decarbonization platform with hardware, software, and services to reduce the carbon footprint of concrete products.", "job_responsibilities": "Perform, design, and improve quality assurance testing and inspection for the CO₂ Injection system. Troubleshoot disqualified systems and make suggestions for resolution. Collaborate with other teams to ensure adequate standards are in place to minimize errors with equipment on-site. Programming of PLC software and understanding of PCB hardware and firmware. Improve the quality by streamlining the assurance process and standardizing the manufacturing process (durability testing & calibration testing). Create tools and documentation, record keeping and continuous improvement. Provide feedback to the Production team with the goal of increasing the overall production rate through reduced production defects and rework. Assist Production team with assembly, packing and other duties, as required. Special projects as required based on changes to the company / teams needs.", "desired_software_skills": "Programming of PLC software and understanding of PCB hardware and firmware.", "education": "Bachelor’s degree program or a technical degree in Civil, Chemical, Electrical, Environmental, Industrial, or other Engineering disciplines.", "required_job_experience": "Previous hands-on experience with electrical or mechanical systems is considered an asset.", "equal_employment_opportunity": "CarbonCure is committed to fostering diversity in our organization and building an equitable and inclusive environment for people of all backgrounds and experiences. We especially encourage members of traditionally underrepresented communities to apply, including women, people of color, LGBTQ people, veterans, and people with disabilities.", "salary": "null", "benefits": "null", "location": "Dartmouth office", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569862/quality-assurance-technician?source=jobs_directory"}, {"job_title": "Inside Sales Coordinator", "company_name": "CarbonCure Technologies", "company_mission": "To make concrete a climate solution, reducing embodied carbon emissions in the built environment and transforming concrete plants into a worldwide network of carbon removal factories.", "company_values": "Innovation, sustainability, trust, high performance, collaboration, and straight talk.", "company_products_or_services": "Integrated decarbonization platform with hardware, software, and services to reduce the carbon footprint of concrete products.", "job_responsibilities": "Provide pre and post-sale customer account project management and customer services, work with concrete producer customers and inter-departmental teams, identify sales opportunities and follow up on sales leads, collect customer information, identify upselling and plant expansion opportunities, use CRM software to track customer progress, and stay informed on industry and market trends.", "desired_software_skills": "Salesforce.com", "education": null, "required_job_experience": "3+ years' experience in sales coordinator, project coordinator, customer success, or equivalent, project management skills, collaboration and communication skills, exceptional written communication skills, strong customer service orientation, and background in construction or industrial gases industries would be considered a strong asset.", "equal_employment_opportunity": "Fostering diversity in the organization and building an equitable and inclusive environment for people of all backgrounds and experiences. Encouraging members of traditionally underrepresented communities to apply, including women, people of color, LGBTQ people, veterans, and people with disabilities.", "salary": null, "benefits": null, "location": "Remote work in Canada", "type_of_employment": "Permanent, full-time position", "url": "https://climatebase.org/job/46538281/inside-sales-coordinator?source=jobs_directory"}, {"job_title": "Corporate Controller", "company_name": "CarbonCure Technologies", "company_mission": "To make concrete a climate solution, reducing embodied carbon emissions in the built environment and transforming concrete plants into a worldwide network of carbon removal factories.", "company_values": "Innovation, sustainability, trust, high performance, collaboration, and straight talk.", "company_products_or_services": "Integrated decarbonization platform with hardware, software, and services to reduce the carbon footprint of concrete products.", "job_responsibilities": "Ensure accurate financial reporting, implement and maintain internal controls, and scale financial and operating systems.", "desired_software_skills": "Proficient in financial management systems and software, with advanced Excel skills. Experience with NetSuite preferred.", "education": "BA/BS in Accounting, Finance or a related field required. CPA designation required.", "required_job_experience": "Minimum 5 years of experience in public accounting and minimum 3 years of experience in a controller role leading a full cycle accounting team required.", "equal_employment_opportunity": "Committed to fostering diversity in our organization and building an equitable and inclusive environment for people of all backgrounds and experiences. We especially encourage members of traditionally underrepresented communities to apply, including women, people of color, LGBTQ people, veterans, and people with disabilities.", "salary": "null", "benefits": "null", "location": "null", "type_of_employment": "Permanent, full-time hybrid position.", "url": "https://climatebase.org/job/46531822/corporate-controller?source=jobs_directory"}, {"job_title": "Regional Sales Manager", "company_name": "CarbonCure Technologies", "company_mission": "To make concrete a climate solution, reducing embodied carbon emissions in the built environment and transforming concrete plants into a worldwide network of carbon removal factories.", "company_values": "Innovation, sustainability, trust, high performance, collaboration, and straight talk.", "company_products_or_services": "Integrated decarbonization platform for the concrete industry.", "job_responsibilities": "Leading the go-to-market business strategy and account management for a geographical territory in the US; ownership of the entire sales cycle; fostering value-driven relationships with senior leaders and decision-makers; identifying customer pain and educating customers on value proposition to solve that pain; collaborating with teammates to build and demonstrate proof of concepts; initiating, negotiating, and closing new contracts with customers; and traveling up to 25% required (when restrictions are removed).", "desired_software_skills": null, "education": null, "required_job_experience": "5-10 years driving complex sales and business development in the concrete and/or Construction sector a plus; proven track record of methodically building up a business and hitting targets.", "equal_employment_opportunity": "Fostering diversity in the organization and building an equitable and inclusive environment for people of all backgrounds and experiences. Encouraging members of traditionally underrepresented communities to apply, including women, people of color, LGBTQ people, veterans, and people with disabilities.", "salary": null, "benefits": null, "location": "Remote", "type_of_employment": "Permanent, full-time", "url": "https://climatebase.org/job/46519246/regional-sales-manager?source=jobs_directory"}, {"job_title": "Project Manager: Strategy & Policy", "company_name": "Wasted*", "company_mission": "To catalyze the global transition to circular sanitation and change the way people think about waste. To restore one of nature's most fundamental cycles and show that we are deeply interconnected to all life on our planet.", "company_values": null, "company_products_or_services": "Transforming the portable sanitation industry", "job_responsibilities": "Conduct research and analysis on municipal waste policies; Assess the business opportunity of converting municipal biosolids into biochar; Collaborate with consultants to develop a Techno-Economic Model from our pilot project; Cultivate and maintain relationships with policymakers, government agencies, and relevant stakeholders; Collaborate closely with internal teams to align policy initiatives with overall business objectives", "desired_software_skills": "Near-expert XLS skills", "education": "Bachelor's degree in public policy, political science, environmental science, or a related field (Master's degree preferred)", "required_job_experience": "Experience in business development and scenario modeling", "equal_employment_opportunity": "Wasted* is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "salary": "Commensurate with experience and qualifications", "benefits": "Wasted* offers a comprehensive benefit package", "location": "Vermont", "type_of_employment": "Full-time, In-Person (Hybrid or Remote is negotiable)", "url": "https://climatebase.org/job/46566638/project-manager-strategy--policy?source=jobs_directory"}, {"job_title": "Staff Accountant", "company_name": "Streetleaf", "company_mission": null, "company_values": null, "company_products_or_services": null, "job_responsibilities": "Reviews, prepares, reconciles, and analyzes accounting records and documentation, and financial reports; Assists in the development of financial projections and forecasts; Monitors, reviews, and verifies accounting records and transactions for accuracy, timeliness, and adequacy of supporting documentation; Ensures compliance with internal policies, agency rules and regulations, and generally accepted accounting principles; Clarifies and researches issues as necessary; Checks figures and documents for correct entry, mathematical accuracy, and proper codes; Determines current financial balances to produce schedules, summary reports, trial balances, income statements, and/or financial statements in accordance with accounting methods; Performs one or more specialized accounting duties including, but not limited to, monitoring receivables, controlling cash or negotiable items, and related inventory procedures; Updating and maintaining records of payments and expenditures through AR and AP software system (Bill.com); Organizing automated payments to be sent out to company’s customers; Ensuring all payments are organized according to the company’s budgets and contracts; Continue to develop accounting department SOPs as Company’s operations grow", "desired_software_skills": "QuickBooks or a similar accounting tool; AR and AP software system (Bill.com)", "education": "Bachelor’s Degree or higher", "required_job_experience": "2+ years in a related field", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569861/staff-accountant?source=jobs_directory"}, {"job_title": "2024 Gulf Regional Office Clerkship", "company_name": "Earthjustice", "company_mission": "Protecting the health and iconic ecosystems of the Gulf from fossil fuel expansion", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Supporting frontline communities in protecting the Gulf region from toxic pollution and fossil fuel expansion", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Houston, Texas (can accommodate remote clerks in Texas, Louisiana, and Mississippi)", "type_of_employment": null, "url": "https://climatebase.org/job/46569574/2024-gulf-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Clean Energy Program Clerkship", "company_name": "Earthjustice", "company_mission": "Transitioning the power sector away from fossil fuels to build the clean, equitable energy system of tomorrow", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist in the Clean Energy Program's FERC team, state PUC team, or coal ash team", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "Equal opportunity employer", "salary": null, "benefits": null, "location": "San Francisco, Los Angeles, Denver, Chicago, Philadelphia, Washington D.C., and New York", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569571/2024-clean-energy-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Biodiversity Defense Program Clerkship", "company_name": "Earthjustice", "company_mission": "Environmental protection", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting the Biodiversity Defense Program", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569564/2024-biodiversity-defense-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Toxic Exposure and Health Program Clerkship", "company_name": "Earthjustice", "company_mission": "To ensure that all people have safe workplaces, neighborhoods, and schools; have access to safe drinking water and food; and live in homes that are free of hazardous chemicals.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist in litigation and advocacy efforts to ensure safe environments and communities; Conduct legal research; Draft legal documents and correspondence; Attend meetings and court hearings; Perform administrative tasks as needed.", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569560/2024-toxic-exposure-and-health-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Fossil Fuels Program Clerkship", "company_name": "Earthjustice", "company_mission": "Confronting fossil fuel industry expansion through litigation, administrative advocacy, and partnership.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist program attorneys with legal research, drafting pleadings, and case-related tasks; Conduct factual research and due diligence; Attend court proceedings and meetings with clients and partners; Participate in team meetings and strategy sessions.", "desired_software_skills": null, "education": "Enrollment in a JD program at an accredited law school.", "required_job_experience": null, "equal_employment_opportunity": "Earthjustice is an equal opportunity employer and highly values diversity.", "salary": null, "benefits": null, "location": "U.S. Gulf Region and Appalachia", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569558/2024-fossil-fuels-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Sustainable Food and Farming Program Clerkship", "company_name": null, "company_mission": "Improve the nation's food system through litigation and advocacy for safe and healthy food, climate-friendly farming, reduced reliance on dangerous pesticides and chemical fertilizers, and animal farms.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist the Sustainable Food and Farming Program with administrative tasks, legal research, and case management.", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569556/2024-sustainable-food-and-farming-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Tribal Partnerships Program Clerkship", "company_name": "Earthjustice", "company_mission": "Legal advocacy for the environment", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Work with attorneys to develop strategies for tribal and Indigenous partners; Conduct outreach with tribes and Indigenous communities; Provide added capacity and expertise on matters of concern to tribes and Indigenous communities", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569553/2024-tribal-partnerships-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Community Partnerships Program Clerkship", "company_name": null, "company_mission": "To remove environmental hazards and secure access to environmental benefits in frontline communities", "company_values": "Collective action, community-led movements, advocacy strategies, challenging the status quo, enforcing laws meant to protect communities", "company_products_or_services": null, "job_responsibilities": "Assisting with community outreach, research, and data analysis related to environmental issues", "desired_software_skills": null, "education": "Undergraduate or graduate degree in environmental studies, public policy, or related field", "required_job_experience": null, "equal_employment_opportunity": "Equal opportunity employer", "salary": null, "benefits": null, "location": "Unknown", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569550/2024-community-partnerships-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Midwest Clerkship", "company_name": "Earthjustice", "company_mission": "Legal advocacy and litigation for environmental protection", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Legal advocacy and litigation for environmental protection in the Midwest region", "desired_software_skills": null, "education": "Law degree", "required_job_experience": null, "equal_employment_opportunity": "Equal Employment Opportunity employer and does not discriminate on the basis of race, national origin, religion, gender, age, disability, veteran status, sexual orientation, gender identity, or any other characteristic protected by federal, state or local law.", "salary": null, "benefits": null, "location": "Midwest region", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569546/2024-midwest-clerkship?source=jobs_directory"}, {"job_title": "2024 Oceans Program Clerkship", "company_name": "Earthjustice", "company_mission": "Protecting the environment and advocating for environmental justice", "company_values": "Environmental protection, justice, and sustainability", "company_products_or_services": "Legal advocacy for environmental causes", "job_responsibilities": "Working on a mix of international and domestic ocean matters, litigation support", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "Equal employment opportunity employer and values a diverse workforce", "salary": null, "benefits": null, "location": "United States", "type_of_employment": "Summer clerkship", "url": "https://climatebase.org/job/46569540/2024-oceans-program-clerkship?source=jobs_directory"}, {"job_title": "2024 International Program Clerkship", "company_name": "Earthjustice", "company_mission": "reduce dependence on dirty fossil fuels and speed the transition to clean energy", "company_values": null, "company_products_or_services": null, "job_responsibilities": "provide clerical support to the International Program staff", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569537/2024-international-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Northern Rockies Clerkship", "company_name": "Northern Rockies Office", "company_mission": "safeguarding some of America’s last remaining grizzly bears, wolves, bison and other wildlife; preventing the industrialization of culturally and ecologically important lands in the Northern Rockies; and stemming the extraction and burning of fossil fuels that feed global warming", "company_values": null, "company_products_or_services": null, "job_responsibilities": "regional, ecosystem- and community-based litigation focused on safeguarding some of America’s last remaining grizzly bears, wolves, bison and other wildlife; preventing the industrialization of culturally and ecologically important lands in the Northern Rockies; and stemming the extraction and burning of fossil fuels that feed global warming; advocate in state and federal courts, as well as administrative forums such as state public utility commissions; work in close partnership with area Tribes and tribal interests on issues ranging from coal extraction and destructive hard-rock mining to grizzly bear protection", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Northern Rockies", "type_of_employment": null, "url": "https://climatebase.org/job/46569535/2024-northern-rockies-clerkship?source=jobs_directory"}, {"job_title": "2024 Florida Regional Office Clerkship", "company_name": null, "company_mission": "Protect waterways and biodiversity, promote clean energy, defend communities from pollution", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist lawyers in environmental cases, conduct legal research, draft legal documents, attend hearings and meetings", "desired_software_skills": null, "education": "Law degree or currently enrolled in law school", "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Florida", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569532/2024-florida-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Northeast Clerkship", "company_name": "Northeast Regional Office", "company_mission": "Protecting public health and the climate and ensuring a healthy environment for all in the Northeast", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Litigate and advocate for a just and equitable transition to clean energy and on behalf of communities disproportionately impacted by environmental harms; Address the serious health and environmental threats associated with gas-burning power plants, landfills, toxic chemicals, and other sources of pollution; Partner with clients and communities to implement New York’s landmark climate law, the Climate Leadership and Community Protection Act, including by electrifying buildings and the transportation sector and to secure clean drinking water and housing for all", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Northeast", "type_of_employment": null, "url": "https://climatebase.org/job/46569530/2024-northeast-clerkship?source=jobs_directory"}, {"job_title": "2024 Mid-Pacific Clerkship", "company_name": "Earthjustice", "company_mission": "to protect natural and cultural resources throughout Hawai‘i and the larger Pacific region", "company_values": null, "company_products_or_services": null, "job_responsibilities": "conduct legal research and writing; file suit under national and state laws such as the Clean Water Act and the Endangered Species Act, and the Hawai‘i Environmental Policy Act; enforce environmental rights and traditional and customary Native Hawaiian rights that are enshrined in the Hawai‘i Constitution", "desired_software_skills": null, "education": "law student", "required_job_experience": "none", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Honolulu", "type_of_employment": "summer law clerk", "url": "https://climatebase.org/job/46569528/2024-mid-pacific-clerkship?source=jobs_directory"}, {"job_title": "2024 Northwest Clerkship", "company_name": "Northwest Office", "company_mission": "To protect the people and environment of the Pacific Northwest", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Representing environmental and citizens’ groups in Washington, Oregon, and Idaho; Taking cases with national and international scope", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Pacific Northwest", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569526/2024-northwest-clerkship?source=jobs_directory"}, {"job_title": "2024 Alaska Regional Office Clerkship", "company_name": "Alaska Regional Office", "company_mission": "Protecting Alaska coastal rain forest, safeguarding America’s Arctic, and conserving the Bering Sea and Gulf of Alaska marine ecosystem. Wildlife conservation, protection of lands and waters from mining activities, air and water quality enforcement, and national park and other public lands management.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting with legal research and writing; assisting with preparation of briefs, pleadings, and other legal documents; assisting with all aspects of trial preparation; performing various office tasks, including but not limited to, answering phones, photocopying, scanning, emailing, and mailing; and performing other duties as assigned.", "desired_software_skills": null, "education": "Law student", "required_job_experience": null, "equal_employment_opportunity": "Equal Employment Opportunity employer", "salary": null, "benefits": null, "location": "Juneau and Anchorage, Alaska", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569524/2024-alaska-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Washington DC Clerkship", "company_name": "Earthjustice", "company_mission": "Environmental protection through legal action", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Litigation and advocacy for environmental issues", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Washington, D.C.", "type_of_employment": null, "url": "https://climatebase.org/job/46569518/2024-washington-dc-clerkship?source=jobs_directory"}, {"job_title": "2024 California Regional Office Clerkship", "company_name": "Earthjustice", "company_mission": "To protect the environment and promote environmental justice through lawsuits and administrative advocacy under federal and California environmental laws.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Working alongside attorneys and advocates in San Francisco and Los Angeles offices on lawsuits and administrative advocacy to protect the environment and promote environmental justice.", "desired_software_skills": null, "education": "Law degree or currently enrolled in law school.", "required_job_experience": null, "equal_employment_opportunity": "Equal Opportunity Employer.", "salary": null, "benefits": null, "location": "San Francisco and Los Angeles, California.", "type_of_employment": "Summer law clerk.", "url": "https://climatebase.org/job/46569515/2024-california-regional-office-clerkship?source=jobs_directory"}, {"job_title": "Staff Firmware Engineer", "company_name": "Artyc", "company_mission": "Decarbonize cold chain logistics with refrigerant-free, reusable, active cooling containers", "company_values": "Environmental and social impact; registered Public Benefit Corporation", "company_products_or_services": "Refrigerant-free, reusable, active cooling containers", "job_responsibilities": "Guide firmware development across multiple products; communicate with engineering leaders and product owners; develop new firmware; participate in code-reviews; work cross-functionally with mechanical and software engineering counterparts; manage a firmware team", "desired_software_skills": "C/C++; RTOS fundamentals; project management tools such as Asana and Jira", "education": "null", "required_job_experience": "Background with project management tools such as Asana and Jira; experience with IoT products; part of full product lifecycle development", "equal_employment_opportunity": "Focused on building a diverse and inclusive team", "salary": "Competitive salary", "benefits": "Paid time off; Medical, Dental & Vision; 401k; Company retreats, bi-weekly lunches, team events & more!", "location": "Fremont, CA", "type_of_employment": "Full-time and hybrid", "url": "https://climatebase.org/job/46569452/staff-firmware-engineer?source=jobs_directory"}, {"job_title": "Senior Firmware Engineer", "company_name": "Artyc", "company_mission": "Decarbonize cold chain logistics with refrigerant-free, reusable, active cooling containers", "company_values": "Environmental and social impact", "company_products_or_services": "Refrigerant-free, reusable, active cooling containers", "job_responsibilities": "Update existing products and develop new firmware for upcoming products; Prototype hardware and troubleshoot early issues including building firmware testing suite for existing products; Perform bench-level testing at our in-house R&D lab; Develop test programs, testing, technical documentation, and correspondence with internal and external sources; Work collaboratively cross-functionally with mechanical, software engineering, product, sales, and design teams", "desired_software_skills": "Production firmware in C/C++; RTOS fundamentals", "education": "null", "required_job_experience": "Background with project management tools such as Asana and Jira; Background with IoT products; Have been part of full product lifecycle development", "equal_employment_opportunity": "Focused on building a diverse and inclusive team", "salary": "Competitive salary", "benefits": "Paid time off; Medical, Dental & Vision; 401k; Company retreats, bi-weekly lunches, team events & more!", "location": "Fremont, CA", "type_of_employment": "Full-time and hybrid", "url": "https://climatebase.org/job/46569451/senior-firmware-engineer?source=jobs_directory"}, {"job_title": "Firmware Engineer", "company_name": "Artyc", "company_mission": "Decarbonize cold chain logistics with refrigerant-free, reusable, active cooling containers", "company_values": "Environmental and social impact", "company_products_or_services": "Refrigerant-free, reusable, active cooling containers for cold chain logistics", "job_responsibilities": "Write production firmware for existing and upcoming products; prototype hardware and troubleshoot early issues; maintain code in central repository and participate in weekly code reviews; perform bench-level testing at in-house R&D lab; contribute to development of test programs, testing, technical documentation, and correspondence with internal and external sources; work collaboratively cross-functionally with mechanical, software engineering, product, sales, and design teams", "desired_software_skills": "C/C++, RTOS fundamentals, project management tools such as Asana and Jira", "education": "null", "required_job_experience": "Background with IoT products", "equal_employment_opportunity": "Focused on building a diverse and inclusive team", "salary": "Competitive salary", "benefits": "Paid time off; Medical, Dental & Vision; 401k; Company retreats, bi-weekly lunches, team events & more!", "location": "Fremont, CA", "type_of_employment": "Full-time and hybrid", "url": "https://climatebase.org/job/46569450/firmware-engineer?source=jobs_directory"}, {"job_title": "Technical Support Manager, Customer Success", "company_name": "Tigo Energy", "company_mission": "To accelerate the adoption of solar energy worldwide", "company_values": "Customer centricity; Culture and empowerment", "company_products_or_services": "Flex MLPE with innovative solutions that enhance safety, increase energy production, and decrease operating costs of photovoltaic systems", "job_responsibilities": "Manage TSE team members; Ensure customer satisfaction; On-board new TSE members; Contribute to knowledge management system; Manage daily operations; Forecast staffing resource requirements", "desired_software_skills": "Experience with VOiP and CRM systems", "education": "Degree or certification in Electronics (preferred)", "required_job_experience": "Experience in managing a technical support team; Experience in Solar (preferred); Experience/knowledge of PV Systems and technologies (preferred)", "equal_employment_opportunity": null, "salary": "Not specified", "benefits": "Rewarding salaries; Excellent benefits; Uninhibited work culture", "location": "Remote role based in the United States", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569178/technical-support-manager-customer-success?source=jobs_directory"}, {"job_title": "Technical Support Engineer, Customer Success (Italy)", "company_name": "Tigo Energy", "company_mission": "To accelerate the adoption of solar energy worldwide", "company_values": "Customer-centric, Collaboration, Mentorship, Growth & learning, Technical expertise, Continual Process Improvement, Rigor for data", "company_products_or_services": "Flex MLPE (Module Level Power Electronics) solutions that enhance safety, increase energy production, and decrease operating costs of photovoltaic (PV) systems", "job_responsibilities": "Be the first point of contact for customers via email, chat, phone and online support systems; develop a deep understanding of the Tigo Energy product line; respond to and resolve product or service problems; work effectively across various communication channels; retain customers by answering questions, finding solutions and providing suggestions that lead to short and long-term success; collect and analyze feedback after completing customer inquiries; work collaboratively with colleagues to solve customer issues as quickly and efficiently as possible; report customer complaints and escalate issues when necessary to prevent potential churn; relay product flaws and failures to engineering and product development teams", "desired_software_skills": "Computer proficient, Microsoft office, Salesforce, and Zendesk or equal ticketing platform", "education": "Bachelor’s degree or an equivalent combination of education and experience", "required_job_experience": "2-5 years of technical support experience, knowledge of PV solar is preferred; working in the solar industry is a plus", "equal_employment_opportunity": null, "salary": "Not specified", "benefits": "Rewarding salaries, excellent benefits, an uninhibited work culture", "location": "Remote role based in either Italy or Germany", "type_of_employment": null, "url": "https://climatebase.org/job/46569177/technical-support-engineer-customer-success-italy?source=jobs_directory"}, {"job_title": "Technical Support Engineer, Customer Success (Germany)", "company_name": "Tigo Energy", "company_mission": "Accelerate the adoption of solar energy worldwide", "company_values": "Customer-centric, collaboration, mentorship, growth & learning, technical expertise, continual process improvement, rigor for data", "company_products_or_services": "Flex MLPE solutions for photovoltaic (PV) systems", "job_responsibilities": "Provide technical support to customers via email, chat, phone, and online support systems; resolve product or service problems; meet team metrics for support performance and customer satisfaction; retain customers by answering questions and finding solutions; collect and analyze feedback; work collaboratively with colleagues to solve customer issues; report customer complaints and escalate issues when necessary; relay product flaws and failures to engineering and product development teams", "desired_software_skills": "Microsoft Office, Salesforce, Zendesk or equal ticketing platform", "education": "Bachelor's degree or equivalent combination of education and experience", "required_job_experience": "2-5 years of technical support experience; knowledge of PV solar is preferred", "equal_employment_opportunity": "null", "salary": "null", "benefits": "Rewarding salaries, excellent benefits, uninhibited work culture", "location": "Remote role based in either Italy or Germany", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569176/technical-support-engineer-customer-success-germany?source=jobs_directory"}, {"job_title": "Sales Engineer, Customer Success (Thailand)", "company_name": "Tigo Energy", "company_mission": "Accelerating the adoption of solar energy worldwide", "company_values": "Collaboration; Mentorship; Growth & learning; Technical expertise; Continual process improvement; Rigor for data", "company_products_or_services": "Flex MLPE solutions for photovoltaic systems", "job_responsibilities": "Provide pre-sales assistance to existing and prospective clients; Manage large projects from design to site commissioning; Train customers and colleagues; Participate in customer visits, trade shows and roadshows; Collect and analyze feedback; Collaborate with colleagues to solve customer issues; Report customer complaints and escalate issues when necessary", "desired_software_skills": "None mentioned", "education": "None mentioned", "required_job_experience": "Strong engineering background; Previous experience with solar and pre-sales engineering is a plus", "equal_employment_opportunity": "None mentioned", "salary": "None mentioned", "benefits": "Rewarding salaries; Excellent benefits; Uninhibited work culture", "location": "Thailand (remote)", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569174/sales-engineer-customer-success-thailand?source=jobs_directory"}, {"job_title": "Sales Engineer, Customer Success", "company_name": "Tigo Energy", "company_mission": "To accelerate the adoption of solar energy worldwide", "company_values": "Collaboration; Mentorship; Growth & learning; Technical expertise; Continual Process Improvement; Rigor for data", "company_products_or_services": "Flex MLPE solutions that enhance safety, increase energy production, and decrease operating costs of photovoltaic (PV) systems", "job_responsibilities": "Provide pre-sales assistance to Tigo existing and prospective clients; Manage large projects from design to site commissioning; Train customers and Tigo colleagues; Participate in customer visits, trade shows and roadshows; Work collaboratively with colleagues to solve customer issues", "desired_software_skills": null, "education": null, "required_job_experience": "Strong Engineering background; Previous experience with solar and pre-sales engineering is a plus", "equal_employment_opportunity": null, "salary": null, "benefits": "Rewarding salaries; Excellent benefits; Uninhibited work culture", "location": "Remote role based in Malaysia", "type_of_employment": null, "url": "https://climatebase.org/job/46569173/sales-engineer-customer-success-malaysia?source=jobs_directory"}, {"job_title": "Product Support Engineer, Customer Success", "company_name": "Tigo Energy", "company_mission": "To accelerate the adoption of solar energy worldwide", "company_values": "Collaboration; Mentorship; Growth & learning; Technical expertise; Continual Process Improvement; Rigor for data", "company_products_or_services": "Flex MLPE solutions for photovoltaic (PV) systems", "job_responsibilities": "Assisting Technical Support Engineers with various issues; Providing service excellence to critical customers; Developing a deep understanding of the Tigo Energy product line; Responding to and resolving product or service problems that customers are experiencing; Meeting team metrics for support performance and customer satisfaction; Working effectively across various communication channels: phone, email, live chat, online support systems; Retaining customers by answering questions, finding solutions and providing suggestions that lead to short and long-term success; Collecting and analyzing feedback after completing customer inquiries; Working collaboratively with colleagues to solve customer issues as quickly and efficiently as possible; Reporting customer complaints and escalating issues when necessary to prevent potential churn; Relaying product flaws and failures to engineering and product development teams", "desired_software_skills": "Microsoft Office; Salesforce; Zendesk or equal ticketing platform", "education": "Bachelor's degree or an equivalent combination of education and experience", "required_job_experience": "2-5 years of technical support experience; Knowledge of PV solar is preferred", "equal_employment_opportunity": null, "salary": "Not specified", "benefits": "Excellent benefits", "location": "Remote role based in the United States", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569171/product-support-engineer-customer-success?source=jobs_directory"}, {"job_title": "Electrify My Government Campaign Contractor", "company_name": "Rewiring America", "company_mission": "To eliminate carbon pollution in the United States by electrifying everything", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Build and execute campaign plans to secure a commitment from FEMA to 'build back electric' and/or grow and train the electric workforce across federal programs and funding streams; lay out the vision and groundwork required for the campaign; leverage experience, knowledge, and connections to build and execute campaign plans for FEMA and/or workforce development", "desired_software_skills": null, "education": null, "required_job_experience": "7+ years of work experience, including direct federal and/or state agency work in energy and climate change, ideally with direct experience in disaster recovery (at FEMA or related agency) or workforce development (at DOL, Dept of Ed, or related agency); direct and in-depth federal agency experience, including working to affect change from within or without federal agencies and departments; experience working with executive-level positions, ideally in federal agencies or also in either the public or private sectors, i.e. Members of Congress, Administration officials, or C-suite executives; experience leading projects", "equal_employment_opportunity": null, "salary": "Paid by an hourly rate or lump sum, contingent upon the review and approval of the contractor's proposal", "benefits": "TBD", "location": null, "type_of_employment": "Temporary contract position", "url": "https://climatebase.org/job/46568296/electrify-my-government-campaign-contractor?source=jobs_directory"}, {"job_title": "Senior HVAC Design Engineer (mid-level)", "company_name": "BlocPower", "company_mission": "creating smarter, greener, healthier buildings for all by reducing the barriers to money-saving, quality-of-life-improving green building upgrade", "company_values": "trusted advisors, excellence, care, respect", "company_products_or_services": "engineering, financing and project implementation services for green building upgrade", "job_responsibilities": "developing heat pump design and construction standards, ensuring quality control on electrification projects, developing drawings and specifications, conducting commissioning on the installation of heat pump systems, building the company into a leader in electrifying residential and commercial buildings", "desired_software_skills": "null", "education": "BS or Masters degree in Engineering field", "required_job_experience": "5-10 years of experience with HVAC design in a collaborative project development environment, design of heat pump systems in residential and commercial buildings", "equal_employment_opportunity": "equal employment opportunities(EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics", "salary": "null", "benefits": "medical, dental, and vision insurance, long-term disability insurance, generous vacation policy, maternity and paternity leave benefits per NYC law, commuter and bike-to-work benefits, 401(k)", "location": "New York City, NY (remote)", "type_of_employment": "full-time", "url": "https://climatebase.org/job/46567203/senior-hvac-design-engineer-mid-level---new-york-city-ny-remote?source=jobs_directory"}, {"job_title": "Program Manager", "company_name": "BlocPower", "company_mission": "Creating smarter, greener, healthier buildings for all by reducing the barriers to money-saving, quality-of-life-improving green building upgrade", "company_values": "Trusted advisors that get things done for our customers by using data to make the right decisions; support and expect excellence from our team members; treat both our customers and ourselves with care and respect", "company_products_or_services": "Engineering, financing and project implementation services for green building upgrades in historically left out communities across the country", "job_responsibilities": "Coordinate communication and deliverables between the City of San Jose, its partners and internal stakeholders; build and maintain relationships with program partners including local community organizations, local utility, strategic engineering, design and financing firms, local equipment distributors, contractors, and other potential clients and collaborators; develop and implement a program execution plan with key project milestones, with weekly reporting; act as project manager for BlocPower teammates, potentially including local project managers, business development associates, and others; manage the day-to-day details related to electrification project due diligence, site development, construction, commercial agreements, construction agreements and operational issues; serve as the 'air traffic control' for project pipeline; maintain internal accountability to ensure projects are moving forward, and developing and executing strategic recommendations to build the project pipeline as needed; serve as the public face of BlocPower in the market, which includes attending and speaking at local events, speaking to press etc.", "desired_software_skills": "SalesForce and ProCore", "education": "null", "required_job_experience": "Experience with coordination and management of projects; interdisciplinary understanding of energy, electrification, public incentives and the built environment, particularly in California", "equal_employment_opportunity": "BlocPower provides equal employment opportunities(EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics", "salary": "null", "benefits": "Medical coverage: Health, Dental, Vision, 401(k) Benefits, OneMedical membership (where available); Generous PTO", "location": "San Jose, CA", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46567202/program-manager?source=jobs_directory"}, {"job_title": "Product Marketing Specialist", "company_name": "EnergyHub", "company_mission": "Empowering utilities and their customers to create a clean, distributed energy future", "company_values": null, "company_products_or_services": "Enterprise software that lets consumers turn their smart thermostats, electric cars, water heaters, and other products into virtual power plants", "job_responsibilities": "Understand and support Sales, Marketing, and Customer Success teams; create compelling and persuasive product marketing collateral; support go-to-market plans for new product launches; conduct competitive analysis; work with Brand Marketing to ensure consistent messaging; collaborate with cross-functional teams; measure and analyze effectiveness of product marketing initiatives", "desired_software_skills": "Expertise in Microsoft Excel, PowerPoint", "education": null, "required_job_experience": "3-5 years of experience in product marketing, preferably in the technology or energy industry", "equal_employment_opportunity": "EnergyHub is an Equal Opportunity Employer", "salary": "$70,000 - $85,000", "benefits": "100% paid medical for employees, 401(k) with employer match, casual environment, flexibility to set own schedule, fully stocked fridge and pantry, free Citi Bike membership, secure bike rack, gym subsidy, paid parental leave, education assistance program", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46567103/product-marketing-specialist?source=jobs_directory"}, {"job_title": "Human Resources Coordinator - Remote Optional", "company_name": "Center for EcoTechnology", "company_mission": "Helping people and businesses save energy and reduce waste to build a just and equitable transition to the low-carbon economy", "company_values": null, "company_products_or_services": "Residential and commercial energy audits, building materials reuse, food waste diversion, LEED and passive house design, electrification financing and incentive programs", "job_responsibilities": "Recruiting, onboarding, HR data and systems oversight, employee lifecycle assistance", "desired_software_skills": "MS Office, applicant tracking systems, other recruitment software", "education": "Bachelor's degree, PHR certification helpful", "required_job_experience": "2-4 years of experience in human resources through undergraduate studies, volunteer activities, or paid or unpaid work", "equal_employment_opportunity": "CET is an equal opportunity employer and provider. Diverse applicants are encouraged to apply. Military service assignments and any verified work performed on a volunteer basis may be included.", "salary": "Hourly non-exempt position", "benefits": "Vacation, holiday, and personal/sick time; medical, dental, and vision insurance; life insurance; disability insurance; and a retirement plan with a company match.", "location": "Remote or Northampton, Massachusetts", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46566949/human-resources-coordinator---remote-optional?source=jobs_directory"}, {"job_title": "Sr. Applications Developer (SalesForce)", "company_name": "Pivot Bio", "company_mission": "Pioneering game-changing advances in agriculture by harnessing the power of naturally occurring microbes to provide nutrients to crops and new sustainable ways for farmers to reduce the usage of fertilizers as they work to help feed the world’s growing population.", "company_values": null, "company_products_or_services": "Agricultural products that utilize naturally occurring microbes to provide nutrients to crops and reduce the usage of fertilizers.", "job_responsibilities": "Administer, design, develop & support Salesforce Platform (Sales, Service, Marketing/Pardot, Experience Cloud); Take ownership of release cycles to implement and deploy new/updates to existing applications and code; Develop Apex (classes and triggers), experience building Custom User Interface, including Visualforce pages/Lightning pages, Aura Components and Lightning Web Components; Design and develop sites using Experience Site Builder and customization of experience site interface; Design and develop custom workflows, approval flows as fits the business needs and prepare solution design documents, data flow diagrams, test cases etc. as needed; Adhere to Salesforce best practices, maintain code documentation, and write / maintain test classes for all custom development; Work directly with business (Commercial Sales & Marketing, Agronomy) understanding the business requirements & provide timely and apt solutions; Closely work with extended IT team developers to design, develop, test, implement & support system solutions primarily in Salesforce Platform.", "desired_software_skills": "Salesforce Platform (Sales, Service, Marketing/Pardot, Experience Cloud), Apex (classes and triggers), Visualforce pages/Lightning pages, Aura Components and Lightning Web Components, Experience Site Builder, Salesforce API’s and bulkification, HTML, CSS, JavaScript", "education": "Bachelor’s degree in computer science, Engineering, and Information Systems is preferred", "required_job_experience": "6+ years of hands-on development & design experience with Salesforce Platform is required", "equal_employment_opportunity": null, "salary": "$120,000-$150,000 USD", "benefits": "Competitive package in a disruptive startup; Stock options; Health/Dental/Vision insurance with employer-paid premiums; Life, Short-Term and Long-Term Disability policies; Employee Assistance Program with free referrals and discounts; 401(k) plan, 3% Match; Commuter benefits; Annual Training & Development support; Flexible vacation policy with a generous holiday schedule", "location": "Remote - US", "type_of_employment": null, "url": "https://climatebase.org/job/46132176/sr-applications-developer-salesforce?source=jobs_directory"}, {"job_title": "Client Strategy Associate", "company_name": "Carbon Direct", "company_mission": "Enable organizations to reduce, remove, and utilize their emissions with carbon science", "company_values": "Purpose-driven, diverse, global impact", "company_products_or_services": "Carbon management and sustainability solutions", "job_responsibilities": "Advise and consult clients on carbon management and sustainability strategies; prepare and deliver high-quality reports and presentations; lead and contribute to sustainability plans; conduct comprehensive assessments of clients' carbon footprints and environmental impacts; stay up-to-date with advancements in carbon removal technologies and environmental policies; collaborate with clients' stakeholders; mentor and provide guidance to junior colleagues; act as a thought leader and represent the company at industry events", "desired_software_skills": "Google Slides or Powerpoint", "education": "Masters or Ph.D. or equivalent degree in a relevant scientific discipline such as environmental science, chemistry, sustainability, or a related field; or a Bachelor’s degree in one of these fields and equivalent additional experience", "required_job_experience": "At least 5 years in sustainability consulting, carbon removal, climate change mitigation, or a related field, preferably working with high-profile clients", "equal_employment_opportunity": "Carbon Direct is an equal opportunity employer and does not discriminate on the basis of race, color, gender, religion, age, sexual orientation, national or ethnic origin, disability, marital status, veteran status, or any other occupationally irrelevant criteria", "salary": "null", "benefits": "Comprehensive nationwide medical, dental, and vision coverage; flexible vacation policy and ten company-wide holidays plus annual winter break; 16 weeks of fully paid parental and family leave with no tenure requirement; remote-friendly work culture with annual company-wide retreats; reimbursement for work-from-home setup", "location": "Remote with preference in London, UK, Western Europe, East Coast USA", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46569786/client-strategy-manager?source=jobs_directory"}, {"job_title": "2024 Gulf Regional Office Clerkship", "company_name": "Earthjustice", "company_mission": "Protecting the health and iconic ecosystems of the Gulf from fossil’s last-ditch effort to pollute our homes and wreck our climate.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Supporting frontline communities in protecting the Gulf from fossil fuel expansion and toxic pollution.", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Houston, Texas, with the ability to accommodate remote clerks in Texas, Louisiana, and Mississippi.", "type_of_employment": null, "url": "https://climatebase.org/job/46569575/2024-gulf-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Gulf Regional Office Clerkship", "company_name": "Earthjustice", "company_mission": "Protecting the health and iconic ecosystems of the Gulf from fossil’s last-ditch effort to pollute our homes and wreck our climate", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Supporting frontline communities as they work to protect the health and iconic ecosystems of the Gulf from fossil’s last-ditch effort to pollute our homes and wreck our climate; Deepening regional partnerships and building power to defend ecosystems; Protecting communities from toxic pollution; Stopping large scale fossil fuel expansion at its source", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Houston, Texas, with remote clerks in Texas, Louisiana, and Mississippi", "type_of_employment": null, "url": "https://climatebase.org/job/46569573/2024-gulf-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Clean Energy Program Clerkship", "company_name": "Earthjustice", "company_mission": "Transitioning power sector away from fossil fuels to build clean, equitable energy system of tomorrow", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Clerkship within Clean Energy Program, assisting FERC team, state PUC team, and coal ash team", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "San Francisco, Los Angeles, Denver, Chicago, Philadelphia, Washington D.C., and New York", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569572/2024-clean-energy-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Clean Energy Program Clerkship", "company_name": "Earthjustice", "company_mission": "Transitioning the power sector away from fossil fuels to build the clean, equitable energy system of tomorrow", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting the Clean Energy Program in various tasks", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "San Francisco, Los Angeles, Denver, Chicago, Philadelphia, Washington D.C., and New York", "type_of_employment": null, "url": "https://climatebase.org/job/46569570/2024-clean-energy-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Clean Energy Program Clerkship", "company_name": "Earthjustice", "company_mission": "Transitioning the power sector away from fossil fuels to build the clean, equitable energy system of tomorrow", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Clerical work within the Clean Energy Program", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "San Francisco, Los Angeles, Denver, Chicago, Philadelphia, Washington D.C., and New York", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569569/2024-clean-energy-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Clean Energy Program Clerkship", "company_name": "Earthjustice", "company_mission": "Transitioning the power sector away from fossil fuels to build the clean, equitable energy system of tomorrow", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting with legal research and writing, participating in meetings and calls, supporting litigation and advocacy efforts, and conducting factual research and analysis", "desired_software_skills": null, "education": "Currently enrolled in law school", "required_job_experience": null, "equal_employment_opportunity": "Earthjustice is an equal opportunity employer and highly values diversity", "salary": null, "benefits": null, "location": "San Francisco, Los Angeles, Denver, Chicago, Philadelphia, Washington D.C., and New York", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569567/2024-clean-energy-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Clean Energy Program Clerkship", "company_name": "Earthjustice", "company_mission": "Transitioning the power sector away from fossil fuels to build the clean, equitable energy system of tomorrow", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting with legal research and writing; Supporting litigation and administrative advocacy; Conducting factual research and investigation; Providing litigation and administrative support for cases", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "Equal Opportunity Employer", "salary": null, "benefits": null, "location": "San Francisco, Los Angeles, Denver, Chicago, Philadelphia, Washington D.C., and New York", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569566/2024-clean-energy-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Clean Energy Program Clerkship", "company_name": "Earthjustice", "company_mission": "Transitioning the power sector away from fossil fuels to build the clean, equitable energy system of tomorrow", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist with legal research and writing; Support litigation efforts; Attend court proceedings; Conduct factual research and analysis; Participate in client meetings and strategy sessions", "desired_software_skills": null, "education": "Current law student or recent law school graduate", "required_job_experience": null, "equal_employment_opportunity": "Earthjustice is an equal opportunity employer and highly values diversity", "salary": null, "benefits": null, "location": "San Francisco, Los Angeles, Denver, Chicago, Philadelphia, Washington D.C., and New York", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569565/2024-clean-energy-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Biodiversity Defense Program Clerkship", "company_name": "Earthjustice", "company_mission": "Environmental protection", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting in the Biodiversity Defense Program's work to protect habitat critical to the survival of species", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569563/2024-biodiversity-defense-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Biodiversity Defense Program Clerkship", "company_name": "Earthjustice", "company_mission": "To fight for the right of all to a healthy environment.", "company_values": "Environmental protection; Collaboration; Strategic approach", "company_products_or_services": "Legal advocacy for environmental protection", "job_responsibilities": "Assist with legal research and writing; Support attorneys with case development and management; Attend meetings and conferences; Perform administrative tasks", "desired_software_skills": "Proficiency in Microsoft Office; Familiarity with legal research databases", "education": "Undergraduate degree in progress or completed; Interest in environmental law", "required_job_experience": "No prior legal experience required", "equal_employment_opportunity": "Earthjustice is an equal opportunity employer.", "salary": "Not specified", "benefits": "Not specified", "location": "Not specified", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569562/2024-biodiversity-defense-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Biodiversity Defense Program Clerkship", "company_name": "Earthjustice", "company_mission": "Environmental protection", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist in the Biodiversity Defense Program's work to protect habitat critical to the survival of species", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569561/2024-biodiversity-defense-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Toxic Exposure and Health Program Clerkship", "company_name": "Earthjustice", "company_mission": "Ensure safe workplaces, neighborhoods, and schools; access to safe drinking water and food; and homes free of hazardous chemicals through litigation, advocacy, and partnership with health-focused organizations.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Clerkship in the Toxic Exposure and Health Program involving legal research, writing, and analysis; drafting legal documents; assisting with case development and strategy; and attending meetings and court proceedings.", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "Equal employment opportunity employer and does not discriminate on the basis of race, color, national origin, religion, sex, gender identity, disability, sexual orientation, age, or any other basis prohibited by law.", "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569559/2024-toxic-exposure-and-health-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Fossil Fuels Program Clerkship", "company_name": "Earthjustice", "company_mission": "Confronting the massive build-out of fossil fuel infrastructure through litigation, administrative advocacy, and partnership to advance an end to U.S. oil and gas extraction and production, and stop new infrastructure (e.g. petrochemical facilities, export terminals and pipelines), focused in the U.S. Gulf Region and Appalachia.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting in legal research and writing; Conducting factual research; Assisting with preparation of briefs and other legal documents; Supporting attorneys in case development and management; Attending court proceedings and client meetings with attorneys; and Participating in team meetings and strategy sessions.", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "U.S. Gulf Region and Appalachia", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569557/2024-fossil-fuels-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Sustainable Food and Farming Program Clerkship", "company_name": "Sustainable Food and Farming Program", "company_mission": "Improve the nation's food system through litigation and advocacy", "company_values": null, "company_products_or_services": "Advocacy for safe and healthy food, climate-friendly farming, reduced reliance on dangerous pesticides and chemical fertilizers, and animal farms", "job_responsibilities": "Clerkship in the Sustainable Food and Farming Program", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569555/2024-sustainable-food-and-farming-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Sustainable Food and Farming Program Clerkship", "company_name": "Sustainable Food and Farming Program", "company_mission": "To improve the nation's food system through litigation and advocacy", "company_values": "Safe and healthy food; climate-friendly farming; reduced reliance on dangerous pesticides and chemical fertilizers; animal farms - not animal factories", "company_products_or_services": null, "job_responsibilities": "Assist with litigation and advocacy efforts related to sustainable food and farming; work in partnership with communities, advocacy groups, scientists, and others; research and analyze legal issues related to sustainable food and farming", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569554/2024-sustainable-food-and-farming-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Tribal Partnerships Program Clerkship", "company_name": "Earthjustice", "company_mission": "Environmental protection and advocacy", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assisting the Tribal Partnerships Program attorneys with legal research, writing, and analysis; Conducting outreach with tribes and Indigenous communities; Assisting with case development and litigation support; Providing added capacity and expertise on matters of concern to tribes and Indigenous communities", "desired_software_skills": null, "education": "Enrollment in a JD program", "required_job_experience": null, "equal_employment_opportunity": "Equal Opportunity Employer", "salary": null, "benefits": null, "location": null, "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569552/2024-tribal-partnerships-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Tribal Partnerships Program Clerkship", "company_name": "Earthjustice", "company_mission": "null", "company_values": "null", "company_products_or_services": "legal services for environmental and social justice", "job_responsibilities": "develop cross-cutting strategies for tribal and Indigenous partners; provide added capacity and expertise on matters of concern to tribes and Indigenous communities; litigate cases; collaborate and consult with program and regional office attorneys; conduct outreach with tribes and Indigenous communities; work with Earthjustice’s other teams as needed", "desired_software_skills": "null", "education": "law degree or equivalent", "required_job_experience": "null", "equal_employment_opportunity": "null", "salary": "null", "benefits": "null", "location": "null", "type_of_employment": "clerkship", "url": "https://climatebase.org/job/46569551/2024-tribal-partnerships-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Community Partnerships Program Clerkship", "company_name": null, "company_mission": "To remove environmental hazards and secure access to environmental benefits through collective action with community partners.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Support community-led movements using advocacy strategies to challenge polluters, close regulatory loopholes, increase transparency, and enforce environmental laws.", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569549/2024-community-partnerships-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Community Partnerships Program Clerkship", "company_name": null, "company_mission": "Removing environmental hazards and securing access to environmental benefits in frontline communities", "company_values": "Collective action, community-led movements, advocacy strategies, transparency, and enforcing laws to protect communities from environmental harm", "company_products_or_services": null, "job_responsibilities": "Supporting community-led movements, challenging harmful social and political structures, advocating for environmental justice, representing frontline communities in legal challenges against polluters, increasing transparency and enforcing environmental laws", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569548/2024-community-partnerships-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Midwest Clerkship", "company_name": "Earthjustice", "company_mission": "Environmental advocacy and litigation", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Legal advocacy and litigation in Earthjustice's Midwest Office across all program areas", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Midwest", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569545/2024-midwest-clerkship?source=jobs_directory"}, {"job_title": "2024 Oceans Program Clerkship", "company_name": "Earthjustice", "company_mission": "Protecting marine biodiversity and stopping the expansion of offshore oil and gas drilling", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Working on a mix of international and domestic ocean matters", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569539/2024-oceans-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Oceans Program Clerkship", "company_name": "Earthjustice", "company_mission": "Protecting marine biodiversity and stopping the expansion of offshore oil and gas drilling", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Working on a mix of international and domestic ocean matters", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569538/2024-oceans-program-clerkship?source=jobs_directory"}, {"job_title": "2024 International Program Clerkship", "company_name": "Earthjustice", "company_mission": "Reduce dependence on dirty fossil fuels and speed the transition to clean energy through domestic and international legal advocacy", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist International Program staff with legal research and writing, document review and production, and other tasks as assigned", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46569536/2024-international-program-clerkship?source=jobs_directory"}, {"job_title": "2024 Northern Rockies Clerkship", "company_name": "Northern Rockies Office", "company_mission": "Safeguarding some of America’s last remaining grizzly bears, wolves, bison and other wildlife; preventing the industrialization of culturally and ecologically important lands in the Northern Rockies; and stemming the extraction and burning of fossil fuels that feed global warming.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Engages in regional, ecosystem- and community-based litigation focused on safeguarding some of America’s last remaining grizzly bears, wolves, bison and other wildlife; preventing the industrialization of culturally and ecologically important lands in the Northern Rockies; and stemming the extraction and burning of fossil fuels that feed global warming. Advocates in state and federal courts, as well as administrative forums such as state public utility commissions. Works in close partnership with area Tribes and tribal interests on issues ranging from coal extraction and destructive hard-rock mining to grizzly bear protection.", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Northern Rockies", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569534/2024-northern-rockies-clerkship?source=jobs_directory"}, {"job_title": "2024 Florida Regional Office Clerkship", "company_name": null, "company_mission": "To protect waterways and biodiversity, promote clean energy, and defend communities from pollution through legal action and advocacy", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist attorneys and support staff with legal research, writing, and other tasks related to environmental law cases in federal, state, and administrative courts", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Florida", "type_of_employment": null, "url": "https://climatebase.org/job/46569533/2024-florida-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Florida Regional Office Clerkship", "company_name": null, "company_mission": "Protect waterways and biodiversity, promote clean energy, and defend communities from pollution in Florida", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist with legal work in federal, state, and administrative courts and advocacy before agencies and other fora", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Florida", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569531/2024-florida-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Northeast Clerkship", "company_name": "Northeast Regional Office", "company_mission": "Protecting public health and the climate and ensuring a healthy environment for all in the Northeast", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Litigating and advocating for a just and equitable transition to clean energy and on behalf of communities disproportionately impacted by environmental harms; addressing the serious health and environmental threats associated with gas-burning power plants, landfills, toxic chemicals, and other sources of pollution; partnering with clients and communities to implement New York’s landmark climate law, the Climate Leadership and Community Protection Act, including by electrifying buildings and the transportation sector and to secure clean drinking water and housing for all", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Northeast", "type_of_employment": null, "url": "https://climatebase.org/job/46569529/2024-northeast-clerkship?source=jobs_directory"}, {"job_title": "2024 Mid-Pacific Clerkship", "company_name": "Earthjustice", "company_mission": "To protect natural and cultural resources throughout Hawai‘i and the larger Pacific region", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Summer law clerk with excellent research, writing, and oral advocacy skills; solid academic records; demonstrated commitment to the environment, community empowerment, and diversity, equity, and inclusion initiatives; the ability to be a team player; and a strong work ethic, sense of initiative, and sound judgment. File suit under national laws such as the Clean Water Act and the Endangered Species Act, and state laws such as the Hawai‘i Environmental Policy Act. Enforce environmental rights and traditional and customary Native Hawaiian rights that are enshrined in the Hawai‘i Constitution.", "desired_software_skills": null, "education": "Law student (second-year law students are generally favored, but applications from first year law students will be considered)", "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Honolulu", "type_of_employment": "Summer law clerk", "url": "https://climatebase.org/job/46569527/2024-mid-pacific-clerkship?source=jobs_directory"}, {"job_title": "2024 Northwest Clerkship", "company_name": "Northwest Office", "company_mission": "Protecting people and environment of Pacific Northwest", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Representing environmental and citizens’ groups in Washington, Oregon, and Idaho; taking cases with national and international scope", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Pacific Northwest", "type_of_employment": null, "url": "https://climatebase.org/job/46569525/2024-northwest-clerkship?source=jobs_directory"}, {"job_title": "2024 Alaska Regional Office Clerkship", "company_name": "Alaska Regional Office", "company_mission": "Protecting the Alaska coastal rain forest, safeguarding America’s Arctic, and conserving the Bering Sea and Gulf of Alaska marine ecosystem. Wildlife conservation, protection of lands and waters from mining activities, air and water quality enforcement, and national park and other public lands management.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Clerical duties in the Alaska Regional Office", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "Equal Employment Opportunity employer", "salary": null, "benefits": null, "location": "Juneau and Anchorage, Alaska", "type_of_employment": null, "url": "https://climatebase.org/job/46569523/2024-alaska-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Alaska Regional Office Clerkship", "company_name": "Alaska Regional Office", "company_mission": "Protecting the Alaska coastal rain forest, safeguarding America’s Arctic, and conserving the Bering Sea and Gulf of Alaska marine ecosystem. Wildlife conservation, protection of lands and waters from mining activities, air and water quality enforcement, and national park and other public lands management.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Performing clerical duties such as data entry, filing, and answering phones. Assisting with legal research and writing. Attending court hearings, depositions, and client meetings. ", "desired_software_skills": null, "education": "Law degree or currently enrolled in law school", "required_job_experience": null, "equal_employment_opportunity": "Equal Employment Opportunity employer and does not discriminate on the basis of race, color, national origin, sex, religion, age, disability, political beliefs, sexual orientation, or marital/family status.", "salary": null, "benefits": null, "location": "Juneau and Anchorage, Alaska", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569522/2024-alaska-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 Washington DC Clerkship", "company_name": "Earthjustice", "company_mission": "Environmental law", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Litigation and advocacy for environmental issues in the Mid-Atlantic states and national issues such as climate change, air pollution, water and sanitation, hazardous wastes, and energy efficiency standards", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Washington, D.C.", "type_of_employment": null, "url": "https://climatebase.org/job/46569517/2024-washington-dc-clerkship?source=jobs_directory"}, {"job_title": "2024 Rocky Mountain Clerkship", "company_name": "Earthjustice", "company_mission": "Protect vulnerable communities from pollution and other harmful impacts and challenge decisions by federal agencies that would harm the region’s remarkable and biologically diverse public lands, water, and wildlife.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist attorneys with legal research and writing; Attend court proceedings and hearings; Participate in client meetings; Engage in outreach and communication efforts with partner organizations and communities.", "desired_software_skills": null, "education": "Completion of at least two years of law school or equivalent by the beginning of the clerkship.", "required_job_experience": null, "equal_employment_opportunity": "Earthjustice is an equal opportunity employer and highly values diversity.", "salary": null, "benefits": null, "location": "Rocky Mountain Office", "type_of_employment": "Clerkship", "url": "https://climatebase.org/job/46569516/2024-rocky-mountain-clerkship?source=jobs_directory"}, {"job_title": "2024 California Regional Office Clerkship", "company_name": "Earthjustice", "company_mission": "Protect the environment and promote environmental justice through lawsuits and administrative advocacy under federal environmental laws and California statutes.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Work alongside attorneys and advocates in San Francisco and Los Angeles offices.", "desired_software_skills": null, "education": "Law degree", "required_job_experience": "None specified", "equal_employment_opportunity": "Equal Employment Opportunity Employer", "salary": null, "benefits": null, "location": "San Francisco and Los Angeles", "type_of_employment": "Summer law clerkship", "url": "https://climatebase.org/job/46569514/2024-california-regional-office-clerkship?source=jobs_directory"}, {"job_title": "2024 California Regional Office Clerkship", "company_name": "Earthjustice", "company_mission": "To protect the environment and promote environmental justice through lawsuits and administrative advocacy under federal and California environmental laws.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Working alongside attorneys and advocates in San Francisco and Los Angeles offices, participating in the Diversity and Inclusion Fellowship Program organized by the Environmental Law Section of the California Lawyers Association (CLA Section).", "desired_software_skills": null, "education": "Law degree.", "required_job_experience": "None specified.", "equal_employment_opportunity": "Equal opportunity employer and considers applicants for all positions without regard to race, color, religion, creed, gender, national origin, age, disability, marital or veteran status, sexual orientation, or any other legally protected status.", "salary": null, "benefits": null, "location": "San Francisco and Los Angeles, California.", "type_of_employment": "Summer law clerkship.", "url": "https://climatebase.org/job/46569513/2024-california-regional-office-clerkship?source=jobs_directory"}]