[{"job_title": "Mid/Senior Product Designer", "company_mission": "Developing a platform to help electricity consumers, producers and suppliers move towards 24/7 clean energy.", "company_values": null, "company_products_or_services": "SaaS platform for trading clean energy", "job_responsibilities": "Design and refine the UI/UX of the Granular web platform; Contribute to the design system and maintain design consistency across features; Lead user research, testing, and validation of new designs; Contribute to ideation along with the founders and the rest of the technology and product team; Support with occasional brand work", "desired_software_skills": "Figma and its component and prototyping system", "education": null, "required_job_experience": "4+ years of designing user-centric products; Anything that is data-heavy or relating to energy is a big plus", "equal_employment_opportunity": "We are committed to diversity and developing talent. If you do not have all the skills listed above but think you have what we’re looking for, we’d still love to hear from you.", "salary": "France: €54k (Intermediate) or €63.4k (Senior); UK: £60k (Intermediate) or £77k (Senior); Germany: €60k (Intermediate) or €77k (Senior); Spain: €47.4k (Intermediate) or €55.6k (Senior); Salaries are calculated as the 65th percentile of market data provided by Figures, and depending on your seniority and location.", "benefits": "Min of 30 days holidays; Employee Share Options", "location": "Remote-first organization with quarterly meet-ups in Western Europe (typically around Paris); Not currently able to accept applicants based outside Western Europe.", "type_of_employment": null, "url": "https://climatebase.org/job/46109948/midsenior-product-designer?source=jobs_directory"}, {"job_title": "Policy and Engagement Manager - Carbon Markets (Washington, DC Metro Region)", "company_mission": "Incentivizing, quantifying, tracking and delivering credits for increased soil carbon, reduced greenhouse gas (GHG) emissions, enhanced water quality and water use conservation, and biodiversity outcomes within agricultural supply chains.", "company_values": null, "company_products_or_services": "Incentivizing, quantifying, tracking and delivering credits for increased soil carbon, reduced greenhouse gas (GHG) emissions, enhanced water quality and water use conservation, and biodiversity outcomes within agricultural supply chains.", "job_responsibilities": "Identifying public policy opportunities, obstacles, and barriers to a fully optimized ecosystem services market program and work to achieve beneficial outcomes for each; Creating and implementing a strategic policy plan to track national and federal level policy issues important to the success of ESMC/ESMRC; Developing ESMC/ESMRC position papers, white papers, case studies and relevant informational and educational materials to share as appropriate with policymakers, members, key constituencies and ESMC/ESMRC team; Engaging in relevant conferences, workshops and policy forums to present ESMC/ESMRC policy positions, analyses and findings to professional society and/or legislative audiences.", "desired_software_skills": null, "education": null, "required_job_experience": "At least 5 years professional experience in public policy role including relevant experience in the US Senate, US House of Representatives and/or US Department of Agriculture (USDA). Some knowledge/experience with US Environmental Protection Agency (USEPA) policies and programs impacting US agriculture is desirable.", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Washington, DC Metro Region", "type_of_employment": "Annual Contract Basis", "url": "https://climatebase.org/job/46162000/policy-and-engagement-manager---carbon-markets-washington-dc-metro-region?source=jobs_directory"}, {"Job_title": "Chief Scientist - Carbon and Soil Science", "Company_mission": "The Ecosystem Services Market Consortium (ESMC) is a member-driven consortium working with partners and collaborators across the agricultural supply chain and value chain. ESMC’s program serves as a collective enabling program to achieve quantified and verified scope 3 supply chain soil carbon removals and GHG reductions for corporates with agriculture in their supply chain. We also generate improved water quality, water use conservation, and biodiversity outcomes and claims for scope 3 reporting.", "Company_values": null, "Company_products_or_services": "ESMC’s technologically advanced, digitized end-to-end ecosystem services market program and MRV infrastructure rewards and incentivize farmers for beneficial impacts of sustainable agricultural systems, and sells outcomes to corporates with annual scope 3 accounting and reporting requirements to meet SBTi and Net Zero commitments.", "Job_responsibilities": "The Chief Scientist guides the strategic development and growth of ESMRC’s science, innovation and R&D programs, projects, partnerships, and fundraising. The incumbent will broker scientific partnerships, provide scientific leadership with and to our Network, and promote and support innovative approaches for the development and management of scientific information, including the advancement of tools that facilitate the use of this information in our ecosystem services market program and pilot projects in support of market program expansion and enhancements. The Chief Scientist will also provide strategic leadership for ESMRC Research directives, provide thought leadership and serve as a spokesperson to elevate the role ESMRC in key scientific organizations and relevant fora, evaluate relevant literature to inform research priorities, activities and RDD&D project design, coordinate RDD&D functions with other ESMC program elements, spearhead collaborations with external RDD&D efforts, provide technical support to ESMRC pilot projects, support the development of grant proposals for continued and future funding of ESMRC research and innovation projects, participate in grant planning, development, and submission, draft peer-reviewed publications and/or white papers showcasing ESMRC research project outcomes, support ESMC Communications Team in branding and publication of research reports and white papers, and represent ESMC at relevant scientific meetings and conferences.", "Desired_software_skills": null, "Education": "University degree and PhD (or equivalent diploma) in a relevant scientific discipline such as agronomy, soil science, animal science or environmental conservation", "Required_job_experience": "5+ years experience in a relevant field, including in a legislative or administrative role, experience in program development and leadership, priority setting, and the management of finances, people, and workloads of large programs with numerous contracts and deliverables, proven success in fundraising for scientific programs, particularly around agriculture conservation efforts, experience convening multidisciplinary and/or multi-sector organizations and representatives in support of solving common RDD&D and innovative challenges in the agricultural ecosystem services area (e.g. carbon and greenhouse gas quantification of agricultural activities and systems, water and/or biodiversity impacts of agricultural operations and systems, etc.)", "Equal_Employment_Opportunity": null, "Salary": null, "Benefits": null, "Location": "Remote", "Type_of_employment": "Annual Contract Basis", "URL": "https://climatebase.org/job/46159532/chief-scientist---carbon-and-soil-science?source=jobs_directory"}, {"job_title": "Payroll Accounting Specialist (part time)", "company_mission": "Wildlife Works is a community-centered conservation company that implements market-based initiatives to protect the planet’s threatened wilderness and endangered wildlife. The company was founded on the premise that if we want wildlife in our world, it must work for local communities who share their environment.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Prepare and process semi-monthly US multi-state payroll in ADP Workforce Now®; Record journal entries in the accounting system for each semi-monthly payroll cycle; Maintain payroll related tax account registrations with state and local tax jurisdictions; In conjunction with ADP, prepare and file accurate and timely payroll tax reporting to federal, state and local agencies; In conjunction with ADP, research and resolve all tax notices from federal, state and local agencies; Prepare annual forms W-2s and 1099s for US employees and contractors; Prepare and process annual employee bonus and profit sharing off-cycle payroll runs; Process semi-monthly employee 401K payroll contributions; Mantain and ensure accurate reporting of paid-time-off balances on pay stubs as well as fringe benefits; Work with HR to onboard new employees for payroll; Work with HR to ensure personnel updates (terminations, leaves of absence, etc.) are updated timely and accurately in all systems; Coordinate with and assist department managers with timesheets for hourly interns and contractors where needed; Assist where needed with the annual budget process by preparing estimates for all payroll related expenses, including cost of living adjustments by region and position; Research payroll regulations and best practices, taxes, and reporting requirements in new international jurisdictions where needed; Perform and assist with other tasks and duties as assigned", "desired_software_skills": "Experience in ADP Workforce Now® and Sage 300 is a plus; Proficient knowledge of Microsoft Word, Excel, and Outlook is required", "education": "Associates or bachelor’s degree in accounting, finance, or business and/or related payroll or tax certification preferred", "required_job_experience": "5+ years of payroll experience in a multi-state environment; 5+ years of payroll tax and fringe benefits experience required", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "US in North Carolina or Vermont", "type_of_employment": "Part-time", "url": "https://climatebase.org/job/46367060/payroll-accounting-specialist-part-time?source=jobs_directory"}, {"job_title": "GIS Analyst", "company_mission": "Wildlife Works is a community-centered conservation company that implements market-based initiatives to protect the planet’s threatened wilderness and endangered wildlife.", "company_values": "null", "company_products_or_services": "Wildlife Works' conservation projects drive direct financing to forest communities to fund their own economic development while preventing millions of tonnes of carbon dioxide emissions from entering the atmosphere annually.", "job_responsibilities": "Work with an international team of geospatial professionals to execute GIS and remote sensing tasks, including data acquisition, processing, analysis and reporting; Provide cartography, data management and geospatial support to the Carbon Development team and assist with project documentation; Produce cartographic, land use / land cover change analysis, risk mapping and baseline setting content to vital documentation throughout the project development lifecycle; Execute and troubleshoot GIS workflows and perform geoprocessing tasks; Research, acquire and organize shapefiles, features and other geographic information; Assist with forest carbon accounting, including determining project area boundaries, biomass inventory sample design, and development of biomass maps; Prepare and present reports and visualizations of land cover change and emission reduction data to internal and external stakeholders; Provide background information for our REDD+ projects, including baseline setting techniques, land/use land cover change methods and risk mapping.", "desired_software_skills": "ArcGIS Pro; Python or R; Microsoft Office; VBA for excel; Adobe products (Acrobat, Photoshop)", "education": "Bachelor's degree in physical geography, Remote Sensing, Geography, Environmental Science, or a related field. Master’s degree preferred.", "required_job_experience": "Applied experience in GIS or remote sensing; Strong experience with GIS software such as ArcGIS Pro, with programming skills in Python or R and experience with GIS workflows and geoprocessing; Knowledge of remote sensing processing techniques for forest carbon accounting, including the use of both optical and active data products.", "equal_employment_opportunity": "All applicants are considered for all positions without regard to race, religion, color, sex, gender, sexual orientation, pregnancy, age, national origin, ancestry, physical/mental disability, medical condition, military/veteran status, genetic information, marital status, ethnicity, alienage, or any other protected classification, in accordance with applicable federal, state, and local laws.", "salary": "null", "benefits": "Health Care Plan with Fertility Benefits; Dental and Vision; 401K with Company Match; Life Insurance (Basic, Voluntary, AD&D); Paid Time Off (Sick, Vacation, Holidays); Short Term & Long Term Disability", "location": "Burlington, Vermont USA", "type_of_employment": "null", "url": "https://climatebase.org/job/46367057/gis-analyst?source=jobs_directory"}, {"job_title": "Forest Science Analyst", "company_mission": "Wildlife Works is a community-centered conservation company that implements market-based initiatives to protect the planet’s threatened wilderness and endangered wildlife. The company was founded on the premise that if we want wildlife in our world, it must work for local communities who share their environment.", "company_values": null, "company_products_or_services": "Wildlife Works' conservation projects drive direct financing to forest communities to fund their own economic development while preventing millions of tonnes of carbon dioxide emissions from entering the atmosphere annually.", "job_responsibilities": "Provide forestry, forest ecology and carbon accounting support to the Carbon Development team. Main duties include forest data management, identification and assessment of tree allometry, forest inventories, and field protocol development. Assist with forest carbon accounting, including data management, model parameterization and forest biomass and carbon stock calculation. Use handheld GPS equipment for navigation and boundary establishment. Assist in forest biometric measurements (e.g. DBH, crown cover, tree height) for forest carbon inventories. Assist with training in biomass inventory data collection and field protocol adherence. Assist in drafting and/or editing field protocols, project documentation and other technical documents. Perform cartography, editing, geoprocessing, spatial data storage optimization and maximize efficiencies within the ArcGIS Pro environment. Execute and troubleshoot GIS workflows.  Literature research on natural history, cultural history and forest ecology. Identify relevant and high-quality data sources for use in projects and understand ecological context for Wildlife Works’ project locations. Provide background information for our REDD+ projects and contribute to project documents.", "desired_software_skills": "Microsoft Office (MS Excel and MS Word experience is required). Advanced spreadsheet management preferred. Experience with ArcGIS Pro is desired, including geoprocessing, raster analysis and cartography techniques. Modelbuilder and / or Python development experience is a plus. VBA knowledge for excel and familiarity with Adobe products (Acrobat, Photoshop).", "education": "Bachelor’s degree in forestry, forest ecology, environmental science or another similar natural science field. Master's degree preferred.", "required_job_experience": "At least 3 years of practical working experience working in REDD+, forest/wildlife conservation, forestry, or other natural science-based position. Knowledge and use of standard forestry equipment. Biomass / carbon modeling and accounting experience. Forest inventory and biometric analysis experience is a plus. Intermediate to advanced GIS analysis skills.", "equal_employment_opportunity": "All applicants are considered for all positions without regard to race, religion, color, sex, gender, sexual orientation, pregnancy, age, national origin, ancestry, physical/mental disability, medical condition, military/veteran status, genetic information, marital status, ethnicity, alienage, or any other protected classification, in accordance with applicable federal, state, and local laws.", "salary": null, "benefits": "Health Care Plan with Fertility Benefits; Dental and Vision; 401K with Company Match; Life Insurance (Basic, Voluntary, AD&D); Paid Time Off (Sick, Vacation, Holidays); Short Term & Long Term Disability", "location": "Burlington, Vermont, USA", "type_of_employment": null, "url": "https://climatebase.org/job/46367054/forest-science-analyst?source=jobs_directory"}, {"job_title": "Customer Success Manager - US", "company_mission": "Building the world's first open access AI-powered Climate Intelligence platform", "company_values": "Pro-diversity, highly inclusive organization, committed to bringing together people of all backgrounds and enabling them to succeed", "company_products_or_services": "Climate Intelligence platform; EarthScan product", "job_responsibilities": "Oversee and manage a large portfolio of clients in the Americas; Analyze customer data to improve customer experience; Sustain business growth & profitability by maximizing customer value; Build loyal customer relationships to ensure long-term client retention; Provide the business with customer feedback at regular intervals and communicate milestones and pain points to the wider business; Establish regular communication, goals, and KPIs with each of your customers to support their growth and output; Assist in creating training courses and educational materials for our customers; Seek to consistently and measurably improve the customer experience; Deliver EarthScan demos to customers; Own and be accountable for customer relationships throughout their lifecycle", "desired_software_skills": "Proficient with Google Suite and Excel; Familiarity with CRM tools (e.g. Hubspot), data manipulation tools (e.g. MySQL)", "education": "Environmental-focused degree (desired)", "required_job_experience": "2+ years experience in a Customer Success role", "equal_employment_opportunity": null, "salary": null, "benefits": "14 days per year paid for sick leave for physical and mental health needs; 22 days PTO a year + 3 days over the new year + plus local US public holidays; 401K match with 5% capped at $5K and 100% invested from day 1; The company closes between December 24th and January 1st, which typically gives an extra 3 days off each year; Remote first company culture with flexible working hours; Maternity, paternity, adoption or shared parental leave policies; Every employee is given a plant of their choice; $1000 a year learning budget towards personal and professional development; 10% of your time can be used for projects that help us meet Cervest’s mission outside your day-to-day responsibilities; $500 stipend to spend on your work from home setup (we’ll cover your laptop and peripherals such as a screen and keyboard - you will be able to choose between a Mac or PC); UnitedHealthCare Medical Cover & MetLife for Dental & Vision Packages; Virtual team and company activities such as pastry-making classes, mindfulness classes, coffee masterclasses and murder mysteries", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46366986/customer-success-manager---us?source=jobs_directory"}, {"job_title": "Data Science Analyst II", "company_mission": "Pivot Bio is pioneering game-changing advances in agriculture by harnessing the power of naturally occurring microbes to provide nutrients to crops and new sustainable ways for farmers to reduce the usage of fertilizers as they work to help feed the world’s growing population.", "company_values": null, "company_products_or_services": "Providing sustainable agricultural solutions using naturally occurring microbes.", "job_responsibilities": "Support decision makers within the R&D pipeline with statistical analyses, technical reports and data visualizations; Maintain and develop robust analytical pipelines to provide prompt and accurate insights to internal customers; Help advocate for data driven decision making within the organization and support experimental design via power analysis; Help develop and implement new analytical techniques with company data and help evaluate the utility of novel data sources for R&D; Work collaboratively as part of a diverse, geographically dispersed data science team to support internal communication of needs, project status and results.", "desired_software_skills": "Experience building statistical models in R or Python (preferably both); Proficiency with Bayesian analysis, hierarchical mixed modeling, and power analysis preferred.", "education": "Master's degree in statistics, mathematics, biostatistics, ecology, or related field or bachelor’s degree in statistics, mathematics, biostatistics, ecology, or related field with a minimum 2 years’ related experience.", "required_job_experience": null, "equal_employment_opportunity": "Equal opportunity employer", "salary": "Competitive package", "benefits": "Stock options; Health/Dental/Vision insurance with employer-paid premiums; Life, Short-Term and Long-Term Disability policies; Employee Assistance Program with free referrals and discounts; 401(k) plan, 3% Match; Commuter benefits; Annual Training & Development support; Flexible vacation policy with a generous holiday schedule.", "location": "Remote, US", "type_of_employment": null, "url": "https://climatebase.org/job/46366898/data-science-analyst-ii?source=jobs_directory"}, {"job_title": "Strategy and Corporate Development Associate", "company_mission": "Blue Whale Materials is an American recycling company working toward a greener and more sustainable global battery supply chain.", "company_values": null, "company_products_or_services": "Building a lithium-ion battery recycling facility, producing an ethically sourced stream of cobalt, nickel, manganese, and lithium in the first stage of a closed-loop solution for lithium-ion battery manufacturers.", "job_responsibilities": "Oversee and assist in business and corporate strategy planning and implementation; Conduct research and analysis to support corporate and business strategy; Implement organizational development and operational initiatives and projects as needed; Lead project management efforts on strategy and organizational development initiatives; Communicate strategy and organizational development objectives to all departments; Communicate with different departments on issues requiring coordination and alignment, especially between BWM’s corporate headquarter and plant facilities; Manage and assist leadership of ESG program and reporting including drafting and executing policies, managing life cycle analysis, reporting on ESG issues; Manage communications and presentations to investors; Drafting and developing presentations on strategy, ESG, organizational development programs, partnerships, corporate development opportunities, programs, and other areas as needed; Supporting CSO on projects as they arise; Assisting with government grant applications and research on government plans and initiatives", "desired_software_skills": "Strong knowledge of Microsoft Office products, including Outlook, Excel, Word, PowerPoint, and Project", "education": "Post-Secondary Diploma in Business Administration, or relevant discipline, required", "required_job_experience": "Minimum 5 years of direct or related work experience", "equal_employment_opportunity": null, "salary": "Compensation will be commensurate with experience.", "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46365428/strategy-and-corporate-development-associate?source=jobs_directory"}, {"job_title": "Administrative Coordinator", "company_mission": "Advance sustainable development goals through independent assessment, the application of sound science, and innovative solutions.", "company_values": null, "company_products_or_services": "Sustainability standards and third-party certification services", "job_responsibilities": "Complete database uploads and manage package data for clients; Create certificates and send them to clients; Support program coordinators in administrative tasks and reach out to clients as necessary; Manage client database and all records for food safety clients, including but not limited to applications, agreements, certificates, work orders, and invoices; Ensure program compliance with the SCS quality system; Ongoing maintenance of all new, existing, and archived program files in accordance with program requirements; Support the Client Services Manager to develop program guidance updates; Develop, translate, and edit program materials, reports, and templates; Create and send invoices for initial clients, renewal clients, and scope changes; Review all expense reports for Sustainability staff and Regional Auditors; Send work orders, invoices, certificates, and other items to clients; Track and manage client deadlines for program correspondence and certification issues; Ensure project milestones and deadlines are established and clearly understood by staff and contract auditors; Provide audit and/or inspection assignments to staff and contract auditors; Manage auditor/inspector schedules, workloads, and travel budgets; Carry out travel booking and logistical arrangements, as needed; Additional tasks as requested by the Client Services Manager and Director of Food Safety", "desired_software_skills": "Strong proficiency in Microsoft Office including Microsoft Word, Excel, and PowerPoint; Experience with Salesforce desired", "education": "Minimum of HS diploma, Associate’s or Bachelor’s degree preferred, or relevant experience", "required_job_experience": "Experience in data management; Experience with organization and customer service", "equal_employment_opportunity": "SCS Global Services provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, gender identity or expression, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws.", "salary": null, "benefits": null, "location": "CA Office, Emeryville or Remote, US (Home Office)", "type_of_employment": "Part-time", "url": "https://climatebase.org/job/46365221/administrative-coordinator?source=jobs_directory"}, {"job_title": "Part Time Lomi Sustainability Assistant", "company_mission": "Work to protect and restore the environment", "company_values": "Commit to a culture that builds a strong COMMUNITY; Foster CREATIVITY to inspire fresh innovation; Embrace COURAGE by taking action despite uncertainty; Live with Awareness and CONSCIOUSNESS of our choices", "company_products_or_services": "Lomi, a solution to the earth's waste problem", "job_responsibilities": "Help cultivate Lomi grown crops at our local community farm; Photograph before and after states of test grown crops; Capture data and upload information using GSuite/Excel; Work in a highly collaborative team of material scientists/chemists", "desired_software_skills": "GSuite/Excel", "education": "null", "required_job_experience": "Must hold a valid driver’s license", "equal_employment_opportunity": "Welcomes diversity and unique contributions in terms of education, culture, ethnicity, race, sex, gender identity and expression, age, religion, and sexual orientation", "salary": "$20/hour CAD", "benefits": "null", "location": "Kelowna", "type_of_employment": "Part-time, in-person", "url": "https://climatebase.org/job/46364916/part-time-lomi-sustainability-assistant?source=jobs_directory"}, {"job_title": "Mechanical Engineer - Product Engineering", "company_mission": "to create an abundant and decarbonized material future", "company_values": "null", "company_products_or_services": "electrolytic hydrogen systems matched to renewable power sources to create green hydrogen by splitting water", "job_responsibilities": "Collaborate with stack engineering, power systems engineering, product management teams, and outside contractors; Develop next-generation modular mechanical designs that integrate structural, piping, control and electrical systems; Create P&IDs, PFDs, and Isometric Drawings; Review and approve Pipe Weld Specifications and Welder Qualification (WPS, WPQR); Develop models to analyze stress, fluid, and thermal performance and inform design; Create test plans for electrolysis fluid systems and component validation; Perform fluid system and process equipment sizing calculations; Create system specifications, and select off the shelf components; Release products to manufacturing, supporting volume scale up; 15% travel to contractor, vendor, and customer sites mostly domestic", "desired_software_skills": "2D/3D CAD piping design, combined with stress, thermal, fluids analysis (e.g. CAESAR II)", "education": "B.S. or M.S. in Mechanical Engineering, Chemical Engineering or similar", "required_job_experience": "5+ years mechanical engineering/design (multidisciplinary skills preferred)", "equal_employment_opportunity": "Electric Hydrogen is proud to be an equal opportunity employer", "salary": "$119,000—$159,000 USD", "benefits": "equity grant; time off programs; a $75/month cell phone allowance; a 4% employer 401(k) match; 100% fully paid premiums for employees and their families: medical, dental, vision, life insurance, short-term & long-term disability coverage; a discretionary bonus", "location": "San Carlos, CA", "type_of_employment": "null", "url": "https://climatebase.org/job/46364881/mechanical-engineer---product-engineering-?source=jobs_directory"}, {"job_title": "Senior Energy Analyst", "company_mission": "Transforming the electric grid to renewables through energy analytics", "company_values": null, "company_products_or_services": "Energy analytics software and consulting services", "job_responsibilities": "Lead quantitative analysis for battery and renewable project development & operation; Provide clients with expertise in analytic modeling for asset valuation, risk management, and renewable integration; Devise new approaches to represent results that provide support for decision analysis; Assimilate complex information into readily understood reports and presentations; Perform in-depth analysis of power market operations; Solve complex analytic problems to make mission critical decisions for energy supply; Serve as a technical resource for scoping, building, deploying, and launch activities", "desired_software_skills": "Proficiency with analytic software programming (R, Python or other languages)", "education": "Master’s or PhD; advanced degrees in economics, engineering, and energy preferred", "required_job_experience": "2+ years Energy industry experience; Understanding of energy modeling system and methods; Demonstrated track record of working with clients and team", "equal_employment_opportunity": "Ascend Analytics is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics. Ascend Analytics is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.", "salary": "$95,000-$140,000 Negotiable based on qualifications and experience. Ascend highly values our employees and often pays above industry average.", "benefits": "Medical, dental, vision, short- and long-term disability, parental leave, dependent care spending account, and a 401k plan.", "location": "Boulder, CO", "type_of_employment": null, "url": "https://climatebase.org/job/46364782/senior-energy-analyst?source=jobs_directory"}, {"job_title": "Senior Energy Analyst", "company_mission": "To bring advanced energy analytics to support real-world decisions in resource planning, renewable generation, energy storage, and energy risk management to electric utilities, community choice aggregators, Fortune 500 corporations, and other energy industry clients.", "company_values": "Innovation; Climate tech; Energy analytics; Transforming the electric grid; Diversity and Inclusion; Equal Employment Opportunity", "company_products_or_services": "Energy analytics software and consulting services", "job_responsibilities": "Learn how Ascend’s resource planning tool PowerSimm is used to advance the analytical foundation of resource planning and valuation activities; Manage project teams and lead client engagements; Work with a nation-wide utility client base to develop integrated resource plans, run and valuate requests for offer/proposals, analyze the economics of legacy power plants, and plan for their replacement with cleaner energy sources, etc.; Work collaboratively with a top-level team with similar passion for the energy field; Advance data visualization techniques to represent results that provide support for decision analysis; Support power market analysis, including long-term fundamental market forecasting efforts; Assimilate complex information into readily understood reports and presentations", "desired_software_skills": "Energy modeling system and methods; Knowledge of software and programming", "education": "Master’s or PhD: advanced degree(s) in economics, engineering, or business (MBA), with energy focus preferred", "required_job_experience": "2+ years of energy industry experience, including knowledge of wholesale energy markets, power supply and demand side resource technologies, and resource planning in vertically integrated and deregulated power markets; Experience successfully prioritizing, managing and delivering projects in a consulting capacity; Understanding of energy modeling system and methods", "equal_employment_opportunity": "Ascend Analytics is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics.", "salary": "$95,000 - $140,000 (Negotiable based on qualifications and experience)", "benefits": "Medical; Dental; Vision; Short- and long-term disability; Parental leave; Dependent care spending account; 401k plan", "location": "Boulder, CO or Remote within U.S.", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46364781/senior-energy-analyst?source=jobs_directory"}, {"job_title": "Product Manager", "company_mission": "Ascend Analytics is an innovative “climate tech” software and consulting company focused on energy analytics that are transforming the electric grid.", "company_values": null, "company_products_or_services": "PowerSIMM product", "job_responsibilities": "Consult with the VP of Operations and Strategy, commercial staff, and client facing staff on overall product strategy for PowerSIMM; Perform market research on product competitive position and capabilities; Generate and/or champion new product ideas for implementation; Oversee product design within the framework of PowerSIMM’s recent UI/UX refresh; Coordinate and project manage product related activity across teams to implement strategy; Cultivate relationships with partners, data sources, clients, other Ascend teams; Streamline product implementation and launch for new users; Train new staff and clients; Improve and maintain all documentation: help pages, user manuals, level 1 documentation; Find ways to improve UX, with a laser focus on making the product as 'self-serve' as possible; Identify, propose, collaborate, scope and plan product enhancements and ‘wizards’ to streamline user workflows; Be product-led in organizational posture; Interact with colleagues in a collaborative and ‘one-team’ mindset; Develop, maintain and communicate the ongoing product roadmap; Spend the first few months gaining a deep understanding of a product from a user perspective", "desired_software_skills": "Salesforce; Monday.com; Agile product development", "education": "Bachelor’s Degree", "required_job_experience": "2+ years experience with ownership over a software product with deep knowledge of their features and build frameworks, with professional experience in a relevant field (either product or energy)", "equal_employment_opportunity": "Ascend Analytics is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics. Ascend Analytics is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.", "salary": "$120,000 - $160,000; Negotiable based on qualifications and experience. Ascend highly values our employees and often pays above industry average.", "benefits": "Medical; Dental; Vision; Short- and long-term disability; Parental leave; Dependent care spending account; 401k plan", "location": "Boulder, CO; Remote within the U.S. for well experienced candidates", "type_of_employment": null, "url": "https://climatebase.org/job/46364780/product-manager?source=jobs_directory"}, {"job_title": "Product Manager", "company_mission": "Ascend Analytics is an innovative “climate tech” software and consulting company focused on energy analytics that are transforming the electric grid.", "company_values": null, "company_products_or_services": "Ascend's solutions provide the analytics to support critical power supply decisions from operating strategies, for short and long-term investment and resource planning decisions.", "job_responsibilities": "Collaborate with internal and external stakeholders to maintain the product roadmap and backlog for one of Ascend’s Battery products (BatterySimm, SmartBidder, Market Intelligence); Define requirements and design solutions for new features with analysts and UI designers; Integrate with the engineering team to support product development and feature delivery; Conduct backlog grooming and prioritization with existing product management team; Take ownership of complex projects and be able to perform independent communications and research.", "desired_software_skills": "Expertise in product management; Experience with agile product development and associated tools.", "education": "Bachelor’s Degree in Computer Science, Engineering, Business, or a related field.", "required_job_experience": "4+ years of professional experience in a relevant field (either product or energy).", "equal_employment_opportunity": "Ascend Analytics is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics.", "salary": "$120,000 - $160,000; Negotiable based on qualifications and experience. Ascend highly values our employees and often pays above industry average.", "benefits": "Medical, dental, vision, short- and long-term disability, parental leave, dependent care spending account, and a 401k plan.", "location": "Boulder, CO", "type_of_employment": null, "url": "https://climatebase.org/job/46364779/product-manager?source=jobs_directory"}, {"job_title": "Principal Product Manager", "company_mission": "Ascend Analytics is an innovative “climate tech” software and consulting company focused on energy analytics that are transforming the electric grid.", "company_values": null, "company_products_or_services": "Ascend's solutions provide the analytics to support critical power supply decisions from operating strategies, for short and long-term investment and resource planning decisions.", "job_responsibilities": "Provide thought leadership on product management; Collaborate with internal and external stakeholders to maintain the product roadmap and backlog for one of Ascend’s Battery products (BatterySimm, SmartBidder, Market Intelligence); Define requirements and design solutions for new features with analysts and UI designers; Integrate with the engineering team to support product development and feature delivery; Conduct backlog grooming and prioritization with existing product management team; Take ownership of complex projects and be able to perform independent communications and research", "desired_software_skills": "Experience with agile product development and associated tools", "education": "Bachelor’s Degree in Computer Science, Engineering, Business, or a related field.", "required_job_experience": "6+ years of professional experience in a relevant field (either product or energy); Expertise in product management – 2+ years; Possess strong organizational and time management skills, with attention to detail; Experience managing complex projects and delivering results to customers", "equal_employment_opportunity": "Ascend Analytics is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics. Ascend Analytics is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.", "salary": "$150,000 - $200,000; Negotiable based on qualifications and experience. Ascend highly values our employees and often pays above industry average.", "benefits": "Medical, dental, vision, short- and long-term disability, parental leave, dependent care spending account, and a 401k plan.", "location": "Boulder, CO", "type_of_employment": null, "url": "https://climatebase.org/job/46364778/principal-product-manager?source=jobs_directory"}, {"job_title": "Marketing and Business Operations Lead", "company_mission": "To provide innovative climate tech solutions for energy analytics that transform the electric grid.", "company_values": null, "company_products_or_services": "Energy analytics software and consulting services.", "job_responsibilities": "Lead marketing projects to enhance the company's brand; Identify and implement solutions for high-priority business needs; Implement best practices and procedures; Work collaboratively across all functions; Provide ongoing guidance and support for leadership, teams and special projects.", "desired_software_skills": null, "education": "Bachelor's degree in liberal arts, communications, marketing, business administration or related field.", "required_job_experience": "3-5 years of experience in corporate communications, marketing operations, business operations or related field.", "equal_employment_opportunity": "Ascend Analytics is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics.", "salary": "Lead: $70,000 - $110,000; Negotiable based on qualifications and experience. Ascend highly values our employees and often pays above industry average.", "benefits": "Medical, dental, vision, short- and long-term disability, parental leave, dependent care spending account, and a 401k plan.", "location": "Boulder, CO", "type_of_employment": null, "url": "https://climatebase.org/job/46364777/marketing-and-business-operations-lead?source=jobs_directory"}, {"job_title": "Lead Energy Analytics Developer - Optimization", "company_mission": "Transforming the electric grid to renewables through energy analytics", "company_values": null, "company_products_or_services": "Energy analytics software and consulting services", "job_responsibilities": "Provide thought leadership and technical mentorship of optimization developers; Translate requirements into model formulation; Implement forecasting and optimization models for operation and valuation of renewable resources and battery storage; Develop both prototype models and production software; Support existing commercial software and production systems", "desired_software_skills": "Optimization methods and commercial solvers (e.g., GAMS, Goroubi, CPLEX, Xpress); Familiarity with relational database platforms (Oracle, MS SQL, Postgres); Python and relevant libraries (e.g., NumPy, Pandas, SciPy)", "education": "Masters in Electrical Engineering, Computer Science, Operations Research, Economics, Power Systems, or related disciplines", "required_job_experience": "3+ years experience in an energy optimization focused role in industry or academic partnerships with industry", "equal_employment_opportunity": "Equal Employment Opportunity employer; Does not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics; Committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in job application procedures", "salary": "($150,000 - $190,000) Negotiable based on qualifications and experience; Often pays above industry average", "benefits": "Medical, dental, vision, short- and long-term disability, parental leave, dependent care spending account, and a 401k plan", "location": "Boulder, CO, or Remote within U.S.", "type_of_employment": null, "url": "https://climatebase.org/job/46364776/lead-energy-analytics-developer---optimization?source=jobs_directory"}, {"job_title": "Energy Storage & Renewables Trading Analyst", "company_mission": "To transform the electric grid to renewables through energy analytics.", "company_values": "Passion for renewables, climate issues, and the clean energy transition.", "company_products_or_services": "Energy analytics software and consulting services.", "job_responsibilities": "Perform quantitative analysis for battery, renewable, and hybrid project development & operations; Devise new approaches to represent results; Assimilate complex information into readily understood reports and presentations; Perform in-depth analysis of power market operations; Provide clients with expertise in the areas of analytic modeling for asset revenue optimization, risk management, and bidding strategy formation; Serve as a technical resource for scoping, building, deploying and launch activities; Provide clients with on-site and web-based software training.", "desired_software_skills": "Python or other software tools.", "education": "Bachelor’s degree in economics, engineering, or other highly quantitative discipline required; advanced degree (master’s or PhD) preferred.", "required_job_experience": "Prefer energy industry experience, including knowledge of deregulated power market operations nationally and/or internationally; Project management experience.", "equal_employment_opportunity": "Proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics. Ascend Analytics is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.", "salary": "$75,000 – $115,000", "benefits": "Flexible work hours; Opportunities for advancement; Medical, dental, vision; Short- and long-term disability; Parental leave; Dependent care spending account; 401k plan.", "location": "Boulder, CO", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46364775/energy-storage--renewables-trading-analyst?source=jobs_directory"}, {"job_title": "Energy Analytics Developer - Optimization", "company_mission": "Ascend Analytics is an innovative “climate tech” software and consulting company focused on energy analytics that are transforming the electric grid to renewables.", "company_values": null, "company_products_or_services": "Energy analytics software solutions and consulting services", "job_responsibilities": "Developing software solutions and analytics to support the clean-tech power revolution; Solving complex analytic problems to make mission-critical decisions for energy supply by translating requirements into model formulation, implementing forecasting and optimization models for operation and valuation of renewable resources and battery storage, developing both prototype models and production software, and supporting existing commercial software and production systems; Utilizing optimization techniques including computational stochastic optimization, decision making under uncertainty, statistical learning, algorithms in statistics and finance applications, stochastic search, simulating high penetrations of wind and solar energy, optimizing generation under uncertainty, unit dispatch and transmission modeling, modeling of hydroelectric storage systems, and planning and control of electric battery storage.", "desired_software_skills": "Optimization methods and commercial solvers (e.g., GAMS, Goroubi, CPLEX, Xpress); familiarity with relational database platforms (Oracle, MS SQL, Postgres); Python and relevant libraries (e.g., NumPy, Pandas, SciPy)", "education": "Masters in Electrical Engineering, Computer Science, Operations Research, Economics, Power Systems, or related disciplines", "required_job_experience": "1+ year experience in an energy optimization focused role in industry or academics", "equal_employment_opportunity": "Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information or other applicable legally protected characteristics. Ascend Analytics is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures.", "salary": "$100,000 - $150,000", "benefits": "Medical, dental, vision, short- and long-term disability, parental leave, dependent care spending account, and a 401k plan", "location": "Boulder, CO or Remote within the U.S.", "type_of_employment": null, "url": "https://climatebase.org/job/46364773/energy-analytics-developer---optimization?source=jobs_directory"}, {"job_title": "Warehouse and Shipping Clerk", "company_mission": "To reduce carbon emissions from buildings by 1 gigaton each year", "company_values": null, "company_products_or_services": "Climate technology used to make buildings more energy efficient", "job_responsibilities": "Prepare and process customer orders for shipment, coordinate with carriers, manage inventory, ensure compliance with policies and regulations, communicate with customers and internal departments, maintain a safe and clean work environment", "desired_software_skills": "Proficiency in shipping software, including UPS WorldShip, FedEx Ship Manager, and USPS Click-N-Ship", "education": "High school diploma or equivalent", "required_job_experience": "Minimum of 1 year of experience in shipping and receiving, preferably in a manufacturing warehouse environment", "equal_employment_opportunity": "Aeroseal provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.", "salary": null, "benefits": null, "location": "Miamisburg, Ohio", "type_of_employment": "On-site", "url": "https://climatebase.org/job/46364552/warehouse-and-shipping-clerk?source=jobs_directory"}, {"job_title": "Policy Principal", "company_mission": "Advanced Energy United (formerly known as Advanced Energy Economy) educates, engages, and advocates for policies that allow our member companies to compete to repower our economy with 100% clean energy.", "company_values": "Diversity, equity, inclusion, and justice", "company_products_or_services": "Clean, efficient, and reliable energy and transportation solutions", "job_responsibilities": "Contribute to Advanced Energy United project teams in executing priority projects to accelerate achievement of 100% clean energy and electrified transportation; Develop and maintain excellent working relationships with key regulatory, legislative and administrative staff, as well as Advanced Energy United staff, members, and partners; Create presentations, fact sheets, and other written and visual materials, and deliver verbal presentations and facilitate forums as requested; Collaborate with Advanced Energy United’s HR team on recruitment, training and coaching.", "desired_software_skills": null, "education": "Bachelor’s degree or equivalent experience.", "required_job_experience": "Minimum of four years of professional experience in the energy policy sector; a network of relevant contacts in the energy sector is a plus; recruitment experience a plus; coaching experience a plus.", "equal_employment_opportunity": "Advanced Energy United is an equal opportunity employer and does not discriminate in hiring or employment on the basis of race, color, religion, national origin, citizenship status, age, disability, sex, veteran status or any other characteristic protected by applicable federal, state or local laws, regulations or ordinances.", "salary": "starting at $75,000", "benefits": "Medical, dental, and vision insurance for employees and their families; Medical premiums covered for employees at 100%; Flexible spending plans for health care and dependent care; Profit Sharing opportunities, and annual merit-based compensation increases; $50/month personal wellness reimbursement; $50/month phone stipend; Accrued Paid Time Off, 11 Federal Holidays, and an annual end-of-year closure; Parental Leave; Tuition Reimbursement, and professional development reimbursement; 401(k) plan (with matching incentives); WMATA Transit Smart Benefits (DMV employees)", "location": "Remote", "type_of_employment": "Full-time, regular (residence in the U.S. required)", "URL": "https://climatebase.org/job/46364528/policy-principal?source=jobs_directory"}, {"job_title": "Senior Program Manager", "company_mission": "To create a future of solar energy for all.", "company_values": "Diversity and inclusivity.", "company_products_or_services": "Solar energy software.", "job_responsibilities": "Supervising the planning, implementation, and tracking of multiple projects across various programs and departments within the organization; developing and maintaining project plans, timelines, and schedules, including resource allocation, risk management, and change management plans; facilitating project meetings and providing regular updates to stakeholders on project status, risks, and issues; working with cross-functional teams to define project scope, objectives, and deliverables; identifying and managing project risks, including developing mitigation strategies to address project risks; collaborating with stakeholders to ensure that projects align with business goals and objectives; providing guidance and mentorship to project team members, including project coordinators and project administrators.", "desired_software_skills": "null", "education": "null", "required_job_experience": "5+ years of project management experience, preferably in a PMO environment; project management certification such as PMP, PRINCE2, or equivalent is preferred.", "equal_employment_opportunity": "We are an equal opportunity employer, we welcome and consider qualified applicants regardless of gender identity, sexual orientation, race, religion, age, national origin, citizenship, pregnancy status, veteran status, or any other differences.", "salary": "Tier 1 San Francisco, New York City: $126,000.00 - $170,000.00; Tier 2 Seattle, Los Angeles, Washington DC: $118,500.00 - $160,500.00; Tier 3 All Other US Locations, including Colorado: $111,500.00 - $150,500.00; this role is eligible for additional variable compensation and an equity grant, which will be discussed in your initial recruiter conversation.", "benefits": "null", "location": "null", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46364357/senior-program-manager?source=jobs_directory"}, {"job_title": "Staff Mechanical Engineer", "company_mission": "Develop and commercialize pioneering energy storage technologies to enable the electric grid to run on 100% renewable energy, every day of the year.", "company_values": "Humanity, excellence, and creativity", "company_products_or_services": "Energy storage technologies", "job_responsibilities": "Lead the design of several critical cell components; Develop functional requirements in close collaboration with members of Form’s product and technology development teams; Perform hands-on prototyping of your designs; Work with manufacturing engineers and technical operations to transition designs from the prototype stage to high volume internal production; Collaborate with testing teams to define and execute validation test plans; Support the analysis of test data to enable data-based decision making", "desired_software_skills": "Expert in computer aided design (CAD)", "education": "Bachelor’s degree in Mechanical Engineering or similar field", "required_job_experience": "7+ years of industry experience in mechanical design", "equal_employment_opportunity": "Form Energy is proud to be an equal opportunity employer.", "salary": "null", "benefits": "Equitable compensation; Stock options; Medical, dental, and vision insurance for full-time employees; Flexible Paid Time Off program; 12 weeks of paid parental bonding leave for every employee, regardless of gender identity or expression", "location": "Somerville, United States", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46364159/staff-mechanical-engineer?source=jobs_directory"}, {"job_title": "Senior Staff Power Systems Electrical Engineer", "company_mission": "To enable the electric grid to run on 100% renewable energy every day of the year", "company_values": "Humanity, excellence, and creativity", "company_products_or_services": "Energy storage technologies", "job_responsibilities": "Develop and integrate power systems used to transfer energy between Form’s batteries and the grid; guide the selection, commissioning, and operation of electrical equipment used for testing and validation of our power electronics solutions; collaborate with suppliers to specify and select best-in-class power converter solutions; model and design DC power collection circuitry and components; develop and execute test plans to support engineering design and prototyping activities; execute performance testing and analysis of power collection and conversion components; identify, diagnose, and solve performance issues and problems that are unique to Form’s power collection topology; develop the technology roadmap and strategy for power conversion design and integration", "desired_software_skills": "Python, LABVIEW", "education": "BSc or greater in electronics or electrical engineering", "required_job_experience": "8+ years experience working with power systems in a product development environment - direct experience in energy storage is a plus", "equal_employment_opportunity": "Form Energy is proud to be an equal opportunity employer", "salary": "$189,165-$233,345", "benefits": "Equitable compensation, stock options, 100% employee premiums and 80% of dependent premiums for medical, dental, and vision insurance for full-time employees, flexible Paid Time Off program, 12 weeks of paid parental bonding leave", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46364145/senior-staff-power-systems-electrical-engineer?source=jobs_directory"}, {"job_title": "Manager, Manufacturing Finance", "company_mission": "Developing and commercializing pioneering energy storage technologies to enable the electric grid to run on 100% renewable energy, every day of the year.", "company_values": "Humanity, excellence, and creativity", "company_products_or_services": "Energy storage technologies", "job_responsibilities": "Develop high-fidelity equipment capex budgets; Partner with Manufacturing Operations & Advanced Manufacturing teams to project detailed labor & overhead cost-down pathways; Perform in-depth analysis and provide insights on manufacturing capex and labor & overhead costs; Identify & track against key KPIs to measure financial and operational performance of each manufacturing line & process.", "desired_software_skills": "Expert-level Excel skills, and preferably experience with Oracle.", "education": null, "required_job_experience": "7-10 years of experience in finance, 5+ years in scaled industrial manufacturing, preferably with some experience with R&D-scale production as well.", "equal_employment_opportunity": "Form Energy is proud to be an equal opportunity employer.", "salary": null, "benefits": "Equitable compensation, stock options, 100% coverage of employee premiums and 80% of dependent premiums for medical, dental, and vision insurance for full time employees, flexible Paid Time Off program, 12 weeks of paid parental bonding leave.", "location": "Eighty Four, PA location (Greater Pittsburgh Area)", "type_of_employment": null, "url": "https://climatebase.org/job/46364104/manager-manufacturing-finance?source=jobs_directory"}, {"job_title": "Engineering Leader, Civil, Structural, and Architecture", "company_mission": "Developing and commercializing pioneering energy storage technologies to enable the electric grid to run on 100% renewable energy, every day of the year", "company_values": "Humanity, excellence, and creativity", "company_products_or_services": "Energy storage technologies", "job_responsibilities": "Grow and lead the Building Systems factory engineering team responsible for conceptualizing, engineering and executing on the Civil Structural Architecture infrastructure for the battery factory and beyond; Build and ramp the battery manufacturing factories infrastructure; Engineer of Record (EOR) for some projects (if licensed); Manage permitting relationships, strategy and deliverables with our Jurisdictions; Build effective relationships to ensure alignment with other leaders and company goals", "desired_software_skills": "REVIT or AutoCAD", "education": "Bachelor’s degree in Civil, Structural Engineering or Architect or equivalent", "required_job_experience": "10+ years of experience in CSA infrastructure engineering, delivering on large industrial and manufacturing projects; 5+ years leading engineering teams", "equal_employment_opportunity": "Form Energy is proud to be an equal opportunity employer", "salary": "null", "benefits": "Equitable compensation, stock options, medical, dental, and vision insurance for full time employees, flexible Paid Time Off program, and 12 weeks of paid parental bonding leave for every employee, regardless of gender identity or expression", "location": "Greater Pittsburgh Area", "type_of_employment": "Full-time", "URL": "https://climatebase.org/job/46364091/engineering-leader-civil-structural-and-architecture?source=jobs_directory"}, {"Job_title": "Product Operations Manager - Agile Delivery & Coaching (12 months FTC)", "Company_mission": "To power a world where net-zero is within everyone’s reach, by building the platform that will accelerate a sustainable, affordable and resilient energy transition.", "Company_values": "null", "Company_products_or_services": "Real-time cloud platforms that transform supplier operations and enable suppliers' customers to drive decarbonisation with smart, low carbon technologies.", "Job_responsibilities": "Helping to deliver product to clients by improving how we do product at Kaluza. Focused on improving how value flows across the organisation and ways of working that help increase value and engagement from the people in Kaluza, and with our clients and customers. Helping teams optimise for a fast flow of value and continuously improve their ways of working. Identifying suitable patterns/approaches to apply to reduce friction from dependencies. Helping to create a safe and inclusive work environment where people’s voices can be heard.", "Desired_software_skills": "null", "Education": "null", "Required_job_experience": "Experience of overcoming challenges with a company that is scaling fast. Experience working and solving ‘team of team’ & organisation level problems.", "Equal_employment_opportunity": "We recognise talent on the basis of merit and potential. We want to build teams which represent a variety of experiences, perspectives and skills.", "Salary": "£55,000 - £80,000", "Benefits": "On top of a great pension scheme, you can spend an extra flex pot across a range of benefits that are most important to you - from charity donations, to tech loans, to taking it as cash - there's a wide range of options! There's also our annual discretionary bonus scheme. Private Medical Insurance and Life Assurance. 26 days holiday, including a day off for your birthday you can take at any point. Flexible bank holidays, giving you an additional 8 days which you can choose to take whenever you like. Progressive leave policies with no qualifying service periods, including 26 weeks full pay if you have a new addition to your family. A dedicated personal learning budget. Flexible working.", "Location": "London, Bristol, Edinburgh (including Hybrid)", "Type_of_employment": "12 months FTC", "URL": "https://climatebase.org/job/46364058/product-operations-manager---agile-delivery--coaching-12-months-ftc?source=jobs_directory"}, {"job_title": "Product manager, footprint platform", "company_mission": "Watershed is a software platform for running a world-class climate program. We measure our success in the carbon reduction achievements of our customers.", "company_values": null, "company_products_or_services": "Software platform for running a world-class climate program", "job_responsibilities": "Unite all aspects of the product and offering under a single, cohesive vision and execution plan; work with users, Engineering, Design, Climate Science, Operations, Customer Success, and more to decide the what and why behind the products and drive progress; help shape the future of this for customers and the industry, partner with engineering and design teams to build that future, and partner with customer-facing teams to successfully roll it out to customers; set up and drive stellar execution across product, operations, and go-to-market teams", "desired_software_skills": "Experience with data products that drive insight: background in statistics, complex data analysis, and/or data visualization", "education": null, "required_job_experience": "5-8 years of product management experience", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "San Francisco, New York, London, and remote team members across the US and Europe", "type_of_employment": null, "url": "https://climatebase.org/job/46363997/product-manager-footprint-platform?source=jobs_directory"}, {"job_title": "People Operations Generalist", "company_mission": "Transforming the way companies price, analyze, and reduce carbon emissions around the world", "company_values": "Passionate about technology and the environment; Diversity of ideas and talent", "company_products_or_services": "Enabling companies to meet their carbon reduction targets in the most efficient way possible", "job_responsibilities": "Drive and iterate on our onboarding process; Consult managers and employees on HR policies and programs; Own all employment changes and records within our HRIS; Manage and administer benefits plans; Ensure compliance with employment laws and regulations; Participate in the creation, documentation, and process improvement with a focus on automation", "desired_software_skills": null, "education": "Undergraduate degree required; HR certifications preferred", "required_job_experience": "2+ years experience in a People Ops role at a high growth organization; Previous experience establishing People Ops processes, administering benefits, and running payroll", "equal_employment_opportunity": "SINAI Technologies provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age or disability.", "salary": null, "benefits": "Remote-first culture; Annual Company Retreat; Equity; Healthcare reimbursement plan; Flexible PTO policy; Annual reimbursement for mental and physical wellness expenses; Home office reimbursement", "location": "San Francisco-based technology startup", "type_of_employment": null, "url": "https://climatebase.org/job/46363973/people-operations-generalist?source=jobs_directory"}, {"job_title": "Join the Cove.tool Talent Pool", "company_mission": "Help design teams rapidly decarbonate the building design process by automating energy, daylight, glare, cost, and more with machine learning.", "company_values": null, "company_products_or_services": "Web-based SaaS toolset for building design", "job_responsibilities": "Not specified", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "Cove.tool is proud to recruit and hire talented people from a wide variety of backgrounds and experiences. We do not discriminate on the basis of race, color, national origin, gender, religion, sex (including pregnancy, sexual orientation, gender identity or transgender status), age, or disability.", "salary": "Not specified", "benefits": "100% employer-paid health insurance; vision and dental benefits; employer-paid public transit pass and biking stipend; competitive pay; work-life balance; onsite gym membership; hybrid work; paid time off and holidays; snacks, beer, team events", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46363883/join-the-covetool-talent-pool?source=jobs_directory"}, {"job_title": "Director, Talent Acquisition", "company_mission": "NRDC is a non-profit environmental advocacy organization. We use law, science, and the support of 3.1 million members and online activists to protect the planet's wildlife and wild places and to ensure the rights of all people to clean air, clean water, and healthy communities.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Lead and manage all aspects of NRDC’s recruiting and hiring; Evaluate, implement, and improve organization-wide recruitment and hiring policies and practices; Manage, train and mentor in-house recruiters; Oversee and manage all third-party relationships for talent acquisition; Plan and direct all executive searches; Build new talent pipelines and enhance university relations; Collaborate with NRDC’s Office of Diversity, Equity, and Inclusion to ensure that NRDC’s recruitment and selection guidelines and practices are inclusive; Leverage deep subject-matter expertise of applicant tracking systems to improve related business processes, reporting, and integration with other systems and functions; Advise and support senior management on recruitment and hiring initiatives; Identify and build partnerships with universities to create diverse pipelines of talent for NRDC internships, fellowships, and other roles; Measure and improve talent acquisition objectives such as reducing time-to-fill, increasing quality of hires, and improving satisfaction levels among hiring managers; Maintain current knowledge of recruitment and hiring issues, trends, and technologies, and ensure compliance with labor laws relevant to recruitment and hiring", "desired_software_skills": null, "education": "Bachelor’s degree in related field, or equivalent combination of education and work experience", "required_job_experience": "Minimum 8 years of HR work experience with substantial experience in recruitment and hiring; Minimum 5 years of experience managing and developing direct reports; Experience managing external agencies to ensure high level of service and performance; Proven experience in improving talent acquisition strategies, policies, and procedures; Experience infusing robust diversity, equity, and inclusion practices into talent acquisition processes; Deep experience with, and knowledge of, applicant tracking systems and business processes; Experience creating and leveraging data and reporting to inform goals and support initiatives", "equal_employment_opportunity": "NRDC is committed to advancing diversity, equity, and inclusion, both in our work and in our workplace. We believe that celebrating and actively welcoming diverse voices and perspectives is essential to solving the planet's most pressing environmental problems, and we encourage applications from candidates whose identities have been historically under-represented in the environmental movement. We are an equal opportunity employer and do not discriminate in hiring or employment on the basis of race, color, religion, gender, gender identity or expression, marital status, sexual orientation, national origin, citizenship, age, disability, veteran status, or any other characteristic protected by federal, state, or local law. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.", "salary": "$144,000 to $165,000", "benefits": "We offer competitive salaries, excellent benefits, and a supportive working environment.", "location": "New York, DC, or Chicago", "type_of_employment": null, "url": "https://climatebase.org/job/46241372/director-talent-acquisition?source=jobs_directory"}, {"job_title": "Production Supervisor", "company_mission": "Pioneering game-changing advances in agriculture through the power of naturally occurring microbes to provide nutrients to crops and new sustainable ways for farmers to reduce the usage of fertilizers", "company_values": null, "company_products_or_services": "Products that harness the power of naturally occurring microbes to provide nutrients to crops", "job_responsibilities": "Oversee packaging and kitting personnel and operational equipment to ensure uncompromising quality, cleanliness, and efficiency in the company's packaging operations; accountable for meeting the production schedule and driving continuous improvements; identify and communicate workplace safety hazards; organize and communicate daily operational schedule effectively to staff and management; train employees on safety, quality, production, and machine operations based on Pivot Bio SOPs; collaborate with managers and supervisors to coordinate activities within the facility; enter production data into various tools and systems as required", "desired_software_skills": "Proficient with WMS, ERP, and other warehouse and operations systems; proficient in Microsoft Office including Excel and Word", "education": null, "required_job_experience": "Three years of operations supervisory experience; Production and packaging line experience preferred; Temp labor workforce experience required", "equal_employment_opportunity": "Must be authorized to work in the United States", "salary": "$63,200—$79,000 USD", "benefits": "Competitive package in a disruptive startup; stock options; health/dental/vision insurance with employer-paid premiums; life, short-term and long-term disability policies; employee assistance program with free referrals and discounts; 401(k) plan, 3% match; commuter benefits; annual training & development support; flexible vacation policy with a generous holiday schedule", "location": "Franklin Park, IL", "type_of_employment": null, "url": "https://climatebase.org/job/46164409/production-supervisor?source=jobs_directory"}, {"job_title": "Enterprise Account Executive - Retail", "company_mission": "To use farmland to cool the earth and reverse climate change through science and technology.", "company_values": "Commitment to sustainability and resilience in agriculture, innovation and disruption of the agriculture industry.", "company_products_or_services": "Customized, site-specific and scalable solutions to the agri-food industry through best-in-class agronomy, soil and carbon modeling, and innovative data collection.", "job_responsibilities": "Identify new sales opportunities, develop target account lists, develop sales and marketing programs, lead technical presentations and demos, close opportunities, build strong relationships with prospects, attend events and industry conferences, and serve as a 'voice of the customer' internally.", "desired_software_skills": "Familiarity with CRM system and other sales automation tools (Hubspot a plus).", "education": "No specific education requirement mentioned.", "required_job_experience": "5+ years of sales experience in an Enterprise level, land and expand sale, experience selling six-figure and above deals required, and experience with a complex sales environment that has a 90+ day sales cycle required.", "equal_employment_opportunity": "Diversity and inclusion for people from all walks of life is key to the company's success. Opportunities are available without regard to race, color, religion, sex, pregnancy (including childbirth, lactation and related medical conditions), national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information (including characteristics and testing), military and veteran status, and any other characteristic protected by applicable law.", "salary": "No salary information provided.", "benefits": "No benefits information provided.", "location": "No location information provided.", "type_of_employment": "Full-time.", "url": "https://climatebase.org/job/46078227/enterprise-account-executive---retail?source=jobs_directory"}, {"job_title": "Aircraft Development Technician", "company_mission": "ICEYE is building and operating its commercial constellation of small Synthetic Aperture Radar (SAR) satellites with SAR data available to customers. Our satellites acquire images of Earth at any time – even when it’s cloudy or dark – providing commercial and government partners with unmatched persistent monitoring capabilities. Information derived from our SAR images helps customers make data-driven decisions to address time-critical challenges in various sectors, such as maritime, disaster management, insurance, and finance.", "company_values": "We value teamwork and curiosity and know how to have fun! Diversity & inclusion are core values at ICEYE. We are passionate about building and sustaining inclusive and equitable working and learning environments for all staff.", "company_products_or_services": "ICEYE is building and operating its commercial constellation of small Synthetic Aperture Radar (SAR) satellites with SAR data available to customers. Our satellites acquire images of Earth at any time – even when it’s cloudy or dark – providing commercial and government partners with unmatched persistent monitoring capabilities. Information derived from our SAR images helps customers make data-driven decisions to address time-critical challenges in various sectors, such as maritime, disaster management, insurance, and finance.", "job_responsibilities": "Development of new processes, components and tools for an ultra-light UAV; Harness development, specification and manufacturing; Electrical board rework, inspection and verification; Avionic subsystem assembly and integration; Defining and executing test procedures; Design and assembly of electrical and mechanical test jigs to support R&D; Support flight testing.", "desired_software_skills": "Basic programming skills (C/Python); Basic knowledge of CAD tool.", "education": "null", "required_job_experience": "2+ years of relevant experience as an electrical/electromechanical/electronic technician with a hands-on approach; Experience working with electronic equipment (prototype boards, harness, test setups); Experience using electronic lab equipment.", "equal_employment_opportunity": "We believe every member on our team enriches our diversity by exposing us to a broad range of ways to understand and engage with the world, identify challenges, and discover, design, and deliver solutions.", "salary": "null", "benefits": "A job that matters in a dynamic New Space environment with a scale-up approach; An independent role with a supportive and diverse work environment; Occupational healthcare, occupational and private insurance; A yearly benefit budget to spend as you wish (i.e. on sport, transport, bike benefit, wellness, lunch, etc.); Phone subscription with iphone of choice; Relocation support (i.e. flight tickets, accommodation,relocation agency support); Time for self-development, research, training, conferences, or certification schemes; Finnish & English lessons; Inspiring and collaborating offices and silent workspaces enabling you to focus; A wide variety of best coffee, tea, snacks, and sweets to accompany your daily space mission.", "location": "Finland, Espoo", "type_of_employment": "Onsite", "url": "https://climatebase.org/job/46367133/aircraft-development-technician?source=jobs_directory"}, {"job_title": "Project Accountant (II or III)", "company_mission": "Energy Vault develops and deploys sustainable energy storage solutions designed to transform the world's approach to utility-scale energy storage in realizing decarbonization while maintaining grid resiliency.", "company_values": "null", "company_products_or_services": "Energy storage solutions utilizing gravity-based technology, battery storage technology, and energy storage management and integration platform.", "job_responsibilities": "Lifecycle project accounting; managing payables and receivables; providing financial reports and analysis; confirming estimates to complete projects; performing variance analysis; billing and cash flow forecasting; establishing and updating project budgets; spearheading cost reduction initiatives; subcontract management and coordination; providing commercial feedback.", "desired_software_skills": "Oracle NetSuite; Excel proficiency.", "education": "Bachelor's degree in Accounting, Business or equivalent required; CPA or MBA a plus.", "required_job_experience": "5+ years in Project Accounting working on lump sum projects preferably in renewable energy; or EPC (engineering, procurement, and construction).", "equal_employment_opportunity": "Energy Vault is committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants. They invite individuals of all genders, races, identities, ethnicities, sexual orientations, national origins, abilities, protected veteran status, religions, educational and socioeconomic backgrounds to explore employment with their organization.", "salary": "null", "benefits": "null", "location": "Westlake Village, CA; Houston, TX or REMOTE (USA) with a couple of trips each year", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46367112/project-accountant-ii-or-iii?source=jobs_directory"}, {"job_title": "Head of Customer Success", "company_mission": "To unlock capital for renewable infrastructure.", "company_values": "Learning, curiosity, and collaboration; building a supportive team that values difference.", "company_products_or_services": "Fintech solution enabling banks and funds globally to invest in sustainability and net-zero targets.", "job_responsibilities": "Set the vision and strategy for customer success; develop scalable success processes; build and lead the Customer Success organization; establish customer support functions; define and measure customer success metrics.", "desired_software_skills": "Experience with software, financial services, or financial technology.", "education": "null", "required_job_experience": "Experience in B2B customer-facing roles and working with C-level executives; experience establishing and managing Customer Success and Implementation systems.", "equal_employment_opportunity": "Banyan is an equal opportunity employer.", "salary": "$180,000 - $220,000 OTE", "benefits": "Top tier health plans, at work meal offerings, and fitness benefits; professional development, parental leave, a flexible time off policy, and flexible work.", "location": "San Francisco, CA.", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46367040/head-of-customer-success?source=jobs_directory"}, {"job_title": "Technical Product Owner", "company_mission": "To build a more efficient future by becoming the world’s most innovative provider of predictive technology solutions", "company_values": null, "company_products_or_services": "Renewable energy software for wind turbines", "job_responsibilities": "Managing, refining, and prioritizing the product backlog; collaborating with the software development team; supporting go-to-market activities; proposing and contributing to ongoing process improvement activities", "desired_software_skills": "Knowledge of Agile Processes and Principles", "education": "Bachelor’s degree in a STEM subject (or equivalent)", "required_job_experience": "2 years’ experience working in a Software Product Function; previous experience working as a Product Owner/Project Manager/Project Engineer; expertise in a Technical or Engineering Field", "equal_employment_opportunity": "Encourages applications from under-represented groups in the STEM sector", "salary": null, "benefits": "Flexible working environment; employer pension contributions; medical insurance; annual bonus; opportunities for volunteering", "location": "Nottingham, UK", "type_of_employment": null, "url": "https://climatebase.org/job/46366890/technical-product-owner?source=jobs_directory"}, {"job_title": "Customer Care Associate - Hyderabad", "company_mission": "Connecting farmers, local retailers, and agri-input producers to improve crop diagnosis and treatment while minimizing pesticide and fertilizer use.", "company_values": null, "company_products_or_services": "Plantix Crop Doctor app for farmers; Plantix Partner App for agri-inputs B2B platform", "job_responsibilities": "Onboarding and activating agri retailers; resolving order process problems; B2B sales inquiries and orders; growing retailers' business and payment collection; educating retailers about products and services; responding to customer concerns or questions; meeting sales targets", "desired_software_skills": null, "education": "Degree in Bsc. or Msc. Agriculture/Botany/Chemistry", "required_job_experience": "Experience in agri-sales preferred", "equal_employment_opportunity": null, "salary": "Competitive compensation package that includes salary, employee benefits, etc.", "benefits": "Company-sponsored health & accidental insurance coverage", "location": "Hyderabad", "type_of_employment": null, "url": "https://climatebase.org/job/46366851/customer-care-associate---hyderabad?source=jobs_directory"}, {"job_title": "Financial Controls Analyst", "company_mission": "Using space to help life on Earth.", "company_values": "null", "company_products_or_services": "Imaging satellites and cloud-based platform for commercial, environmental, and humanitarian sectors.", "job_responsibilities": "Assist in the oversight and execution of the Company’s SOX Compliance Program; Support the assessment process for internal controls over financial reporting; Review and ensure that key controls are properly documented and tested; Coordinate testing cadence and walkthroughs with internal and external audit; Recommend and assist in driving improvements on accounting processes, documentation, and procedures; Assist in providing guidance and support to remediate control deficiencies; Support ad hoc projects as needed.", "desired_software_skills": "Experience with SOX tools (e.g. AuditBoard, Workiva, etc) and Financial ERPs systems; Advanced Excel spreadsheet skills.", "education": "Bachelor’s degree in Accounting, Finance or other quantitative major.", "required_job_experience": "2 - 5 years of accounting or financial controls experience.", "equal_employment_opportunity": "Planet is an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification, in accordance with applicable federal, state, and local laws.", "salary": "The US base salary range for this full-time position at the commencement of employment is $68,500 - $112,600. Additionally, this role might be eligible for discretionary short-term and long-term incentives (bonus and equity). The final salary range is determined by job related experience, skills and location. The range displays our typical hiring range for new hire salaries in US locations only.", "benefits": "Comprehensive Health Plan; Wellness program and onsite massages in specific offices; Flexible Time Off; Recognition Programs; Commuter Benefits; Learning and Tuition Reimbursement; Parental Leave; Offsites and Happy Hours; Volunteering Benefits.", "location": "Global company with employees working remotely worldwide and joining us from offices in San Francisco, Washington DC, Germany, and The Netherlands.", "type_of_employment": "Full-time.", "url": "https://climatebase.org/job/46366772/financial-controls-analyst?source=jobs_directory"}, {"job_title": "Account Executive French - Wallonia Region", "company_mission": "Tackling climate change and reducing industrial energy waste", "company_values": null, "company_products_or_services": "Energy efficiency solutions", "job_responsibilities": "Build client base through the Belgian market; Present value proposition and generate customers; Transfer new customers to onboarding team; Support revenue generation programs; Develop industry network; Seek out profitable partnerships and business opportunities; Play a senior role in developing a high performance sales culture", "desired_software_skills": "CRM experience (Hubspot)", "education": null, "required_job_experience": "3+ years sales experience (with deal closing responsibilities)", "equal_employment_opportunity": null, "salary": "Competitive base salary with commission (uncapped bonus) and progression; Company car", "benefits": "All equipment necessary provided (laptop, phone etc); 500€ for home office equipment through Workwise", "location": "Walloon region, Belgium", "type_of_employment": "Full-time, remote", "url": "https://climatebase.org/job/46366705/account-executive-french---wallonia-region?source=jobs_directory"}, {"job_title": "Logistics and Supply Chain manager", "company_mission": "To facilitate the adoption of electric vehicles today to make more sustainable use of energy tomorrow.", "company_values": "Passion and dedication towards the company's mission.", "company_products_or_services": "Smart charging systems that combine innovative technology with outstanding design.", "job_responsibilities": "Coordinate, plan and direct the national and international distribution activities for the distribution of the company's materials and products; Implement the company's logistics management systems in order to ensure that the requirements are met, the certifications are achieved and maintained; Continuously improve and optimize the management of stocks in the different warehouses (external and internal); Coordinate the activities of supply, storage and distribution of materials to the production line.", "desired_software_skills": "Knowledge of WMS and planning techniques.", "education": "Technical Engineering or Higher Degree Engineering in technical branches preferably electronics.", "required_job_experience": "Minimum experience of 3-5 years in coordination in a similar position.", "equal_employment_opportunity": null, "salary": null, "benefits": "Half-day Fridays; First class private health insurance after your first month at Wallbox; Online group training sessions twice a week & other out of office activities; Free online language classes (Spanish & English) twice a week; Flexible compensation valid for restaurants & food delivery apps, transportation, childcare, and learning & development; Hundreds of discounts in different brands & services with our Wallbox Circle benefits platform; Car discounts & special advantages if you choose an EV!; Smartpoint for all your online orders & services at our offices; Free coffee; Variety of breakfast and lunch dishes, everyday, at a discounted price at our canteen.", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46366627/logistics-and-supply-chain-manager?source=jobs_directory"}, {"job_title": "Electronics Procurement Specialist", "company_mission": "To facilitate the adoption of electric vehicles today to make more sustainable use of energy tomorrow.", "company_values": "Passion and dedication towards our mission.", "company_products_or_services": "Smart charging systems that combine innovative technology with outstanding design and manage the communication between vehicle, grid, building, and charger.", "job_responsibilities": "Schedule the supply of materials/components to meet production requirements and minimum safety stock levels; Manage the electronic supply chain end to end to ensure production requirements are met; Develop strong relationships with both internal and external stakeholders to ensure inventory strategy execution.", "desired_software_skills": "Material Requirements Planning system (MRP) or IT system that is in place", "education": "Bachelor degree in Business Admin/Economics", "required_job_experience": "+4 Years of experience in a procurement role. Mandatory previous experience in industrial environments.", "equal_employment_opportunity": null, "salary": null, "benefits": "Half-day Fridays and flexible working hours; Hybrid remote policy; First class private health insurance after your trial period; Free online language classes (English) twice a week after the trial period; Flexible compensation valid for restaurants & food delivery apps, transportation, childcare, and learning & development; Hundreds of discounts in different brands & services with our Wallbox Circle benefits platform; Car discounts & special advantages if you choose an EV; Free coffee; Variety of breakfast and lunch dishes, everyday, at a discounted price at our canteen.", "location": "Zona Franca", "type_of_employment": null, "url": "https://climatebase.org/job/46366617/electronics-procurement-specialist?source=jobs_directory"}, {"job_title": "Senior Java Software Engineer", "company_mission": "Accelerating the global transition towards ‘net-zero’ by helping to build smarter, cleaner renewable energy systems", "company_values": "Certified B Corp, highlighting commitment to meeting high standards of verified performance, accountability, and transparency across 5 impact areas: governance, workers, community, environment, and customers", "company_products_or_services": "Smarter energy solutions for the energy transition and flexibility services to businesses across Europe", "job_responsibilities": "Full life cycle development, identifying and improving parts of the platform to make it more scalable, fast and secure, reviewing code, contributing ideas to product development roadmap, coaching and mentoring team members", "desired_software_skills": "Java, Spring framework, JPA/Hibernate, RDBMS/PostgreSQL, Kotlin", "education": "null", "required_job_experience": "5+ years of professional experience in Java", "equal_employment_opportunity": "Equal opportunity employer. Encourages a diverse workforce and is committed to creating an inclusive environment for all employees.", "salary": "Competitive market salary", "benefits": "Stock Appreciation Rights Plan, 30 paid holiday days per year (based on full-time), paid volunteering days, mental well-being support, flexible work (office, remote and hybrid work), remote office budget and working from home allowance, professional development and training, international and fast-paced environment, social and team events", "location": "null", "type_of_employment": "null", "url": "https://climatebase.org/job/46366476/senior-java-software-engineer?source=jobs_directory"}, {"job_title": "Infrastructure/Operations Engineer", "company_mission": "Accelerating the global transition towards ‘net-zero’ by helping to build smarter, cleaner renewable energy systems", "company_values": "Certified B Corp, committed to meeting high standards of verified performance, accountability, and transparency across 5 impact areas: governance, workers, community, environment, and customers", "company_products_or_services": "Smarter energy solutions for the energy transition", "job_responsibilities": "Manage and automate cloud-based IT infrastructure; Participate in proof of concepts to assist in defining technology direction and enabling business strategy; Consult development teams during system design from the infrastructure side; Support company growth by providing scaling and secure IT infrastructure solutions; Provide first line of support for infrastructure-related incidents and second line of support for product-related incidents; Create and maintain internal playbooks and guides; Identify and improve parts of the infrastructure to make it more scalable, faster and secure; Collaborate across teams and time zones to make things happen, review code and be open to feedback; Contribute ideas to our improvement roadmap", "desired_software_skills": "Shell or Python scripting skills; Technical background in relational databases, message queues, monitoring systems, central logging and others; Familiarity with some of the following technologies: Linux, Ansible, Terraform, Python, AWS, Spring framework, Prometheus, RDMS/PostgreSQL, TSDB/M3", "education": "null", "required_job_experience": "Experience in infrastructure automation, managing public clouds and IT security", "equal_employment_opportunity": "Equal opportunity employer, committed to creating an inclusive environment for all employees", "salary": "Competitive market salary", "benefits": "Stock Appreciation Rights Plan; 30 paid holiday days per year (based on full time); Paid volunteering days; Mental well-being support; Flexible work (office, remote and hybrid work); Remote office budget and working from home allowance; Professional development and training; International and fast-paced environment; Social and team events; Centrally located offices in multiple cities; Relocation support (if you already have a valid EU residence permit); Benefit eligibility depends on location and contract type.", "location": "GMT, GMT+1, GMT+2 or GMT+3 time zone", "type_of_employment": "null", "url": "https://climatebase.org/job/46366466/infrastructureoperations-engineer?source=jobs_directory"}, {"job_title": "Deep Learning Engineer", "company_mission": "Increase transparency and automation in waste management to accelerate the circular economy", "company_values": null, "company_products_or_services": "Camera system and AI software for waste analytics deployed in recycling plants and waste facilities", "job_responsibilities": "Developing solutions using the latest Deep Learning methods in areas of object detection, classification and semantic segmentation; Implementing and modifying machine learning methods using best software development practices; Train, analyse and report model performance; Develop tools for further automating research and analysis; Pushing the boundaries of what deep learning can do by following and building upon the latest research", "desired_software_skills": "Python (numpy, scipy, scikit-learn, OpenCV); Pytorch or Tensorflow", "education": null, "required_job_experience": "3+ years experience of applying machine learning and deep learning methods in the industry; Solid theoretical understanding of machine learning and neural networks", "equal_employment_opportunity": "100% committed to building a diverse and representative team. Whatever your race, religion, colour, national origin, gender, sexual orientation, age, marital status, or disability - we want to hear from you.", "salary": "Competitive london-based salary (salary band available upon application)", "benefits": "Employee stock option scheme; Customised hybrid working between office and home (open to remote working); 25 days holiday each year, plus bank holidays; Paid sick leave for physical and mental health needs; Unlimited fresh fruit, tea, coffee and healthy snacks; Enhanced maternity, paternity, adoption or shared parental leave; Cycle to work scheme", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46366206/deep-learning-engineer?source=jobs_directory"}, {"job_title": "Account Executive DACH (M/W/D)", "company_mission": "Revolutionizing traditional energy supply with a fully integrated and vendor-neutral solution", "company_values": null, "company_products_or_services": "Connects and controls energy generation and storage systems to form a decentral, virtual power plant; Brings millions of small producers and consumers together on the gridX platform; Intelligently controls generation plants; Displays all energy flows in the household; Integrates existing Smart Home solutions on their platform", "job_responsibilities": null, "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46366176/account-executive-dach-mwd?source=jobs_directory"}, {"job_title": "Executive Assistant (m/f/d)", "company_mission": "Enapter’s mission is to make green hydrogen affordable and accessible to all.", "company_values": "Urgency, Simplicity and Transparency", "company_products_or_services": "Anion Exchange Membrane (AEM) electrolysers that enable low-cost green hydrogen production at any scale.", "job_responsibilities": "Support executive management in their daily routines by keeping an overview and ensuring that they always have all the relevant information at their fingertips; Read and analyse letters, agendas, emails and determine their significance; take action in a timely manner; Organise, prepare for and follow-up on appointments, e.g., events, workshops, internal and external meetings; Prepare reports, presentations and assist with the drafting of business plans & strategies; Arrange and book business trips including transport and accommodation; Manage confidential information and documents in a discreet manner; Answer and route incoming calls", "desired_software_skills": "Microsoft Office, Jira and Confluence", "education": "null", "required_job_experience": "Experience in executive assistance (preferably in a fast-growing environment, in manufacturing or automotive sectors is a plus)", "equal_employment_opportunity": "Enapter welcomes diversity and explicitly welcomes any application that brings additional perspectives to Enapter.", "salary": "A competitive salary package based on the market and what you bring to the table", "benefits": "Paid sick leave for both your physical and mental health and 33.5 days paid leave (including holidays, permissions and ROL) per year; Optional access to health insurance to cover those unexpected visits to the doctor or specialist and optional access to a pension fund to help support your future savings goals! (In line with the current “C.C.N.L. settore Chimica Industria” - National Collective Bargaining Agreement for the Chemical Industry sector); Stock options for all new hires, and also for exceptional performance; Lunch tickets, coffee machines, Enapter merch, snacks and healthy treats in the office.", "location": "Pisa, Italy", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46366075/executive-assistant-mfd?source=jobs_directory"}, {"job_title": "Country Manager East Africa", "company_mission": "PUR is a private company, global leader in supply chain sustainability. We develop socio-environmental projects within the supply chains of our Corporate Partners. Through the economic and social empowerment of local communities and the introduction of sustainable development initiatives at the agricultural level, PUR seeks to address climate change, while regenerating and preserving the ecosystems upon which these supply chains depend.", "company_values": null, "company_products_or_services": "Socio-environmental projects within the supply chains of Corporate Partners, insetting, regenerative agriculture, agroforestry, forest conservation and landscape restoration", "job_responsibilities": "Support development, coordination, management and monitoring of ecosystem restoration, agroforestry and regenerative agriculture initiatives; project management, project development, deliverable management, project monitoring, planning and team management, partnerships and local representation, strategy contribution", "desired_software_skills": "Proficient in the use of Microsoft Office and Google Drive", "education": "Msc in Environmental protection, Agriculture, Natural Resource Management, Agronomy, Forestry, Business or International Relations", "required_job_experience": "Minimum of 10 years in the management of projects in Africa and/or field projects implementation worldwide", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Addis Ababa, Ethiopia", "type_of_employment": "Full-time, local contract", "url": "https://climatebase.org/job/46366046/country-manager-east-africa?source=jobs_directory"}, {"job_title": "Functional Analyst Intern", "company_mission": "To create a more affordable, convenient, flexible and sustainable way to travel.", "company_values": "Shared BlaBlaPrinciples that are the foundation of our culture and everyday decisions.", "company_products_or_services": "Community-based travel network connecting over 100 million members across 22 countries looking to carpool or travel by bus.", "job_responsibilities": "Studying Tech solutions that could be put in place to answer business needs; Leading with the Project Manager the full delivery our projects including ideation, definition of solutions, translation of business needs into project specifications for development and deployment; Coordinating internal/external Tech developments and projects tasks regarding new solutions; Ensuring the run of existing solutions in coordination with all Tech teams.", "desired_software_skills": "Project management", "education": "Master student (gap or last year)", "required_job_experience": null, "equal_employment_opportunity": "BlaBlaCar is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "salary": null, "benefits": "1 additional month parental leave; 100% paid Free unlimited carpooling & bus rides; Local meal plan policies (Swile card in France); 1 vacation day/month; 50% transportation paid in France (Forfait Mobilité Durable); Mental health support through Moka.care", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46366016/functional-analyst-intern?source=jobs_directory"}, {"job_title": "Engineering Manager - Discover Squad", "company_mission": "Connecting over 100 million members across 22 countries looking to carpool or travel by bus. By sharing rides and filling empty seats on the road, our community avoids 1.6 million tons of CO2 emissions every year.", "company_values": "null", "company_products_or_services": "Carpool, bus and soon trains", "job_responsibilities": "Defining with your Product Manager the team’s OKRs and the roadmap to achieve them; Making sure that the projects are properly scoped and defined; Ensuring that the team delivers the technical solutions to achieve the team’s OKRs while matching our standard of quality; Collaborating with other product and engineering teams; Managing team organization, staffing, hiring, career and personal development of your team staff; Fostering a culture of innovation, collaboration, and continuous improvement within the team.", "desired_software_skills": "Java, TypeScript/React", "education": "null", "required_job_experience": "First experience in a management position with proven people management skills", "equal_employment_opportunity": "BlaBlaCar is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "salary": "null", "benefits": "null", "location": "Paris", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46366013/engineering-manager---discover-squad?source=jobs_directory"}, {"job_title": "Brand Project Manager intern", "company_mission": "Connecting over 100 million members across 22 countries looking to carpool or travel by bus. By sharing rides and filling empty seats on the road, our community avoids 1.6 million tons of CO2 emissions every year", "company_values": "Shared BlaBlaPrinciples that are the foundation of our culture and everyday decisions", "company_products_or_services": "Travel network connecting carpoolers and bus travelers", "job_responsibilities": "Manage creative team workload, keep good track of project key steps, updating the roadmap accordingly; Close collaboration with our Designers and wider Marketing and Brand team to complete projects, learning how to bring communications alive and understanding how to get messages across various channels; Understanding project requirements, briefing process and ideas; Competitive review and benchmark to understand and share knowledge among category and beyond; Using feedback from our Brand team and other team members to improve; Understanding and applying global brand guidelines to all content", "desired_software_skills": "Practical knowledge of Office / Google suite; Adobe knowledge (nice to have)", "education": "null", "required_job_experience": "null", "equal_employment_opportunity": "BlaBlaCar is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "salary": "null", "benefits": "An international environment with over 45+ nationalities; A hybrid, flexible workplace with family-friendly policies; Learning opportunities via access to training, mentorship, internal development programs, or our weekly team-all BlaBlaTalks and Tech & Product Demos; Team-building events like our weekly afterworks, breakfasts, our annual Coding Night or Impact Day; A product and a workplace with a strong commitment to sustainability", "location": "null", "type_of_employment": "Internship", "url": "https://climatebase.org/job/46366006/brand-project-manager-intern?source=jobs_directory"}, {"job_title": "Office Coordinator", "company_mission": "To be the leading global provider of solutions that enable customers to release £30bn of value per annum from distributed energy resources (DERs)", "company_values": "Passion for clean tech and a strong desire to contribute to the decarbonization of the planet", "company_products_or_services": "Software as a Service (SaaS) subscription business with a global addressable market of £2.4 billion per annum, by digitally connecting hundreds of thousands of DERs with energy markets", "job_responsibilities": "Ensure our office is safe, well stocked and welcoming for our team members and visitors. Support in People Operations administration activities. Be our first point of contact for new starters and welcome them into the business. Order equipment and ensure they have the correct tools & accesses needed for their role, as well as arranging access to the building and showing them around! Support the offboarding process for anyone who leaves the business. Ensure our office is tidy and well stocked for colleagues & visitors, maintaining stock levels of technical equipment as well as food & drinks. Ensure the Audio/Video equipment in our meeting rooms is functioning correctly and liaise with Technical Operations (TechOps) in the case of any issues. Work alongside the Octopus Office Manager, build and maintain relationships with suppliers (coffee, milk, food, designers, installers, plant maintainers); building managers (for security & maintenance) as well as our cleaning team. Working as part of the People Operations team, maintain health and safety requirements such as arranging first aid training, fire marshall training & DSE assessments. Assist in facilitating company wide communications such as recordings of our all-hands meetings; and administrative support for travel bookings. Plan and run and KrakenFlex wide events such as our annual Hackathon, and any office celebrations and ensure they are successful. Be the driving force behind our thriving community, ensuring our office is welcoming and inclusive for all in KrakenFlex, including facilitating community celebrations (Christmas, Eid, pride, black history month etc) and gifts for life events in our team (weddings/new babies)", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "As an equal opportunity employer, we do not discriminate on the basis of any protected attribute. Our commitment is to provide equal opportunities, an inclusive work environment, and fairness for everyone.", "salary": "Ask during the interview process", "benefits": "Visit our perks hub - Octopus Employee Benefits", "location": "Greater Manchester", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46365717/office-coordinator?source=jobs_directory"}, {"job_title": "Senior Accountant (m/w/d)", "company_mission": "To help people unlock the full potential of urban living in one of the most dynamic and rapidly developing industries!", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Primary responsibility for all accounting and tax related activities; Leadership and development of staff; Responsibility for accounting in NetSuite (AP, AR, GL); Preparation of the monthly advance VAT return incl. OSS; Preparation of the monthly reporting as well as the annual financial statement according to HGB, account consolidation; Coordination with our external contacts (tax advisor, payroll accountant, tax office, etc.); You form the link with treasury and controlling for a holistic financial corporate management; You help to transform the start-up into a Grown-Up through accounting processes and change management; Further development of ERP system (NetSuite) for the accounting area", "desired_software_skills": "MS-Office (Excel and NetSuite)", "education": null, "required_job_experience": "Several years of experience as a (senior) accountant; Several years of professional experience in the field of accounting (start-up or grown-up) or in a tax consultancy and/or auditing firm; Ideally have initial experience as a team leader", "equal_employment_opportunity": "unu is committed to building an inclusive workplace. The company welcomes people from all different backgrounds, including age, citizenship, ethnic and racial origins, gender identities, individuals with disabilities, marital status, religions and ideologies, and sexual orientations to apply.", "salary": "Competitive salary", "benefits": "Own unu scooter; Discounted public transport ticket; Daily meal vouchers redeemable at any restaurant or supermarket; Healthy drinks and fruit in the office; Access to fitness memberships and company benefits; Own Mac or Windows laptop; Flexible hours and remote options", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46365182/senior-accountant-mwd?source=jobs_directory"}, {"Job_title": "Communications Manager", "Company_mission": "To inspire and empower everyone to fight food waste together.", "Company_values": "We win together; We raise the bar; We keep it simple; We build a legacy; We care.", "Company_products_or_services": null, "Job_responsibilities": "Collaborate with the Company’s CEO and the Denmark Country Director on different Communications-related efforts and opportunities; Lead Corporate, B2C and B2B PR activities in Denmark; Collaborate with the Global Comms team on local, regional and global B2C, B2B and Corporate Communications and crisis communications initiatives.", "Desired_software_skills": null, "Education": null, "Required_job_experience": "Relevant experience in External Communications in an international organisation.", "Equal_Employment_Opportunity": "We are an equal opportunity employer and all employment is decided on the basis of qualifications, merit and business need. If you need reasonable accommodation at any point in the application or interview process, please let us know.", "Salary": null, "Benefits": "Strong personal as well as professional development in an intense and high-growth scale-up environment.", "Location": "Copenhagen, Denmark", "Type_of_employment": null, "URL": "https://climatebase.org/job/46364991/communications-manager?source=jobs_directory"}, {"job_title": "Commercial(e) Inbound", "company_mission": "Stop food waste by transforming unsold food from stores accessible to local residents through our mobile app", "company_values": "We Win Together; We Raise the Bar; We Keep It Simple; We Build A Legacy; We Care", "company_products_or_services": "Mobile app to fight food waste", "job_responsibilities": "Contact and convince interested merchants to join the Too Good To Go app; Negotiate and persuade; Create the most suitable profile for new partners and guide them in their optimized use of the app with the ambition of zero waste; Train merchants on the use of the app so that they can save all their unsold products; Follow up with merchants during their first month on the app and accompany them to maximize their impact in the fight against food waste", "desired_software_skills": null, "education": null, "required_job_experience": "Previous commercial experience is a big plus", "equal_employment_opportunity": "Equal opportunity employer and all employment is decided on the basis of qualifications, merit and business need. If you need reasonable accommodation at any point in the application or interview process, please let us know.", "salary": null, "benefits": "Opportunity to work in a social impact company; Strong personal and professional development in an intense and fast-growing environment; Open company culture where you will have the independence and space necessary to unleash your creativity; Strong team culture where successes are celebrated together", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46364987/commerciale-inbound?source=jobs_directory"}, {"job_title": "Senior Manager, Security Network Engineering", "company_mission": "Transform the global food system and reduce the impact of climate change by making the world's most delicious, nutritious, and sustainable meat, fish, and dairy — from plants.", "company_values": null, "company_products_or_services": "Plant-based meat, fish, and dairy products", "job_responsibilities": "Architect tools & technologies; Create, communicate, and implement a risk-based process; Install and configure systems; Lead incident response activities; Manage and support initiatives; Prioritize projects; Report critical metrics", "desired_software_skills": "GCP; Azure; Manufacturing environments; disaster recovery; computer forensic tools; Okta; Azure AD", "education": "Bachelor's degree in Computer Science, Information Technology, or Information Security", "required_job_experience": "8+ years of hands-on Information Security management experience; 12+ years of total technical experience in IT networking systems; Strong technical background in security operations, IT project work, networking, IAM, SIEM, EDR, WAF, and other related Infosec technologies; Experience designing secure networks, systems and application architectures", "equal_employment_opportunity": "Impossible Foods Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, status as a protected veteran, status as a qualified individual with a disability, or any other trait protected by law. Impossible Foods offers opportunities to all job seekers including job seekers with disabilities.", "salary": null, "benefits": null, "location": "Remote (except for Alaska, Hawaii, New Mexico, Oklahoma, and Wisconsin)", "type_of_employment": null, "url": "https://climatebase.org/job/46364845/senior-manager-security-network-engineering?source=jobs_directory"}, {"job_title": "Zero Carbon Living Advisor", "company_mission": "To get to zero carbon, fast.", "company_values": "Find A Better Way; Do What’s Right; Build Something Great", "company_products_or_services": "Energy services", "job_responsibilities": "Engaging with OVO’s customers; Taking ownership for solving queries first time; Coaching squad mates; Autonomously managing your day; Identifying and implementing continuous improvement efforts", "desired_software_skills": null, "education": null, "required_job_experience": null, "equal_employment_opportunity": "Encourages everyone to join regardless of gender identity, race, ethnicity, sexual orientation, age, life experience, or background", "salary": "Competitive salary with base starting from £21,878 + 9% flex pay + monthly cash incentive opportunities", "benefits": "34 days of holiday (including bank holidays); Flex Pay (an extra 9% of your salary on top of your core pay to use as you like); Healthcare cash plan or private medical insurance depending on your career level, critical illness cover, life assurance, health assessments, and more; Gym membership, gadget, travel and cyber insurance, workplace ISA, will writing services, DNA testing, dental insurance, and more; Extra holiday buying, discount dining, culture cards, tech loans, and supporting your favourite charities with give-as-you-earn donations; Get up to £300 off any OVO Energy plan (when you pay by Direct Debit), plus personal carbon offsetting and great discounts on smart thermostats and EV chargers; Nab a great deal on ultra-low emission car leasing, plus our cycle to work scheme and public transport season ticket loans", "location": "Bristol", "type_of_employment": "Full time - 37 hours per week (shifts are Monday - Friday between 8am & 8pm, and every other Saturday and Sunday between 9am & 5pm)", "url": "https://climatebase.org/job/46364493/zero-carbon-living-advisor?source=jobs_directory"}, {"job_title": "ZCL Operational Excellence Manager", "company_mission": "To get to zero carbon, fast. We call this Plan Zero – and it shows how we’ll be fighting the climate crisis and transforming the way people use energy over the next decade.", "company_values": "Find A Better Way; Do What’s Right; Build Something Great", "company_products_or_services": "Energy supplier, leading the way in showing customers the energy world of tomorrow", "job_responsibilities": "Building and maintaining operational resource forecasts; Managing ZCL Ops systems; Supporting Data Analysts and Ops Leads; Optimizing CRM workflow management; Compliant and accurate data management; Managing stakeholder relationships; Supporting continuous improvement initiatives; Proactively making recommendations; Reporting on progress of system changes; Measuring their impact and ultimately reducing operational costs", "desired_software_skills": "CRM systems; Business Process Improvement; Systems Thinking", "education": "null", "required_job_experience": "Solid experience of delivering CRM systems improvements; Proven delivery expertise in Business Process Improvement and Systems Thinking", "equal_employment_opportunity": "Encourages diversity and inclusivity", "salary": "Between £34,000 and £53,000", "benefits": "On-target bonus; Healthcare cash plan or private medical insurance; Critical illness cover; Life assurance; Gym membership; Gadget, travel and cyber insurance; Workplace ISA; Will writing services; DNA testing; Dental insurance; Extra holiday buying; Discount dining; Culture cards; Tech loans; Supporting favorite charities with give-as-you-earn donations; Up to £300 off any OVO Energy plan; Personal carbon offsetting; Great discounts on smart thermostats and EV chargers; Ultra-low emission car leasing; Cycle to work scheme; Public transport season ticket loans", "location": "null", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46364492/zcl-operational-excellence-manager?source=jobs_directory"}, {"job_title": "Energy Storage Development Intern", "company_mission": "Building the future of energy so it is clean, simple and accessible.", "company_values": "Diversity, innovation, accessibility, sustainability", "company_products_or_services": null, "job_responsibilities": "Assist in identification, origination, and development of new standalone storage opportunities in Nexamp target markets; Assist with solar plus storage assessment and review in Nexamp target markets; Manage project data in the preparation of proposals and supporting the analysis of new programs and markets; Interface and collaborate with Nexamp’s Business Development, Engineering, Procurement and Construction (EPC) teams, Capital Markets, Operations & Maintenance, and Asset Management Services teams to ensure smooth project development and implementation; Follow changes in the storage market and evaluate potential value that different offerings can bring to Nexamp projects; Research, create, and present deliverables on market conditions, incentive programs, and new technologies to benefit other members of the Storage and the wider Business Development teams.", "desired_software_skills": "Microsoft Excel, PowerPoint and Word", "education": "Active enrollment in a college program", "required_job_experience": null, "equal_employment_opportunity": "We encourage people from minority or marginalized groups to apply. We are committed to providing a work environment free from discrimination. We are proud to be an equal opportunity employer. We do not discriminate against applicants on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, veteran status, or any other basis protected by law.", "salary": "$20-24/hour", "benefits": "Access to a Fun, Collaborative, Downtown Office Environment! We provide volunteer opportunities, company outings, and more!", "location": "New York City, NY", "type_of_employment": "Internship", "url": "https://climatebase.org/job/46364194/energy-storage-development-intern-?source=jobs_directory"}, {"job_title": "Director, Design Engineering", "company_mission": "Building the future of energy so it is clean, simple and accessible.", "company_values": "We are committed to providing a work environment free from discrimination. We are proud to be an equal opportunity employer.", "company_products_or_services": null, "job_responsibilities": "Manage a multi-level national team of PV design engineers in all phases of solar and energy storage development, construction, and asset management; Manage project design efforts through development, permitting, construction and close-out, overseeing development, permitting and construction designs, as well as creation and review of energy models throughout the project life cycle; Develop department SOPs, workflows, design standards and internal processes as well as managing relationships with internal customers and external resources; Independently set priorities, allocate resources, and make complex technical and commercial decisions, elevating to senior management when necessary; Lead the training and mentoring of engineering department personnel, enabling professional growth, and facilitating company expansion by developing regional leads and senior engineers; Manage the department strategy for enabling Nexamp’s growth through resource planning, hiring, and 3rd party turnkey engineering support, as well as developing and maintaining relationships with a network of engineering consultants; Review project drawing sets and energy models throughout development, permitting, and construction, ensuring design quality, accuracy, and conformance with Nexamp standards; Lead department in value engineering to optimize project economic and technical profile; Provide technical leadership to Nexamp development, engineering, procurement, construction, and O&M departments for the entire project lifecycle", "desired_software_skills": "AutoCAD and PVSYST software proficiency required; MS Word, Excel, and PowerPoint software proficiency; PVCase and Helioscope software proficiency preferred", "education": null, "required_job_experience": "6+ years of commercial or utility-scale solar design engineering experience; 2+ years of engineering management experience required; NABCEP Solar certification or equivalent preferred; EIT required, PE License preferred", "equal_employment_opportunity": "We are committed to providing a work environment free from discrimination. We are proud to be an equal opportunity employer. We do not discriminate against applicants on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, veteran status, or any other basis protected by law.", "salary": null, "benefits": "Our competitive compensation package; a 401(k) employer-match; health, dental, & vision insurance starting day one; Flexible Paid Time Off and Holiday PTO; Commuter Benefits, Cell Phone Reimbursement", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46364189/director-design-engineering?source=jobs_directory"}, {"job_title": "Corporate Development Associate", "company_mission": "Building the future of energy so it is clean, simple and accessible.", "company_values": "Diversity, innovation, accessibility, sustainability", "company_products_or_services": null, "job_responsibilities": "Financial modeling; Corporate investment and M&A support; Market research and business analysis; Project management; Process improvement", "desired_software_skills": null, "education": null, "required_job_experience": "Valuation experience - M&A, project finance, cost analysis; Modeling experience - finance background, building from scratch, technology integration; Financial and business analysis experience - ability to analyze both quantitative and qualitative data and create concise reports; Project and/or transaction management experience; Working with multiple stakeholders - financial, technical, developers, engineers; ability to influence team members to achieve project outcomes", "equal_employment_opportunity": "We are committed to providing a work environment free from discrimination. We are proud to be an equal opportunity employer. We do not discriminate against applicants on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, veteran status, or any other basis protected by law.", "salary": null, "benefits": "Competitive compensation package; 401(k) employer-match; Health, dental, & vision insurance starting day one; Flexible Paid Time Off and Holiday PTO; Commuter Benefits; Cell Phone Reimbursement; Hybrid work environment; Healthy snacks, coffee, yoga sessions, volunteer opportunities, company outings, and more!", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46364187/corporate-development-associate?source=jobs_directory"}, {"job_title": "Corporate Development Associate", "company_mission": "Building the future of energy so it is clean, simple and accessible.", "company_values": "Equal opportunity employer; work environment free from discrimination", "company_products_or_services": "Clean energy infrastructure", "job_responsibilities": "Financial modeling; Corporate investment and M&A support; Market research and business analysis; Project management; Process improvement", "desired_software_skills": null, "education": null, "required_job_experience": "Valuation experience; Modeling experience; Financial and business analysis experience; Project and/or transaction management experience", "equal_employment_opportunity": "Equal opportunity employer; work environment free from discrimination", "salary": null, "benefits": "401(k) employer-match; Health, dental, & vision insurance; Flexible Paid Time Off and Holiday PTO; Commuter Benefits; Cell Phone Reimbursement", "location": "Boston, MA", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46364186/corporate-development-associate?source=jobs_directory"}, {"job_title": "Corporate Development Associate", "company_mission": "Building the future of energy so it is clean, simple and accessible.", "company_values": "Nexamp is committed to providing a work environment free from discrimination. We are proud to be an equal opportunity employer.", "company_products_or_services": null, "job_responsibilities": "Financial modeling; Corporate investment and M&A support; Market research and business analysis; Project management; Process improvement.", "desired_software_skills": null, "education": null, "required_job_experience": "Valuation experience – M&A, project finance, cost analysis; Modeling experience – finance background, building from scratch, technology integration; Financial and business analysis experience – ability to analyze both quantitative and qualitative data and create concise reports; Project and/or transaction management experience.", "equal_employment_opportunity": "We do not discriminate against applicants on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, veteran status, or any other basis protected by law.", "salary": null, "benefits": "Competitive compensation package; 401(k) employer-match; Health, dental, & vision insurance starting day one; Flexible Paid Time Off and Holiday PTO; Commuter Benefits; Cell Phone Reimbursement; Hybrid work environment; Healthy snacks; Coffee; Yoga sessions; Volunteer opportunities; Company outings.", "location": "Boston, MA", "type_of_employment": null, "url": "https://climatebase.org/job/46364185/corporate-development-associate?source=jobs_directory"}, {"job_title": "IPM Scout", "company_mission": "Reinventing sustainable agriculture", "company_values": "null", "company_products_or_services": "Sustainable agriculture products", "job_responsibilities": "Daily monitoring and scouting of pest and disease in the Greenhouse; Early detection and identification of pests and diseases; Maintain insect traps in designated areas of the greenhouse and do weekly trap counts of insects; Proper management and distribution of bios (live insects or mites) according with instructions of the IPM Manager; Follow IPM protocols of pest and disease management; Compiling IPM and conventional reports for management review; Verification of pest and disease infestation trend; Fertilizer preparation; Water sampling; Variety recording and verification of data; Ensure cleanliness, adherence to all food safety policies and procedures and organization within the greenhouse", "desired_software_skills": "null", "education": "null", "required_job_experience": "Been in your current position for at least 90 days with zero corrective actions related to performance or attendance; Previous experience in greenhouse or produce environment preferred", "equal_employment_opportunity": "Must be authorized to work in the US", "salary": "null", "benefits": "null", "location": "null", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46363954/ipm-scout?source=jobs_directory"}, {"job_title": "Forklift Driver", "company_mission": "Reinventing sustainable agriculture", "company_values": null, "company_products_or_services": "State-of-the-art greenhouses", "job_responsibilities": "Operate lifting equipment; Perform maintenance on equipment; Weigh materials and record data; Inspect product load; Ensure compliance with guidelines, requirements, deadlines, and regulations", "desired_software_skills": "Proficiency in MS Office, MS Dynamics, and/or similar ERP system", "education": null, "required_job_experience": "3-5+ years of forklift operation experience preferred; 5+ years of experience in shipping, receiving, product storage, and material replenishment operations", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46363948/forklift-driver?source=jobs_directory"}, {"job_title": "Food Safety and Quality Supervisor", "company_mission": null, "company_values": null, "company_products_or_services": null, "job_responsibilities": "Lead site efforts to ensure compliance to company policy, food safety standards, government regulations, industry best practices and product quality standards; adhere to established procedures to provide a safe working environment including complying with OSHA, state/local, federal, and AppHarvest regulations and requirements; adhere to Quality work practices, follows GMP’s, maintains sanitary conditions and ensures that product quality is maintained; plan, coordinate and audit food safety/quality assurance activities and programs ensuring all department activities meet established standards; assist with the hiring and training of support staff; coordinate completion of required food safety/quality testing; review and analyze data gathered from shelf-life studies, testing, QA and Food Safety data, and other test data conducted by the department to analyze trends and/or to determine if any system improvements, or immediate corrective actions, are required; act as the site lead for customer, third party, or regulatory food safety/quality audits; supervise the site custodian, industrial hygiene, and quality assurance teams; monitor and update quality and food safety programs in conjunction with other departments to meet company, customer, food safety certification, and regulatory objectives; create new procedures/processes/techniques or evaluate change to existing ones to ensure compliance to corporate requirements; conduct training across the site to ensure compliance to all regulatory, third party, customer and internal requirements for food safety, product quality, food defense, and GMP’s; perform food safety audits and inspections and lead monthly site food safety committee meetings; maintain various tracking/trending/data reports related to Food Safety systems, such as NUOCA (Notice of Unusual Occurrence and Corrective Actions), internal audits and inspections, and pest control; conduct investigations on reported matters of food safety and/or quality; maintain records and record retention policy for production and food safety/quality records; works with plant management and Sr. Quality/Food Safety Manager to successfully resolve customer concerns involving food safety and/or quality; ensure stock of food safety/quality supplies are procured and maintained; prepare safety KPIs and build safety documentation using Microsoft Office platforms as directed by the Sr, FSQA Manager; participate in corporate FSQA audit program, conducting occasional FSQA audits at other AppHarvest facilities; and other activities as assigned.", "desired_software_skills": "Proficient in Microsoft Office (Excel, PowerPoint, and Word) and analysis capability.", "education": "Bachelor’s degree and 5+ years of relevant experience, or equivalent combination of education and/or experience.", "required_job_experience": "5+ years of relevant experience, or equivalent combination of education and/or experience.", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Berea, KY", "type_of_employment": null, "url": "https://climatebase.org/job/46363945/food-safety-and-quality-supervisor---berea-ky?source=jobs_directory"}, {"job_title": "Custodian - Richmond, KY", "company_mission": null, "company_values": null, "company_products_or_services": null, "job_responsibilities": "Adhere to established procedures to provide a safe working environment including complying with OSHA, state/local, federal, and AppHarvest regulations; Follow Food Safety plans to ensure compliance with Good Manufacturing Practice (GMP) Standards and other 3rd party audits; Keep building in clean and orderly condition; Perform heavy cleaning duties; Sweep, mop, scrub, or vacuum floors; Gathers and empties trash; Scrubs, sanitizes, and supplies restroom and locker room facilities; Dusts furniture, walls, and equipment; Cleans windows, mirrors, and partitions with soap and other cleaners; Mixes cleaning solutions and chemicals in containers in preparation for cleaning, according to instructions; Keep all supplies and cleaning materials secure, free of clutter and hazards, and in assigned storage areas; Manages inventory of cleaning supplies; Reorder supplies as needed; Operate sanitation equipment, such as power equipment and foam sprayers; Properly clean and maintain housekeeping equipment; Report maintenance concerns via work order requests to appropriate personnel; Maintain employee uniforms ensuring uniforms are cleaned, folded and ready for employees in designated areas; Stock restrooms and locker room areas with proper supplies/paper products", "desired_software_skills": null, "education": null, "required_job_experience": "Previous safety and sanitation experience in a food manufacturing environment preferred", "equal_employment_opportunity": "Must be authorized to work in the US", "salary": null, "benefits": null, "location": "Richmond, KY", "type_of_employment": null, "url": "https://climatebase.org/job/46363943/custodian---richmond-ky?source=jobs_directory"}, {"job_title": "Embedded Software Test Engineer III", "company_mission": "Motiv Power Systems is the medium-duty commercial electric vehicle (EV) leader that frees fleets from fossil fuels.", "company_values": null, "company_products_or_services": "Medium-duty electric trucks and bus chassis", "job_responsibilities": "Develop firmware tests for various components that comprise Motiv’s EV solution; Technical leadership, software design, coding, testing, and debugging as it relates to test and quality assurance for embedded software products; Design, develop, implement, and maintain test plans, test reports, manual and automated test code for embedded vehicle control software written in C and Python; Apply software quality assurances best practices; Execute vehicle and feature level testing of completed software features, and generate test reports; Conduct requirements analysis, develop test requirements documents and test design documents; Participate in peer design and code reviews; Participate in and encourage continuous improvement of software quality", "desired_software_skills": "C; Python; Linux; RTOS; doctest; cpptest; MISRA C", "education": "BS in Computer Engineering, Software Engineering, or Electrical Engineering with Software emphasis; Bachelor’s Degree in an Engineering discipline required. Master’s Degree is preferred", "required_job_experience": "3 years of industry experience developing real-time software for embedded systems; minimum of 4 years of embedded software test/quality assurance experience", "equal_employment_opportunity": null, "salary": "$125,000-165,000.00", "benefits": "Medical (including 24/7 online access to a physician); Dental; Vision; HSA; Health & Dependent Care FSA; 401(k) with company match; company paid Basic Life and AD&D; employee paid Voluntary Life and AD&D; Generous PTO policy, 11 Paid Company Holidays; EAP (Employee Assistance Program) and Education Reimbursement; Fresh daily snacks and a healthy Work/Life Balance; Access to Perks at Work - Discounted learning, tickets, electronics, travel, health, restaurants & retail; Free Online Training & Development", "location": "Foster City, CA", "type_of_employment": "Regular full-time", "url": "https://climatebase.org/job/46363780/embedded-software-test-engineer-iii?source=jobs_directory"}, {"job_title": "Chief Operating Officer", "company_mission": "To accelerate the world's transition to a more sustainable future by making energy efficiency a profitable and scalable enterprise.", "company_values": null, "company_products_or_services": "Energy efficiency technologies", "job_responsibilities": "Develop and implement operational policies and procedures; oversee and manage supply chain and procurement activities; manage the deployment of products and services; develop and implement strategies to improve business operations and transform Redaptive into an even more innovative and efficient company; monitor and analyze key performance indicators; manage and develop a high-performing team of operational staff.", "desired_software_skills": null, "education": "Bachelor's degree in business, operations, or a related field.", "required_job_experience": "10+ years of experience in operations, supply chain and procurement; proven track record of transforming operations and/or procurement and managing highly distributed customer installations; experience in regulatory compliance and technology implementation.", "equal_employment_opportunity": "This employer participates in E-Verify. Redaptive, Inc is an equal employment opportunity employer and all qualified applicants will receive consideration for employment.", "salary": "Expected annual salary: 330k (subject to adjustment for relevant experience, skills, geo location); Annual at-target bonus: 50% of salary", "benefits": "Equity plan participation; company-subsidized benefits: medical, dental, vision, life insurance; flexible spending accounts: healthcare and dependent care; immediately-vested 6% 401(k) match; monthly internet and cell phone allowance; flexible time away; volunteer activities.", "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46363738/chief-operating-officer?source=jobs_directory"}, {"job_title": "Field Services Representative Technician (BCN)", "company_mission": "To facilitate the adoption of electric vehicles today to make more sustainable use of energy tomorrow.", "company_values": "Passion; Dedication; Commitment to the world of sustainable mobility.", "company_products_or_services": "Smart charging systems that combine innovative technology with outstanding design and manage the communication between vehicle, grid, building, and charger.", "job_responsibilities": "Provide worldwide field service support to our DC and business chargers; Perform the commissioning and maintenance of DC chargers requested by our customers; Be responsible for a group of CP (Charging Points), doing technical troubleshooting of issues that arise on our fast chargers, both remotely and on site, to provide solutions to the issues; Work closely with Planners and Customer Service teams to ensure that any customer issue or operational request is resolved in a timely manner; Proactively identify potential issues before they arise on our chargers, and do a complete troubleshooting to ease the implementation of the fix; Work with engineering teams to implement improvements on our chargers; Follow all internal procedures and guidelines to ensure the best possible outcome; Actively monitor KPIs and SLAs.", "desired_software_skills": "Proficient in English.", "education": "Technical degree.", "required_job_experience": "3+ years of experience in field service.", "equal_employment_opportunity": "Equal employment opportunity regardless of race, colour, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status.", "salary": null, "benefits": "First class private health insurance after your first month at Wallbox; Free online language classes (Spanish & English) twice a week; Flexible compensation valid for restaurants & food delivery apps, transportation, childcare, and learning & development; Hundreds of discounts in different brands & services with our Wallbox Circle benefits platform; Car discounts & special advantages if you choose an EV!; Smartpoint for all your online orders & services at our offices; Free coffee & soft drinks to fuel those tough Monday mornings; Variety of breakfast and lunch dishes, everyday, at a discounted price at our canteen.", "location": "Barcelona, Spain.", "type_of_employment": null, "url": "https://climatebase.org/job/46268317/field-services-representative-technician-bcn?source=jobs_directory"}, {"job_title": "Key Partner Growth Manager", "company_mission": "To inspire and empower everyone to fight food waste together.", "company_values": "We Win Together; We Raise the Bar; We Keep It Simple; We Build A Legacy; We Care", "company_products_or_services": "Marketplace app connecting businesses that have unsold, surplus food, with consumers who can buy and enjoy it at ⅓ of retail value. Educational tools, explore new business solutions, and influence legislation to help reduce food waste.", "job_responsibilities": "Main contact for key account stores resolving issues and improving performance; set up proactive processes to ensure high retention rate, great performances, and inspire more sustainable behavior; choose relevant communication channels to deliver the right message; improve store knowledge thanks to data insights; develop strong expertise on a specific segment to customize the store journey; follow up with Customer care to ensure consumer complaints are handled promptly and collaborate with Marketing to increase consumer awareness of partners; collaborate closely with other teams to spot challenges early on and improve processes, locally and globally.", "desired_software_skills": null, "education": null, "required_job_experience": "Relevant experience in Sales, Key Account Management, or a similar commercial role.", "equal_employment_opportunity": "We are an equal opportunity employer and all employment is decided on the basis of qualifications, merit and business need.", "salary": null, "benefits": "Employment contract; private medical care; additional paid time off (5 days extra per year); variety of internal, external and international trainings.", "location": "Warsaw", "type_of_employment": null, "url": "https://climatebase.org/job/46266824/key-partner-growth-manager?source=jobs_directory"}, {"job_title": "Strategy Analyst", "company_mission": "To decarbonize energy systems by integrating sensor data with real-time portal and in-depth data analytics.", "company_values": "Mission-driven approach, cross-team collaboration, maintaining a culture where relationships are valued, feedback is crucial, and trust in each other and our products/services is paramount.", "company_products_or_services": "On-demand climate insights for emission-intensive companies, operational insights, emissions data, and Verified Climate Attributes™.", "job_responsibilities": "Research cutting edge developments in technology, market dynamics, and policy, draft reports for internal stakeholder education and awareness, develop strategic insights to identify new opportunities and refine hypotheses, develop proposals and drive to product validation and development, engage external stakeholders for data and feedback on innovative initiatives, develop processes to track and prioritize initiatives within the innovations team.", "desired_software_skills": null, "education": null, "required_job_experience": "2+ years of experience in a role requiring problem-solving and research.", "equal_employment_opportunity": null, "salary": "$75,000 - $105,000 annual base", "benefits": "Full coverage of health, dental, and vision insurance (low deductibles), 401K company match (no vesting period), stock options, student loan assistance, unlimited PTO (minimum rule of taking at least 3 weeks off in a year), company sponsored wellness days (Fall hike, ski/snowboard days and more), 12 weeks of fully paid parental leave (gender neutral) including adoptions, flex choice stipend between free parking, free RTD, or wellness assistance, dog-friendly office.", "location": "Must reside near Denver", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46128438/strategy-analyst?source=jobs_directory"}, {"job_title": "Data Scientist", "company_mission": "to fight climate change and put actionable insights starting with the energy sector", "company_values": "uncompromising standards, high-fidelity data, relationships are valued, feedback is crucial, and trust in each other and our products/services is paramount", "company_products_or_services": "SaaS-based data analytics company focused on environmental performance, assessing and scoring responsible operations, providing independent, measured emission profiles, including methane, via high fidelity continuous monitoring technology", "job_responsibilities": "developing plume dispersion modeling, building AI/ML model for emission detection, localization and quantification of pollutants, analyzing sensor data and publishing the result, developing white papers for quantification analysis, performing data analysis and discovering patterns in data using ML algorithms, engaging with various disciplines within the Project Canary team, developing and supporting scientific projects that enhance our understanding of methane emission patterns and opportunities for enhanced methane mitigation from production and distribution of oil and gas globally", "desired_software_skills": "Python programming language, C# and/or Java (preferred)", "education": "Master’s degree or PhD in Mathematics, Computer Science or Electrical Engineering with 5+ years of experience in data science and data modeling using ML algorithm", "required_job_experience": "5+ years of experience in data science and data modeling using ML algorithm", "equal_employment_opportunity": null, "salary": "$105,000 - $120,000 annual base", "benefits": "Full coverage of health, dental, and vision insurance (low deductibles), 401K company match (no vesting period), Stock options, Student loan assistance, Unlimited PTO (minimum rule of taking at least 3 weeks off in a year), Company sponsored wellness days (Fall hike, ski/snowboard days and more), 12 weeks of fully paid parental leave (gender neutral) including adoptions, Flex Choice – choice between free parking, free RTD, or wellness assistance, Pet friendly – dogs only currently", "location": "Denver", "type_of_employment": null, "URL": "https://climatebase.org/job/46077362/data-scientist?source=jobs_directory"}, {"job_title": "Bike Mechanic (ebikes)", "company_mission": "To decarbonise the last mile delivery space", "company_values": "Celebrates diversity and committed to creating an inclusive environment and equal opportunities", "company_products_or_services": "Zoomo bikes for last mile delivery", "job_responsibilities": "Assembly and inspection of new bikes; Repair and servicing of cargo bikes and e-bikes; Diagnose required services, fault find and service Zoomo e-bikes; Perform inspections on available fleet and returns; Ensure that the workshop is kept tidy; Promote our values when interacting with Zoomo riders and suppliers", "desired_software_skills": "None", "education": "Cytech Level 2 bicycle mechanics training or equivalent would be ideal but not essential", "required_job_experience": "Experience working as a bike mechanic (electric, cargo bikes or not), familiarity with all types of bikes and accessories, experience with e-bikes or lithium ion batteries, relevant industry experience (cycling, food delivery, mobility, technology)", "equal_employment_opportunity": "Equal opportunities", "salary": "Basic Salary £24,250 to £25,900 (depending on experience)", "benefits": "Autonomy and ownership of the work you do; Monthly team outings & events; Complimentary e-bike* subject to availability; Global fun with a team spread from Australia, United States, Philippines, France & MORE!; The chance to be part of an organisation in hyper-growth with plenty of opportunity for personal development; The full support of an experienced management team in helping you meet your targets and your professional goals.", "location": "Not specified", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46046528/bike-mechanic-ebikes?source=jobs_directory"}, {"job_title": "Bike Mechanic (ebikes)", "company_mission": "To decarbonise the last mile delivery space", "company_values": "Diversity and inclusion", "company_products_or_services": "Cargo bikes and e-bikes", "job_responsibilities": "Assembly and inspection of new bikes; Repair and servicing of cargo bikes and e-bikes; Diagnose required services, fault find and service Zoomo e-bikes; Perform inspections on available fleet and returns; Ensure that the workshop is kept tidy; Promote our values when interacting with Zoomo riders and suppliers", "desired_software_skills": null, "education": "Cytech Level 2 bicycle mechanics training or equivalent would be ideal but not essential", "required_job_experience": "Experience working as a bike mechanic (electric, cargo bikes or not); Relevant industry experience (cycling, food delivery, mobility, technology)", "equal_employment_opportunity": "Equal opportunities", "salary": "Basic Salary £25,500 to £27,250 (depending on experience)", "benefits": "Autonomy and ownership of the work you do; Monthly team outings & events; Complimentary e-bike* subject to availability; Working at a well-funded start-up with a strong leadership team and global presence; The chance to be part of an organisation in hyper-growth with plenty of opportunity for personal development; The full support of an experienced management team in helping you meet your targets and your professional goals", "location": null, "type_of_employment": null, "URL": "https://climatebase.org/job/46046527/bike-mechanic-ebikes?source=jobs_directory"}, {"job_title": "Production Technician", "company_mission": "Deploy power plants to meet global decarbonization goals as fast as possible", "company_values": "Integrity, execution, impact, and self-critique", "company_products_or_services": "Superconducting magnets for fusion power plants", "job_responsibilities": "Manufacturing and testing of superconducting magnets, troubleshooting and resolving manufacturing discrepancies, using mechanical and precision calibrated tools, reading and interpreting assembly drawings and wiring diagrams, communicating challenges and ideas effectively, operating production, testing and high-powered magnet equipment, identifying problems in a product and making clear recommendations to better the process", "desired_software_skills": null, "education": "High school diploma/equivalency certificate or higher", "required_job_experience": "Minimum of 1-2 years’ experience with various hand tools, Mechanical or Electrical Assembly", "equal_employment_opportunity": "Equal opportunity employer by choice, considering all qualified applicants equally for employment, without discrimination based on race, color, national origin, ancestry, citizenship status, protected veteran status, religion, physical or mental disability, marital status, sex, sexual orientation, gender identity or expression, age, or any other basis protected by law, ordinance, or regulation", "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/44998806/production-technician?source=jobs_directory"}, {"job_title": "Director of Human Resources", "company_mission": "UtilityAPI is a mission-driven software company fighting climate change by providing data access for the clean energy transition.", "company_values": "Advancing equity in the clean energy sector; building a team that looks like America; valuing non-traditional work histories and expertise; encouraging applications from groups and communities that have been traditionally underrepresented and underestimated in the energy and technology sectors.", "company_products_or_services": "Data access for the clean energy transition.", "job_responsibilities": "Codify talent pipeline processes; draft and send offer letters; carry out background and reference checks for candidates; design and implement a comprehensive, consistent employee onboarding practice; create job descriptions that are accurate and inclusive; ensure compliance with local, state, and federal employment laws; stay updated with HR trends and ensure fair and equitable compensation; own benefits process and answer employee questions; manage sensitive employee data; build and implement a performance review and evaluation process; research professional development and learning opportunities for employees; develop internal trainings and resources to address knowledge gaps within the organization; work with the COO on the ownership of the employee handbook; create Performance Improvement Plans when needed.", "desired_software_skills": "null", "education": "null", "required_job_experience": "Experience in human resources; experience recruiting for technical roles; experience working at a growing company.", "equal_employment_opportunity": "Encourages applications from groups and communities that have been traditionally underrepresented and underestimated in the energy and technology sectors.", "salary": "$110,000-$130,000 depending on experience", "benefits": "Excellent medical, dental, and vision insurance; unlimited PTO; flexible, regular hours (roughly 9-5 in your time zone); stock options; 401k with employer matching; fully remote position with home office setup stipend.", "location": "Fully remote or downtown Oakland, California.", "type_of_employment": "Full-time", "url": "https://climatebase.org/job/46363656/director-of-human-resources?source=jobs_directory"}, {"job_title": "2023 Summer Executive Office Internship", "company_mission": "Catalyze a global solution to the climate crisis by making urgent action a necessity across every sector of society", "company_values": "Building a more just and equitable world, one where all voices are heard and respected regardless of race, religion, color, national origin, sex, sexual orientation, gender identity, age, or physical ability", "company_products_or_services": null, "job_responsibilities": "Research, write, and copyedit reports, memos, speeches, and emails to support internal and external communications and engagement on behalf of the President and CEO; Assist Executive Office Director with Board support and material development ahead of August meeting; Maintain relationships with internal and external stakeholders and attend meetings as needed; Support day-to-day operations of the Executive Department through creation of agendas, logistics support, management of team priorities and deliverables, and helping to transition team during onboarding and offboarding projects", "desired_software_skills": null, "education": "Strong interest and educational background related to climate change, earth and environmental science, public policy, or similar background or degree", "required_job_experience": null, "equal_employment_opportunity": "The Climate Reality Project is an Equal Opportunity Employer and does not discriminate on the basis of race, color, religion, sex, age, national origin, veteran status, marital status, sexual orientation, disability or any other category prohibited by local, state or federal law", "salary": "$17.00/hr", "benefits": "Climate Reality Macbook to use during their internship", "location": "Washington DC", "type_of_employment": "Internship", "url": "https://climatebase.org/job/46363655/2023-summer-executive-office-internship-?source=jobs_directory"}, {"job_title": "Senior Software Engineer (Remote)", "company_mission": "Decarbonizing transportation", "company_values": null, "company_products_or_services": "Applications for electrified fleets", "job_responsibilities": "Collaborate with data scientists, product experts and business leaders to design, build, and maintain applications that model and operate electrified fleets", "desired_software_skills": "React, CSS, packaging, automated testing, Python, SQL, HTTP, Flask, container orchestration, GCP, Kubernetes, Bitbucket, CircleCI", "education": null, "required_job_experience": "Previous experience with data science pipelines, transportation industry, or electricity systems", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Remote", "type_of_employment": null, "URL": "https://climatebase.org/job/46363654/senior-software-engineer-remote?source=jobs_directory"}, {"job_title": "Principal Software Engineer (Remote)", "company_mission": null, "company_values": null, "company_products_or_services": "Electrified fleets modeling and operation applications", "job_responsibilities": "Collaborate with data scientists, product experts, and business leaders to design, build, and maintain applications; contribute to front-end, back-end, or both; bring new technical capabilities to the team and ensure their adoption in the code base and your colleagues’ skill sets; improve the use of the current tool chain; mentor junior colleagues", "desired_software_skills": "Front-end: React, CSS, automated testing, UI design, information design, Canvas-based visualization frameworks; Back-end: Python, SQL, HTTP, Flask, container orchestration, GCP, Kubernetes, Bitbucket, CircleCI", "education": "Bachelor’s Degree or equivalent work experience", "required_job_experience": "9+ years", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": null, "type_of_employment": null, "url": "https://climatebase.org/job/46124724/principal-software-engineer-remote?source=jobs_directory"}, {"job_title": "CEF Program Lead", "company_mission": "To empower influential business leaders to deliver a sustainable future by cultivating a community based on mutual trust and candor that catalyzes meaningful connections, focused insights, and bold action.", "company_values": "Relationships first; nimble entrepreneurial spirit; clarity of intent; authentic leadership; advancing the evolving role of business in society.", "company_products_or_services": null, "job_responsibilities": "Strategize and implement member-centered programs and special initiatives in alignment with CEF’s broader content strategy; Build relationships and engage with corporate sustainability leaders; Design and deploy a variety of member programs; Model positive, inclusive, respectful, and thoughtful interactions; Capture strategic member insights to inform CEF’s content strategy further.", "desired_software_skills": "Relationship management and database software experience preferred.", "education": "Academic degree (or equivalent) in sustainability or a related field of study.", "required_job_experience": "Robust experience working in the sustainability space, with a demonstrated expertise/passion in corporate sustainability; Experience facilitating complex topic discussions with senior executives, both in-person and via virtual platforms; History of formulating, organizing, and monitoring inter-connected projects.", "equal_employment_opportunity": null, "salary": null, "benefits": null, "location": "Remote position with domestic travel required for in-person team meetings 2-4 times a year and for the CEF Executive Retreat.", "type_of_employment": "Full-time independent contract.", "url": "https://climatebase.org/job/46363651/cef-program-lead?source=jobs_directory"}, {"job_title": "Partnerships Director", "company_mission": "Boosting the capacity of the climate finance ecosystem through grantmaking, contracting and dynamic partnerships with NGOs, philanthropists and others working in the space.", "company_values": null, "company_products_or_services": "Philanthropic investment in climate finance", "job_responsibilities": "Identifying gaps in the current climate finance ecosystem and building dynamic solutions to fill them through granting or contracting existing non-profit and commercial entities, identifying opportunities for mergers, or establishing new organizations through seed investment and strategic partnerships with philanthropists and/or impact investors; leading the Partnerships team and overseeing the investment portfolio of grants and contracts; implementing RFP drives; reviewing and assessing proposals; progress, performance and risk monitoring; overseeing Arc’s own fundraising efforts to ensure the long-term financial sustainability of the organization; building relationships with existing funders and attracting new ones; designing and implementing a fundraising strategy that utilizes current donor strategy alignment as well as positioning Arc with potential new philanthropic organizations and individuals not yet active in the space; supporting local fundraising efforts and identifying opportunities for Arc’s investment portfolio to complement and add value to local and regional programs and vice versa for Arc’s global network of climate finance hubs being established in emerging markets with the strategic purpose of boosting capacity at the local and regional level.", "desired_software_skills": null, "education": null, "required_job_experience": "Extensive experience in a similar role in a philanthropic or ‘re-granter’ organization; experience of having established new initiatives or organizations; knowledge and understanding of the global climate finance ecosystem; relationships and experience relevant to one or more of Arc’s strategic pillar portfolios; in-depth knowledge of key performance indicators and project evaluation methods.", "equal_employment_opportunity": null, "salary": "£140,000 - £160,000 (UK); salary will be adjusted depending on the country the successful candidate is located in.", "benefits": "28 days' holiday plus public holidays (fully flexible); private medical & dental cover for you and your dependents; life assurance 4x basic salary; 9% company pension contribution; enhanced family pay and leave policies; professional development program; professional membership paid (if applicable); flexible and open work environment with fully remote and hybrid working options that work for you and the wider team.", "location": "UK, Europe or the East Coast of the USA", "type_of_employment": null, "url": "https://climatebase.org/job/46360070/partnerships-director?source=jobs_directory"}, {"job_title": "Android mobile developer to help with Gamified Recipe App for the Climate (volunteer role)", "company_mission": "Fork Ranger's mission is to help millions of people switch to a healthy and sustainable diet.", "company_values": null, "company_products_or_services": "Habit changing app with recipes to solve climate change", "job_responsibilities": "Build the Android Fork Ranger app", "desired_software_skills": "Android app development", "education": null, "required_job_experience": "Experience building an app before", "equal_employment_opportunity": null, "salary": "None (until we earn enough or get funding)", "benefits": "A chance to make more impact than Elon Musk (changing diets can save a lot more CO2 than electric cars); The joy and friendship of working in an ambitious team; Working in a startup that has the opportunity to inspire millions of people", "location": "Amsterdam, The Netherlands (remote is possible)", "type_of_employment": "Volunteer", "url": "https://climatebase.org/job/46363627/android-mobile-developer-to-help-with-gamified-recipe-app-for-the-climate-volunteer-role?source=jobs_directory"}, {"job_title": "Research Team Manager – Third Derivative", "company_mission": "Transforming global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": "Accelerating the rate of climate innovation through an inclusive ecosystem approach, which rapidly finds, funds, and scales climate tech globally. Uniting and aligning committed investors, large corporates, and market and policy experts with the world’s most promising climate tech startups, D3 bridges finance and resource gaps to increase speed to market.", "job_responsibilities": "Conducting/managing research and diligence on impactful climate-tech startups within heavy industry, buildings, electricity, and/or transportation. Leading the development of investment hypotheses on key technology areas and presenting these investment theses to D3’s corporate and investor partners. Helping to do outreach to promising startups from around the world to apply to the D3 program. Supporting the preparation of proposals and pitch decks for specific business development opportunities. Supporting and collaborating with Third Derivative partners, including VC funds, corporates, and utilities as well as RMI and external experts. Engaging and nurturing Third Derivative’s community of technical experts and mentors. Collaboratively writing blogs, articles, reports, and thought leadership collaterals on the research to help the investment community commercialize impactful climate technologies.", "desired_software_skills": "null", "education": "Undergraduate or graduate degree in an applicable field such as science, engineering, and/or business with focus on energy and sustainability.", "required_job_experience": "4+ years of relevant work experience. Project and people management experience.", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "New Managers based in the U.S. join at the minimum to mid salary range of $103,000-$125,000. The role will have an additional 10% bonus target!", "benefits": "Medical, dental, vision insurance. 403b retirement options (5% match immediately). Life, AD&D, short-term and long-term disability. Professional and personal development (including LinkedIn Learning access). Generous paid time off. Parental leave. Commuter and wellness benefits. Casual work environment.", "location": "Remote, but commuting distance to an RMI office is preferred.", "type_of_employment": null, "url": "https://climatebase.org/job/46363648/research-team-manager--third-derivative?source=jobs_directory"}, {"job_title": "Temporary Research Support – Third Derivative", "company_mission": "Accelerating the rate of climate innovation through our inclusive ecosystem approach, which rapidly finds, funds, and scales climate tech globally.", "company_values": null, "company_products_or_services": "Climate tech accelerator program", "job_responsibilities": "Conduct research and diligence on impactful climate-tech startups; support the due diligence of startups; develop investment hypotheses; outreach to promising startups; prepare proposals and pitch decks; collaboratively write blogs, articles, reports, and thought leadership collaterals on the research", "desired_software_skills": "Excel", "education": "Undergraduate or graduate degree in an applicable field such as science, engineering, and/or business", "required_job_experience": "Relevant work experience in the buildings, transportation, electricity, or industrial sector", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "$20/hour", "benefits": "Paid time off; Sick leave; 403b Retirement Savings Plan; Casual work environment", "location": "Remote", "type_of_employment": "Temporary", "url": "https://climatebase.org/job/46363647/temporary-research-support--third-derivative?source=jobs_directory"}, {"job_title": "Research Associate - Third Derivative", "company_mission": "Transform global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Conducting research and diligence on impactful climate-tech startups; Supporting the due diligence of startups; Supporting the development of investment hypotheses; Helping to do outreach to promising startups; Supporting the preparation of proposals and pitch decks; Collaboratively write blogs, articles, reports, and thought leadership collaterals; Supporting the program delivery of a focused cohort.", "desired_software_skills": null, "education": "Undergraduate or graduate degree in an applicable field such as science, engineering, and/or business with focus on energy and sustainability.", "required_job_experience": "2+ years of relevant work experience.", "equal_employment_opportunity": "RMI is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.", "salary": "New Associates based in the U.S. join at the minimum to mid salary range of $70,000-$85,000. You would also have an additional 5% bonus target!", "benefits": "Medical, dental, vision insurance; 403b retirement options (5% match immediately); Life, AD&D, short-term and long-term disability; Professional and personal development (including LinkedIn Learning access); Generous paid time off; Parental leave; Commuter and wellness benefits; Casual work environment.", "location": "Remote, but commuting distance to an RMI office is preferred.", "type_of_employment": null, "url": "https://climatebase.org/job/46363646/research-associate--third-derivative?source=jobs_directory"}, {"job_title": "Program Assistant - Carbon-Free Transporation", "company_mission": "Transforms global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": "Market-driven solutions for a zero-carbon future", "job_responsibilities": "Support program leaders with calendar management, travel, expense reports, meeting preparation, day-to-day administrative operations, and system management", "desired_software_skills": "Proficient in Microsoft Office, Google Suite, Zoom, Monday.com, Adobe or similar tools", "education": null, "required_job_experience": "Three years of experience as an Executive Assistant, or equivalent experience, in a professional environment", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "Hourly range of $24.00-$27.00, additional 5% bonus target", "benefits": "Medical, dental, vision insurance; 403b retirement options (up to 5% match immediately); Life, AD&D, short-term and long-term disability; Professional and personal development (including LinkedIn Learning access); Generous paid time off; Parental leave; Work from home and commuter allowance", "location": "Remote position in continental United States, with offices in New York City; Washington DC; Oakland, California; Boulder, Colorado, and Basalt, Colorado", "type_of_employment": null, "URL": "https://climatebase.org/job/46363645/program-assistant---carbon-free-transporation?source=jobs_directory"}, {"job_title": "Senior Associate - CFB - Global Cooling Transformation Team", "company_mission": "Transforms global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": "Energy system interventions to cut greenhouse gas emissions at least 50 percent by 2030.", "job_responsibilities": "Conduct compelling research and assessment; structure and guide the work of more junior team members; design and create approaches and quantitative models to effectively address key questions and challenges posed by our research goals and clients; provide quantitative analysis, modeling, and support to our projects; locate and manage high quality data that sheds new light on problems and solutions; create innovative problem-solving approaches to drive project insight; synthesize recommendations into clear and compelling presentations and written reports; present quantitative information in a clear, visual format; engage with external experts via phone interviews, conferences, and on occasion, respond to outreach requests.", "desired_software_skills": "Ability to design, create, and run Excel-based models; ability to design, create and run complex models (e.g., Matlab, R, Python)", "education": "Undergraduate or graduate degree in an applicable field such as engineering (mechanical, electrical) and/or in sustainability, environment, energy-related discipline.", "required_job_experience": "At least 3 years of cumulative relevant work experience.", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "$79,000-$93,000 (minimum to mid-salary range) plus an additional 5% bonus target.", "benefits": "Medical, dental, vision insurance; 403b retirement options (5% match immediately); life, AD&D, short-term and long-term disability; professional and personal development (including LinkedIn Learning access); generous paid time off; parental leave; commuter and wellness benefits; casual work environment.", "location": "Remote-ready company with team members around the globe. This role can be located from anywhere in the continental United States. Our U.S. offices are in New York City; Washington DC; Oakland, California; Boulder, Colorado, and Basalt, Colorado.", "type_of_employment": null, "url": "https://climatebase.org/job/46363644/senior-associate---cfb---global-cooling-transformation-team?source=jobs_directory"}, {"job_title": "Manager - SE Asia Utility Transition", "company_mission": "Transform global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": "Market-driven solutions to transform global energy systems.", "job_responsibilities": "Lead project and campaign work across the Global Energy Transition Finance team; supervise 2-4 direct reports; lead diverse project teams of 3-8 contributors of varying experience levels; think creatively and critically about how to most effectively accelerate the decarbonization of global electricity systems; drive thought leadership and research efforts; structure and deliver compelling presentations and written products to bring new insights to the industry and partners; act as the lead relationship manager with certain project partners and stakeholders; manage and support up to 4 direct reports; mentor and motivate project team members and resolve any issues throughout project life cycle; lead and contribute to data-driven efforts and publications; participate in cultivating and successfully converting business development for small and medium-sized projects; lead engagements with utilities, key policymakers, and other decision-makers to communicate insights and influence the transition to clean energy; contribute to external interviews, videos, and publications to share project insights; support development team and other team leaders to develop funding strategies.", "desired_software_skills": null, "education": null, "required_job_experience": "At least 6+ years of relevant professional experience in related fields, such as utility regulation, utility strategy, climate or energy advocacy, business, law, or other fields relevant to the decarbonization of electricity systems; experience managing direct reports.", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "Minimum to mid salary range of $103,000-$121,000. Additional 10% bonus target.", "benefits": "Medical, dental, vision insurance; 403b retirement options (up to 5% match immediately); life, AD&D, short-term and long-term disability; professional and personal development (including LinkedIn Learning access); generous paid time off; parental leave; work from home and commuter allowance.", "location": "Highly preferred that this role be based in Southeast Asia. Remote-ready company with offices in New York City; Washington DC; Oakland, California; Boulder, Colorado, and Basalt, Colorado.", "type_of_employment": null, "url": "https://climatebase.org/job/46363643/manager---se-asia-utility-transition?source=jobs_directory"}, {"job_title": "Manager - Climate Finance Access Network", "company_mission": "Transform global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Assist select Caribbean governments in accessing international and domestic sources of public and private finance, and to structure finance for priority mitigation and adaptation projects; Support in designing and facilitating in-country capacity building efforts to support transfer of skills and knowledge to local staff in relevant ministries and government offices; Develop and submit climate finance funding proposals, including by navigating the range of financing sources, engaging stakeholders to fulfill funding proposal requirements, and assessing financial instruments to structure investments; Analyze financial data and use financial projections to design and recommend suitable financial structures, with an emphasis on mini-grids; Coordinate between national ministries to accelerate projects through the investment pipeline; Pursue opportunities to finance projects through domestic resources as a means of enhancing country ownership; Lead project origination activities and actively contribute in adding to the green investment project pipeline; Conduct (pre) feasibility assessment of green investment/infrastructure projects and programs engaging all relevant stakeholders; Perform financial, economic, and regulatory analysis throughout project concept and design stages in collaboration with the country teams and government counterparts; Manage project cycle, enhance project implementation process, manage and oversee junior staff and consultants to ensure successful delivery of outputs; Provide country and membership engagement expertise; Act as the lead relationship manager for the CFAN Caribbean portfolio, including liaising directly with CFAN advisor enrollment members, advisors and government focal points; Actively contribute to the implementation of CFAN’s state of the art Climate Finance Training Program; Develop strategies, case studies, and new modalities for advancing capacity building efforts and lessons learned to support climate finance advisors in accessing and mobilizing climate finance; Formulate project proposals in compliance with requirements of various climate finance funds and investors independently plan, manage and complete projects that deliver quality outcomes in a timely and inclusive manner; Form relationships with high-level government officials and partners, and engage effectively to secure buy in, underpinned by strong listening, trust building, influencing, facilitation and negotiation skills; Develop and operationalize strategies to achieve outputs and outcomes; Adhering to internationally agreed environmental and social safeguards (ESS) and gender-sensitive design requirements; Engage RMI geography teams and content experts to identify and integrate knowledge, experience, and expertise into the CFAN strategy and offerings; Support the design and development of program strategy; Engage with leadership across RMI to achieve the programmatic and project needs of CFAN; Represent RMI as an industry expert at key conferences and other public speaking events.", "desired_software_skills": null, "education": "Advanced university degree in economics, [climate] finance, business administration or another related field.", "required_job_experience": "At least 5 years of experience working in development or climate finance, preferably for financial institution or development agency; Experience accessing and structuring finance for climate investments; Experience with international climate finance institutions, particularly technical aspects of mitigation and adaptation activities; Experience with development of renewable energy projects in developing countries.", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "$103,000-$121,000 (minimum to mid salary range) with an additional 10% bonus target", "benefits": "Medical, dental, vision insurance; 403b retirement options (5% match immediately); Life, AD&D, short-term and long-term disability; Professional and personal development (including LinkedIn Learning access); Generous paid time off; Parental leave; Work from home and commuter allowance", "location": "St. Lucia", "type_of_employment": null, "url": "https://climatebase.org/job/46363642/manager---climate-finance-access-network?source=jobs_directory"}, {"job_title": "Senior Associate - Climate & Energy", "company_mission": "Transform global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Lead support for the City of Houston MORS in their efforts to enact the CAP and RH plan; Design and create approaches and quantitative models to answer questions for Houston relating to cost-effectiveness, GHG impact, local co-benefits, etc.; Engage staff at RMI and partner institutions to collect and deliver cutting edge guidance on topics such as renewable energy procurement, building energy efficiency and electrification programs, low-carbon transportation, urban planning and land-use, nature-based solutions, and industry engagement; Lead and/or support regular meetings for local government staff with other city departments, community stakeholders, and others by crafting agendas, producing slides, or developing technical analyses to enable group learning, peer interaction, and stakeholder buy-in.", "desired_software_skills": null, "education": "5+ years of professional work experience, or a graduate degree and 3+ years of relevant experience in an applicable field such as finance, economics, engineering, sustainability, local government, urban planning, or public policy", "required_job_experience": "Demonstrated technical understanding of topics such as renewable energy, building energy efficiency, sustainable transportation systems, urban planning or industry engagement", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "Typically, Senior Associate level hires based in the U.S. join at the minimum to mid salary range of $81,000-$98,000. The position has an additional 5% annual bonus target!", "benefits": "Medical, dental, vision insurance; 403b retirement options (5% match immediately); Generous paid time off; Learning & Development opportunities; Parental leave; Life, AD&D, short-term and long-term disability; Commuter and wellness benefits", "location": "Houston, TX", "type_of_employment": null, "url": "https://climatebase.org/job/46363641/senior-associate---climate--energy?source=jobs_directory"}, {"job_title": "Community Engagement Senior Associate", "company_mission": "Transforming global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": "Diversity, inclusion, impact, accountability, and entrepreneurship.", "company_products_or_services": null, "job_responsibilities": "Evaluate project opportunities and downfalls; support hub coalitions and stakeholders; connect with wide network of regional stakeholders; craft and execute community-engaging issue-based forums; support development of team members and the Institute; communicate activities internally at RMI; mentor staff at associate level; represent RMI to external partners and public audiences.", "desired_software_skills": null, "education": "Undergraduate degree", "required_job_experience": "3+ years of experience in energy project development, community organizing, campaign management related to energy and infrastructure projects; experience leading high-performing teams in a project-based work environment; knowledge in clean energy transition pathways for heavy industry and climate change.", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "$81,000-$98,000", "benefits": "Medical, dental, vision insurance; 403b retirement options (up to 5% match immediately); life, AD&D, short-term and long-term disability; professional and personal development (including LinkedIn Learning access); generous paid time off; parental leave; work from home and commuter allowance.", "location": "Remote-ready company with team members around the globe; Beautiful and welcoming offices available for meetings or focused work; Strong preference for the candidate to be based near Houston, Texas or within the state of California.", "type_of_employment": null, "url": "https://climatebase.org/job/46363639/community-engagement-senior-associate?source=jobs_directory"}, {"job_title": "Community Engagement Manager - Climate Aligned Industries", "company_mission": "RMI transforms global energy use to create a clean, prosperous, and secure low-carbon future.", "company_values": "Diversity and inclusion", "company_products_or_services": null, "job_responsibilities": "Develop strategies for equitable community engagement for industrial decarbonization projects; Evaluate opportunities and downfalls for new industrial hubs; Conduct community surveys and assessments; Support hub coalitions and stakeholders; Craft and execute community-engaging issue-based forums; Work with community organizations, governance boards, related companies and contractors; Support development of team members and the Institute; Develop external communications materials; Manage and mentor staff; Represent RMI to external partners and public audiences", "desired_software_skills": null, "education": "Graduate degree in environmental science, law or policy, economics, engineering (preferred)", "required_job_experience": "5+ years of professional work experience including at least 1+ year as a team manager; Experience managing external stakeholder relationships; Knowledge in clean energy transition pathways for heavy industry and climate change", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "$103,000-$121,000; 10% bonus target", "benefits": "Medical, dental, vision insurance; 403b retirement options (up to 5% match immediately); Life, AD&D, short-term and long-term disability; Professional and personal development (including LinkedIn Learning access); Generous paid time off; Parental leave; Work from home and commuter allowance", "location": "Remote-ready company; Strong preference for the candidate to be based near Houston, Texas or within the state of California", "type_of_employment": null, "url": "https://climatebase.org/job/46363638/community-engagement-manager---climate-aligned-industries?source=jobs_directory"}, {"job_title": "Investment and Fund Partnerships Principal – Third Derivative", "company_mission": "Transforming global energy systems through market-driven solutions to align with a 1.5°C future and secure a clean, prosperous, zero-carbon future for all.", "company_values": null, "company_products_or_services": null, "job_responsibilities": "Find capital to support the growth of startups accepted for the accelerator program; Manage and expand current operations; Coach and advise startups on fundraising strategy; Provide input into startup selection process and investment thesis development; Work with other teams to manage fund partner relationships and ensure impactful collaboration; Explore opportunities for D3 to work with other capital partners; Collaboratively write blogs, articles, reports, and thought leadership that can improve access to capital for impactful climate innovation.", "desired_software_skills": null, "education": "Undergraduate or graduate degree in an applicable field such as science, engineering, finance, and/or business with focus on energy and sustainability.", "required_job_experience": "Experience at or working closely with an early-stage venture capital or impact fund; Outstanding communication skills for working effectively on teams and clearly communicating results and key takeaways; Strong creative problem-solving skills; Comfort working with uncertainty and unfamiliar disciplines; Experience working among diverse groups with varying perspectives.", "equal_employment_opportunity": "All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.", "salary": "New Principals based in the U.S. join at the minimum to mid salary range of $140,000-$170,000. The role will have an additional 20% bonus target!", "benefits": "Medical, dental, vision insurance; 403b retirement options (5% match immediately); Life, AD&D, short-term and long-term disability; Professional and personal development (including LinkedIn Learning access); Generous paid time off; Parental leave; Commuter and wellness benefits; Casual work environment.", "location": "Remote, but commuting distance to an RMI office is preferred.", "type_of_employment": null, "url": "https://climatebase.org/job/46363637/investment-and-fund-partnerships-principal--third-derivative?source=jobs_directory"}]